{"07480": [{"end": "2020-08-12", "description": "Particularly needed Thursday evenings /nights. Thank you. We will run your license abstract. Please call Betsy at 862.200.5125.", "title": "Drive women to appointments and meetings", "zipcode": "07480", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2885019%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Strengthen Our Sisters"}], "10001": [{"end": "2020-09-01", "description": "The Institute for Immigrant Concerns is looking for an office administrator/ program assistant with an interest in immigrant affairs and Spanish-speaking skills. Duties will include: intake and registration of new students; assisting with document preparation and mailings; answering phone calls from students and teachers; monitoring expenses; and coordinating the volunteer program. We are flexible regarding schedule.", "title": "Spanish Speaking Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2855721%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2020-09-01", "description": "Are you passionate about social media? The Institute is seeking a Social Media specialist. Duties and responsibilities: -create posts for Facebook, Intagram and Twitter with spark post and/or cavas -schedule posts on buffer -create ads on Google Ads and Facebook Ads -update webpage on Wordpress -has knowledge or editor experiences of Wix About the Institute for Immigrant Concerns The Institute for Immigrant Concerns is committed to equipping immigrant communities city-wide with English skills, computer training, job readiness, and referrals for social services. The Institute empowers immigrant families and communities in their quest for social and economic independence. To reach immigrants the Institute operates across New York City and frequently collaborates with other community groups. Our staff is as diverse as our clients and draws on talented individuals to create a powerful, sustainable impact for America's newest immigrants.", "title": "Social Media Specialist", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2855715%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2020-09-01", "description": "Institute for Immigrant Concerns, a not-for-profit providing ESOL classes for adult immigrants and refugees, started in 1997, is looking for ESL instructors. Must have Bachelor's or MA Degree and at least 2 years of English teaching experience (whether domestic or abroad). Our students are all motivated and studious adults. We put great emphasis on survival English, employment and cross-cultural awareness. Applicants should be available twice a week, on Tuesdays and Thursdays for our morning/evening classes ( 9am-10:30am/6-8:30pm). We are currently looking for ESL teachers for an 8-week session, and welcome anyone with the potential of teaching future cycles. Applicants must send us a copy of their resume and a brief cover letter.", "title": "ESL Teachers for Adult Immigrants", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2003398%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2020-08-17", "description": "In an effort to ensure the continued health and safety of those homeless men and women we serve, we have started providing pre-packaged meal delivery. In order to keep up with our other food service obligations, we occasionally seek assistance in the packaging process. Please note, all volunteers must wash hands frequently throughout their shift, and wear gloves and masks at all times. This will take place at our 25th street kitchen, between 6th and 7th Avenues. Due to space and social distancing requirements, spots are limited. Available shifts are seven days per week as follows: 9am to 10:30am 1:30pm to 3:30pm If you are interested in lending a hand with this effort, please reach out for more details. Please note: Any/all potential volunteers must complete a New Volunteer Registration form, which can be found at the following link: http://www.brc.org/volunteer-registration . Once received, you will then be sent an invitation to participate in an orientation via Zoom.", "title": "Help Pre-package Meals for Those Less Fortunate - MANHATTAN", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3291738%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Bowery Residents' Committee, Inc."}, {"end": "2020-08-17", "description": "In an effort to ensure the continued health and safety of those homeless men and women we serve, we have started providing pre-packaged meal delivery. In order to keep up with our other food service obligations, we occasionally seek assistance in the packaging process. Please note, all volunteers must wash hands frequently throughout their shift, and wear gloves and masks at all times. This will take place at our 25th street kitchen, between 6th and 7th Avenues. Due to space and social distancing requirements, spots are limited. Available shifts are seven days per week as follows: 9am to 10:30am 1:30pm to 3:30pm If you are interested in lending a hand with this effort, please reach out for more details. Please note: Any/all potential volunteers must complete a New Volunteer Registration form, which can be found at the following link: http://www.brc.org/volunteer-registration . Once received, you will then be sent an invitation to participate in an orientation via Zoom.", "title": "Help Pre-package Meals for Those Less Fortunate - MANHATTAN", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3291737%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Bowery Residents' Committee, Inc."}], "10002": [{"end": "2020-09-01", "description": "Community Outreach/ Distribution Liaison: Have you ever wanted to do something AMAZING to change the world but didn't know where to start? Here is an opportunity to help underprivileged children, to help under-served children, to help the more than 55 million children displaced from school due to COVID-19, and even to help many adults who can't read. Here is an opportunity to help close the social inequality gap, by closing the opportunity gap, by closing the education gap, by closing the literacy gap, and by creating a new era of near-100% literacy for the next generation of emerging American school children. We are looking for six, very special people, who have the skills, expertise, experience, passion, and time to be part of something amazing that is about to fundamentally change the lives of millions of children. Right now, millions of children have no hope; but soon, they will have the opportunity to learn how to read, which, in turn, will open a window to education and to a world of potential for them that, not only, has never been opened before, but that has never even been seriously contemplated as a potential reality. What we are talking about is adaptive learning, gamified smartphone app, called FUNetix, that can literally, teach a child how to read, in their own home, in an average of just 12 hours of total use time! We are the American Youth Literacy Foundation, and we have been teaching children how to read for nearly 12 years! We have been developing this app for about two years, and this year we will launch this incredible smartphone app in the App Store and on Google Play by Thanksgiving, 2020, to help save millions of children from a lifetime of illiteracy! Already, there are millions of children who are struggling to learn how to read. Already, there are millions more who have given up on reading and are destined to go through life either completely illiterate, or with semi-literate skills at best. And now with the displacement of tens of millions of children from school, for an indeterminate amount of time , the loss of reading capacity of the next generation presents a new, watershed moment in American education; this can either be a crisis, and a very real threat to the future success of millions of young students, or it can become an opportunity to change the American education landscape forever , by bringing literacy to millions of children who would otherwise have continued down the same path of scarcity and deprivation as so many generations before them. So many people are asking for \\\"Real Solutions\\\" now, not just talk, or continued, seemingly never-ending \\\"conversations\\\" about social reform. At the American Youth Literacy Foundation, we believe that literacy itself, second only to family and faith, is the single most \\\"upstream\\\" component parts of that \\\"Real Solution;\\\" and that literacy is the underpinning of all education; and that education is the key to every individual's opportunity for self-actualization, and the only truly scaleable, truly proven \\\"ticket\\\" out of the oppressive burden of poverty. We are partnered with an engineering team that was one of the five, $1 million finalists, in the XPrize for Global Learning competition (the winners of which were announced last May), which was a worldwide competition for app \\\"design and development\\\" teams to design, build and deliver a tablet-based app to children in remote villages in Africa which could teach them how to read and do basic math (children of all ages, most of whom had never been to school before in their lives). The Xprize competition was incredibly successful at bringing awareness and attention to the use of technology as a potential equalizer in the world of education. The curriculum that our app is based on is a patented reading decoding system , and is so effective at teaching children how to read, that it usually only takes 4-6 hours for them to understand the basic learning tools, and another 4-6 hours for them to reach a 2nd grade reading level. Compare this to so many of our students who have been in the public school system for 6 years and still can't spell simple words like \\\"the, said, was, would, could, there or through.\\\" Compare this to millions of students who have dropped out of school, primarily because they can't read ( more than 10 million per decade (24% according to U.S. Government statistics)). More than 20 million children in grades 3-12 in America's public schools today are either completely or functionally illiterate, according to the U.S. Government&rsquo;s \\\"Annual Report Card.\\\" Our organization is a 12-year-old, nationwide, charitable 501 c 3 non-profits founded in 2008. We started out as a regional tutoring program, then became a nationwide tutoring program; but all the while, our focus has always been on finding a scalable solution to the literacy crisis in America. With the rise of the smartphone and the amazing penetration of this powerful tool (more than 80% in even the most impoverished communities), we feel that the answer we have been searching for IS in the form of an app. So for the past several years, we have been working to convert our amazing reading curriculum that teaches children how to read in 12 hours, into an app that teaches children how to read in 12 hours. And this is where you come in. We have more than 50 people working to build, test, and deliver this app to millions of children in America's inner cities and rural communities, to the barrios and the suburbs and the American Indian reservations and everywhere in-between. But in order to do this, we need to reach the people who need it the most. And in order to reach those people and those communities, we need to hear from you, and people like you who live in those communities. We need to better understand the current state of the schools and the education system at the local level in your neighborhood, town or city. We need to more fully understand the specific challenges that illiteracy and low literacy have burdened your community with, so that we can more fully develop a workable tactical plan to reverse the literacy crisis and lift those burdens, using the FUNetix Reading App. The FUNetix curriculum is approximately 12 hours and 2,000 screens that take a child from the ABC's to a 2nd-grade reading level. Children learn the fundamentals of letters and sounds and how to blend sound symbols together to form words and sentences. The app uses a super-child-friendly, phonetic code called 21E, that makes it easy to learn how to read. The FUNetix Reading System is patented and uses a special diacritic decoding system to show children the irregular spelling patterns of English, and especially how to pronounce any English word. At the American Youth Literacy Foundation, our goal is to bring the FUNetix Reading App to children who are not learning how to read in school, either because they are in schools that are failing, or because they are in difficult situations at home for a variety of reasons. Many parents are desperate for an education solution for their children, but the challenge of teaching reading to children is too great for teachers with classes of up to 40 children or more, combined with a typical \\\"off the shelf\\\" reading curriculum that is confusing and doesn&rsquo;t scale. Children get lost, confused, frustrated and bored; and many of them act out, forcing teachers to focus on classroom management as opposed to classroom learning. The REAL literacy rates in so many thousands of America&rsquo;s elementary schools are 20% or less in 3rd grade and beyond! But it doesn't have to be that way; and FUNetix is going to change ALL of this, soon! The role of a Community Liaison is as a connector. You will help Youth Lit connect to your community and many hundreds of other communities across the United States by reaching out to understand exactly how the literacy crisis is affecting people in those communities, and by finding out what specific solutions they desire, and how best we can bring our literacy app into the homes and minds of the children who need it most. A Community Liaison is someone who is passionate about ending the literacy crisis in America, and finally creating that \\\"Equal Playing Field\\\" that everyone has been talking about for so long. But a Community Liaison also brings key ideas and action steps that they believe can be taken in order to make that happen. Such steps may involve working with specific people in the community, advertising at select locations, connecting with specific organizations, or otherwise finding ways to reach the parents and children that are most in need of a new solution to reading and education. Working together, we will radically, positively impact communities all across the United States, by bringing \\\"Literacy for All\\\" to the next generation of emerging learners. We are looking for six intelligent, creative, outgoing, enthusiastic, cheerful, optimistic individuals with significant real-world experience and a willingness to both talk to and listen to people, and to identify ways to best share the benefits of our app with those children in need. This is a complex undertaking and we are looking for highly proficient and organized professional-minded individuals who have a track record of success in creating positive outcomes in their communities, and who are willing to reach beyond, to other communities like their own, to bring change across America. The specific action step that we need you to take now is to complete a google form that will be sent to you if you express interest in this position by hitting the \\\"I'm interested\\\" button. Just to be clear, our organization is an all-volunteer, mission-centric, extended virtual network, comprised of highly skilled and experienced individuals from around the country (and a few from around the world) who collaborate through cloud-based technology and platforms. Individuals interested in this position must have the confidence and ability to work in a virtual environment (as well as on the street and on the ground) using select networking and communications tools and platforms. Given the current \\\"social distancing\\\" environment that we find ourselves in, individuals must also be willing to pick up the phone, send out emails, schedule Zoom meetings and use other communications technologies to contact and build relationships within our target audience. Thank you! We hope we have given you enough information about who we are and what our mission and goals are; and we hope that this opportunity finds you at the right place and the right time in your career to make a difference and an impact, in an amazing way, for millions of children who are waiting for someone, or something, to lead them out of a life of impoverishment and into a future of unlimited possibility and potential. The specific action step that we need you to take now is to complete a google form that will be sent to you if you express interest in this position by hitting the \\\"I'm interested\\\" button. All of the information you provide in that Google form will help us develop a deeper understanding of your particular community and its needs. We will then contact a select number of people with follow up questions, and/or to schedule an interview. Just by filling out the form that will be sent to you, you will be making an invaluable contribution to this incredible cause! Thank you, and we look forward to hearing from you and to working together to bring a future of unlimited potential to every child! Mr. R. Kali Woodward Founding, Executive Director American Youth Literacy Foundation", "title": "Manhattan, NY: Help Solve the Literacy Crisis as a Community Outreach Liaison", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3296112%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "American Youth Literacy Foundation"}], "11201": [{"end": "2020-09-20", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing, and any other artistic passion they may have. - Manipulate and edit film pieces in a way that is invisible to the viewer - Understanding the production team&rsquo;s needs and specifications - Review shooting script and raw material to create a shot decision list based on scenes&rsquo; value and contribution to continuity - Trim footage segments and put together the sequence of the film - Input music, dialogues, graphics and effects - Create rough and final cuts - Ensure logical sequencing and smooth running - Continuously discover and implement new editing technologies and the industry&rsquo;s best practices to maximize efficiency. -specializes in coloring and special effects", "title": "Video Editor", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2508571%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are looking for a highly talented and experienced writer to work on A Free Bird&rsquo;s 2020 Magazine featuring the stories of children with cancer and their journeys. This is a volunteer freelance position where you will be able to work from home. Responsibilities Write content for A Free Bird 2020 Magazine Work as part of a team with other writers, photographers, illustrators and marketing specialists Collaborate with leadership on ideas Qualifications Experience at a print or digital magazine preferred Attention to detail A strong command of the English Language Ability to communicate effectively", "title": "Magazine Writer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254868%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are looking for a highly talented and experienced Game Designer/Level Designer to work out of an art educational mobile game for the children to learn all kinds of arts. Responsibilities Develop Key art images for various games Develop environment and character illustrations from concepts and sketches to finished products. Qualifications Experience in building story-driven linear levels with dynamic/interactive/scripted features. Previous experience working as a level designer. Passion for games with excellent communication skills. Previously launched mobile game design experience is a big plus Preferably a rising Junior Skills Experience with either casual or children&rsquo;s games Knowledge and passion for Art History Experience with Unity a plus", "title": "Game Designer / Level Designer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254866%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are looking for a highly talented and experienced illustrator to work on an art educational video game for children. Responsibilities: Develop key art images for various games. Develop environment and character illustrations from concepts and sketches to the finished product. Qualifications: Passion for video games, art and storytelling. Working knowledge of Illustrator, Photoshop and After Effects Working knowledge of interface design a plus Preferably a rising Junior Skills: Exceptional traditional life drawing and painting skills. Knowledge of anatomy, perspective, composition, and use of color is essential. Exceptional sketching ability for developing illustration concepts.", "title": "Illustrator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254859%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Responsibilities: Works specifically to develop organizational awareness and increase channels of communication between faculty, donors, and interested individuals through social media platforms and management of web content. Will be managing 5-15 volunteers/interns within the Graphic Design system. Implementing new ideas, flyers, posters, social media content, brochures, etc. to keep updating event and news stories ideas for the organization. Overall Responsibilities: -Writing and editing content for digital media and various social media platforms. -Reporting on current events and programs at AFB. -Assist with the creation of pictures, videos, and/or audio files. -Updating digital content and the presentation and layout of information periodically or when necessary. -Create an archive of promotional images and materials for use. -Understand and relay organization&rsquo;s mission effectively. -Manage and maintain Graphic Design Team and System. -Effectively reaching daily, weekly, and monthly goals. -Must support and maintain mission goal and statement of organization. Competencies: -Interest and/or proficiency in digital media, particularly social media including but not limited to facebook, twitter, and instagram. -Background in marketing, communication, multimedia communication, journalism, PR and/or video production or related fields. -Ability to adapt to new and ever changing forms of digital media. -Excellent writing skills and ability to pay attention to detail with strong organizational skills. -Experience with Adobe, photography, video and audio production is preferred.", "title": "Multimedia Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254856%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Overall Responsibilities: Coordinates and implements key organizational wide marketing strategies and activities within the marketing department. The Marketing Coordinator will create corporate brand awareness, work closely with the PR department to coordinate events, media coverage, also relies on limited experience and sound judgement to plan, execute and accomplish objectives. This is a six month commitment. Responsibilities: -Attends all meetings of the Organization at least weekly. -Must support, respect and maintain mission of organization. -Build and maintain relationships with resources, referrals, and other companies. -Ability to set and prioritize daily, weekly, and monthly goals encouraging growth for the organization. -Effectively maintain and manage a marketing budget consistently referring to Marketing Plan or President of the organization. -Create, deliver, and optimize marketing materials. -Research media coverage and the industry&rsquo;s trend. -Developing continuous stories for the AFB -Producing additional marketing communications such as flyers, posters, stamps, exhibition-related projects. -Produce clear and concise written correspondence in the form of letters, emails, etc. - Assisting team members with day to day marketing tasks and coordinating marketing projects and activities as requested. Skills/Qualifications: -1-2 years of experience within a marketing setting. -A Bachelors degree or working towards a bachelor degree whether in Fundraising, Marketing, Strategy, etc. -Ability to work under pressure and multitask assignments given to other volunteers and interns. -Engage other volunteers/interns in work associated with AFB and continue to assist in any way possible.", "title": "Marketing Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254852%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Overall Responsibilities: Responsible for the Public Relations activities within the organization. Develop relations associated with press releases, and utilizing multi-media outlets to its fullest extent. Overseeing and meeting goals within the department to ensure growth is being met. Responsibilities: -Identifying stories within A Free bird organization and and creating awareness to the public and media. -Creating a relationship with media outlets, maintaining that relationship and also welcoming new relationship with other media outlets. -Develop strategies that help promote our organization always pertaining to our Mission statement. -Working directly with the President of the organization to ensure goals are being met, media outlets are being reached out to, and growth is continuing within the department. -Prepare or edit organizational publications for internal and external audiences. -Respond effectively to requests for information from the media or designate another appropriate spokesperson or information source. -Establish and maintain cooperative relationships with representatives of community, consumer, employee, and public interest groups. -Attends all meetings of the Organization at least weekly. -Must support and maintain mission goal and statement of organization. Skills/Qualifications: -Must have a college degree or working towards a bachelor's degree within their school. This include an English major, or Communications Major. -Excellent writing skills. -Management skills. -Communication Skills. -Team Player. -Proactive goal setter. -Understanding and basic knowledge of google docs, Microsoft Office, including word, powerpoint, excel, access. -Be able to know basic functions of social media including, but not limited to instagram, facebook, twitter, pinterest, vlogs, blogs, vine, etc.", "title": "PR Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254845%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "As a non profit for children with cancer we are asking for an Executive Director who has a lot of long term availability. We are hoping this person can do 10-15 hours per week and stay with the organization for minimum of 6 months. This role is really for someone who is between jobs, or would like a transition position. Job Duties include, but are not limited to: Oversee and Direct General Fundraising Activities and Grant Applications. Act as a source of everyday operations. Be able to supervise and direct non profit interns and volunteers. Be able to attend events we have for the children in our Programs Department as well as PR/Marketing, and Fundraising. Guide the vision and Direction of the organization as established by the Founder. Financial/Personnel Management Oversee events, meetings, get togethers, etc. We are looking for someone who has an advanced degree such as a Master's Degree and previous work with a non profit. Leadership and interpersonal skills are required. Understanding of Google Docs, Microsoft Office, & Quickbooks Strong Financial Management Skills Excellent written and verbal skills Comfortable interacting with diverse families, organizations, and other communities. Able to manage multiple projects simultaneously.", "title": "Executive Director", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254832%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "This opportunity is for someone who is diligent with the computer and a fantastic researcher. As the KSK Manager (Kids Supporting Kids) Manager you will be Working with schools to raise money for AFB, while rewarding SCHOOL, Teachers and/or student(s) in return. -Creating Email Template letters. -Creating Call scripts for over the phone when calling schools. -Must be powerpoint efficient. -Researching different schools and companies who are available to do the KSK program. -Helping Graphic Designer create brochures and certificates for the children once program is completed. -Meeting with teachers, principal and assistant principal to discuss planning of KSK program. -Comfortable speaking in front of big audiences Our office hours are Tuesday - Thursday 10:30am - 6:00pm. You must be available at least one day out of Tuesday, Wednesday, Thursday to come into the office to work. The rest of the information and tasks can be done at home. Please forward a copy of your resume along with any relevant fundraising experience you have had in the past.", "title": "KSK Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3229926%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Collaborating with established artists by creating a mutually beneficial fundraising platform to educate and support children with cancer. This program features an amazing opportunity to support the children in each of our programs by partnering with well established artists in the community to host fundraising events with a portion of the proceeds going to benefit the children. Taking part in this program you will have the opportunity to improve the life of a child battling cancer and provide them access to the healing power of the arts! - Must be comfortable speaking with people and have fantastic communication skills via phone, in person, and email. - Be willing to put yourself out there and sometimes cold call companies/artists we have not worked with yet and have them understand the program and partner with AFB. - Prior experience in the arts such as working in a gallery is not required but will benefit you during this role. - Must be able to work with Google Drive, Microsoft Office, and be comfortable sending emails. - Be willing to work minimum 2 days a week in the office and partner with other department interns to complete tasks and projects - Must be willing to travel to our Storage Unit (Not far from our office) to grab art supplies if needed, keep track of inventory, and organize. - Organizing folders and emails and making sure all documents are current.", "title": "Program Manager - Artists Supporting Artists", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3192297%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. After a very incredible and successful year and in order to help as many kids as possible, we are seeking a Public Relations Coordinator/Manager (Intern) who can commit 5-10 hours per week for a minimum of 3 months. Position is un-paid but can apply for school internship credit. Responsibilities: Working with a small team, conceptualize and implement traditional and social media strategies and campaigns aimed at generating coverage of AFB's programs, key advocacy issues and marketing and celebrity-driven campaigns. In collaboration with our Social Media Director and Marketing Coordinator Produce blogs and other content for external publication. Edit commentaries produced by other AFB staff. Coach and supervise PR Intern Assistants. In collaboration with our Social Media Director and Marketing Coordinator Expand and nurture AFB's mainstream and social media network. In collaboration with our Social Media Director and Marketing Coordinator Build and manage our Twitter-sphere. In Collaboration with our Social Media Director and Marketing Coordinator Help manage the AFB's media database, build lists and track media coverage. Qualifications: Excellent writing and editing skills with ability to produce polished and compelling copy on tight deadlines Creativity in tapping and cultivating mainstream media and social networking communities Keen insight into the news business and understanding of what makes journalists tick Proven ability to identify and market good story ideas Prefer candidate with local or hyperlocal media relationships A positive, energetic and proactive multi-tasker who can work independently or very collaboratively, as part of a team Ability to work effectively, efficiently, diplomatically and calmly in a high-pressure environment on issues that are often complex and politically sensitive Strong listener, with a high degree of professionalism and flexibility, including the ability to prioritize and effectively manage assignments in a timely fashion", "title": "Public Relations Assistant", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191187%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Your passion and dedication will directly lead to more young people getting the arts opportunities they deserve. Overall Responsibilities: Assisting Fundraising Coordinator/VP of Fundraising with any job-related task for Fundraising assistant. Consisting of, but not limited to: scheduling appointments for Fundraising Coordinator, assisting in reaching out to donors, supporters for companies, researching information, creating documents, sending emails, setting up meetings with other department heads, reaching out to other departments for information. Responsibilities: Supports Candidate Fundraising Director in organizing meetings, staffing events and preparing materials Prepares donor meeting and event materials as necessary Plays lead role in scheduling for the department Make phone calls and send emails to lists of identified prospective donors, including keeping track of the call history. Help develop other lists of potential donors where the names are known but not contact information. Internet searching Keeping consistent relations with donors and future donors/sponsors. Assists in the development of Brochures, flyers, posters, etc. Must support and maintain mission goal and statement of organization. Meet at least once per week meet with Fundraising Coordinator. Competencies: Understanding of Google Docs Understanding of Microsoft Office, PowerPoint, Excel, Word, etc. Friendly phone personality, etiquette on being able to write emails. Highly organized. Experience with Internet Searching. Ability to multitask and help manage a few projects at once.", "title": "Fundraising Assistant", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191182%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Assist Billing Manager with any billing responsibilities. Help with the annual budget, keeping up with operational billing standards, providing analysis of each department, helping to identify and resolve billing problems, and tracking status of bills. Overall Responsibilities: Must support and maintain mission goal and statement of organization. Assist in drafting and the finalization of bills, sending to recipients. Reaching out to each department maintaining monthly statements and balances. Assist in preparing a monthly billing statement for the entire organization. Ensure billing and payment information are accurate and up to date. Assist in identifying and resolving invoice disputes and errors. Monitor status and dates of bills. Process and maintain invoices through spreadsheets and files. Working with each department for the yearly budget. Competencies : Has/working towards a degree in accounting, finance or related field. Experience with bookkeeping. Excellent organizational and communication skills. Competency with Google docs, QuickBooks, and Microsoft Office, particularly Excel and QuickBooks.", "title": "Billing Assistant Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191181%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Overall Responsibilities: Carry out any responsibilities the Administrative Department may have. Provide administrative support and ensure a smooth running of daily operations by arranging communication between all departments and all managers and the Executive Director. Responsibilities: Serve as liaison between the president and head of departments to ensure mutual understanding of tasks, goals, and agendas. Remains in constant contact with the head of departments. Updates calendars, agendas, and supporting documents on a daily basis. Organizing, storing, and managing files. Coordinate and participate in department meetings and follow up on action items. Must support and maintain the mission goal and statement of the organization. Competencies: Understanding of Microsoft Office and Google Drive, including Google + Administrative and/or bookkeeping experience. Ability to work as part of a team within a fast-paced environment. Excellent communication, both written and oral, skills. Ability to pay attention to detail.", "title": "Administration Assistant Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191178%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are seeking a Volunteer/Intern Multimedia who can commit 150 total hours over 3 months. We encourage undergraduate and graduate students seeking a for credit internship or fellowship to apply Responsibilities: Working in Photoshop to create layouts, CADS, and design web graphics, Working in Illustrator to create vector objects, print files, and marketing materials. Working in InDesign to create automatic catalogs and other materials. Working with Excel and outlook to update spreadsheets, schedule meetings, answer emails. Skill requirements: Very well trained in CS6 or earlier, especially Photoshop, Illustrator, and InDesign. Working knowledge of Excel, Outlook, Word, and PowerPoint. Knowledge and use of keyboard shortcuts and how to do tasks the fastest way. Knowledge of HTML programming is a plus, but not required. Position requirements: Detail oriented, organized, and a quick learner Follows instructions and completes projects in a timely matter. Work with minimal supervision, a proactive problem solver. Excellent references, grades, & portfolio (even a student portfolio) are required.", "title": "Multimedia Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3186731%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Assist Billing Manager with any billing responsibilities. Help with the annual budget, keeping up with operational billing standards, providing analysis of each department, helping to identify and resolve billing problems, and tracking status of bills. Overall Responsibilities: -Must support and maintain mission goal and statement of organization. -Assist in drafting and the finalization of bills, sending to recipients. -Reaching out to each department maintaining monthly statements and balances. -Assist in preparing a monthly billing statement for the entire organization. -Ensure billing and payment information are accurate and up to date. -Assist in identifying and resolving invoice disputes and errors. -Monitor status and dates of bills. -Process and maintain invoices through spreadsheets and files. -Working with each department for the yearly budget. Competencies: -Has/working towards a degree in accounting, finance or related field. -Experience with bookkeeping. -Excellent organizational and communication skills. -Competency with Google docs, Quickbooks, and Microsoft Office, particularly Excel and Quickbooks. Afreebird is open Tuesdays through Thursdays from 10:30 AM to 6:00 PM. Credit or experience internships require that you come in twice a week for 4 full hours each day. Volunteers do not have to be there for more than one full day.", "title": "Financial Accounting Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3117106%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. After a very incredible and successful year, we are seeking a highly skilled intern admin for the new year 2019. Your passion and dedication will directly lead to more young people getting the arts opportunities they deserve. Overall Responsibilities: Carry out any responsibilities the Administrative Department may have. Provide administrative support and ensure a smooth running of daily operations by arranging communication between all departments and all managers and the Executive Director. Responsibilities: * Serve as liaison between the president and head of departments to ensure mutual understanding of tasks, goals, and agendas. * Remains in constant contact with the head of departments. * Updates calendars, agendas, and supporting documents on a daily basis. * Organizing, storing, and managing files. * Coordinate and participate in department meetings and follow up on action items. * Must support and maintain mission goal and statement of organization. AFB is open Tuesdays through Thursdays from 10:30 AM to 6:00 PM.", "title": "Admin Assistant", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3024221%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Responsibilities: Assisting the Marketing Coordinator with any job responsibilities. Contacting potential donors/sponsors to help out the organization. Following organization protocol when it comes to emails/phone calls. Using templates within google drive to contact companies, also sharing folders with volunteers/interns. Researching/assisting with any job related tasks available to the assistant for review. Overall Responsibilities: -Emailing donors/sponsors. -Researching information. -Assisting Coordinator/Director with any job duties. -Ability to create templates/sharing potentially with other volunteers/interns and also outside vendors. -Keeping records of donors/sponsors. -Emailing other people with proper email etiquette. -Must support and maintain mission goal and statement of organization. Competencies: -Has/working towards in degree in Marketing or related field. -Excellent communication skills. -Understanding of Google docs and Microsoft Office. Please provide your Resume to volunteer@afreebird.org", "title": "Marketing Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3024214%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Responsibilities: Assisting the PR Coordinator or Director with any work towards the organization. Creating templates, emails, documents, etc for the Director/Coordinator. Reaching out on social media, posting pictures, hashtagging, tweeting, posting on Facebook etc. The ability to communicate properly and professionally with other volunteers/interns and prospective sponsors, donors. Overall Responsibilities: -Assisting Director/Coordinator with any emails, research, postings for social media. -Creating documents for the department potentially sharing this information with everyone. -Thinking of new and creative ideas for social media. -Reaching out whether on Facebook, Pinterest, Instagram, Twitter, to donors/sponsors etc. -Understanding email etiquette. -Must support and maintain mission goal and statement of organization. -Familiar with social media, magazine, brochures. -Working with Wordpress, C++, etc for social media. -Creating templates for the PR Department. Competencies: -Knowledge of all social media -Ability to learn and consistently change with the organization. -Computer based knowledge. -Knowledge of Google. -Knowledge of Microsoft Office.", "title": "PR Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3024212%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Give arts is a program within A Free Bird where we are given and pass along free instruments to the children so that they can use it to practice their musical talent. We also donate equipment to hospitals. Overall Responsibilities This person must be able to feel comfortable reaching out to companies via email, phone, and in person. Must be willing to find musical instruments that companies would like to donate or give away to the organization to de distributed to the children. Person must be willing to travel and give instruments to children and take photos for our social media pages. Working closely with the Programs Department and with the coordination of events where the children will receive the instruments as well as coordinating times that the children will be available to meet with you and the programs department to drop off the instruments to the children. Qualifications: Be ready to work with moving companies. Be organized as you will be keeping track of the instruments we have available. Must be willing to travel to the storage unit, chid's home, and hospital Be available 10-12 hours per week. ] Must have own laptop/computer to work from and have a smartphone device Familiar with Google Docs Willing to work individually as well as in a team. Be comfortable with social media as you will be posting and reaching out to companies via social media outposts.", "title": "Program Manager - Give Arts", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2763673%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Fundraising Program which enables the public to provide direct sponsorship to the child. Reaching out to companies and individuals who are willing to sponsor a child that the organization has within the Programs Department. This person must feel comfortable with phone calls, speaking to people in person, and reaching out via email. You will report back to the VP of Fundraising, creating graphs and charts using the Google Docs. Must be comfortable with Social media and be able to post about the organization and what sponsor a child has to offer the community. Being in contact with the Programs Department on the children that are available and what company will be sponsoring which child. Have availability of 10-12 hours per week. Understanding of Google Docs, and Excel Spreadsheets Organized and professional Great Communication Skills Be fluent on all social media platforms. Willing to work individually as well as in a team environment. Report back to the VP of Fundraising with progress as well as the Founder of the organization. Have some availability on the weekend. Be comfortable on social media platforms", "title": "Sponsor a Child Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2698240%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. After a very incredible and successful year, we are seeking a highly skilled Programs Coordinator to support our children and can commit 15-20 hours per week for a minimum of 3 months. Responsibilities: The Volunteer will assist the Programs Director with any research, projects, reaching out to individuals in/outside of the organization. Creating templates, documents, spreadsheets, etc. for the programs department to run more efficiently. Understanding the role of the Programs Director, putting all information on the calendar for Director. Overall Responsibilities: -Writing Emails for Programs Director. -Must support and maintain mission goal and statement of organization. -Researching topics for Director. -Assisting with any work Programs Director may give assistant. -Creating files, potentially sharing information with other volunteers/interns. -Creating Calendar appointments. -Reaching out to schools, hospitals, children programs, etc. -Using the phone, computer, laptop, iPad etc. Competencies: Has experience with children between the ages 4 -18. Knowledge of Google Documents/apps. Must be working towards a bachelor degree in psychology, Programs, or have a minimum of 1 year of assistant related work. Highly organized. Great communication and self-motivated.", "title": "Children Programs Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2648066%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Oversees the grant application and reception process. monitoring grants to comply with program and financial guidelines, managing budget, and allocation of funds. Must be able to manage the Grants Team, Lead and assist them with any questions they may have. Overall Responsibilities: -Research and identify grant opportunities and apply to potential sources of funding. -Oversee application process to ensure all requirements have been met. -Develop a procedure and methodology to consistently and efficiently apply for grants. -Creating and updating a list of grant funders. -Scheduling meetings, workshops, seminars and/or activities for interested parties. -Communicate and collaborate with interested parties to secure funds for the purpose of improving programs and services. -Ensure process of receiving and using grants follow both funder and organization guidelines. -Manage budget periodically to optimize allocation of funds. -Must support and maintain mission goal and statement of organization. Competencies: -Background in PR, communications, and related fields. -Being professional, personable, and persuasive in order to achieve desired results. -Proficiency in math and ability to review technical information. -Excellent communication, organizational and writing skills. -Must be a team player and be able to supervise and guide others.", "title": "Grants Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2623223%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "This Program deals with businesses who are interested in joining with A Free Bird. Things such as product placement can occur with A Free Bird, getting a large portion of the proceeds for a certain time period. This requires a lot of patience and persistence from the individual who wants to be the Coordinator. Reaching out via email, phone, and speaking to companies and following up with companies that you did not receive an answer from. Thinking outside of the box, we are looking for someone who has the ability to come up with incentives for companies to collaborate with A Free Bird and how they will benefit from working with us. Following up with companies that you have reached out to and see if they are interested in the program. Coming up with ideas for companies to work with the AFB and help raise funds for our Programs Dept. Travel to companies location. Have available 10-12 hours per week to devote your time to the organization Be comfortable with Google Docs creating forms and excel spreadsheets to keep track of companies Organized and professional demeanor Great communication skills. Willing to work individually as well as in a team. Be comfortable on all social media platforms and use it to reach out to many more individuals.", "title": "Get Excited Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2567290%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Overall Responsibilities: Responsible for picking up and delivering food to the volunteers at A Free Bird's office and transporting inventory to the required location. You will be reimbursed for gas spent traveling between any locations for the organization. Lunch will be around 1-2pm so must be available around these hours to be able to pick up the food. Food is for our Volunteers and Interns and of course you can have too! Delivery of art equipment and materials to the children of the organization either to their home or to the hospital. Upkeep of the office as well as organization of files/childrens arts materials, instruments, etc. This person will keep detailed information on the equipment we have and use google drive to create an excel spreadsheet of everything that we have as stated above. Skills/Qualifications: -Must have a drivers license and car. -Management skills. -Communication Skills. -Organized - Take inventory of pieces that we have available in office and in storage.", "title": "Operations Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2508541%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "The Get Excited Program acts as a liaison for businesses who are interested in partnering with A Free Bird. Main responsibilities include reaching out via email, phone, or in person and speaking to companies to create a meaningful connection between out organization and theirs. We are looking for someone who has the ability to come up with incentives for companies to collaborate with A Free Bird and communicate they will benefit from working with us. Qualifications Available 5-10 hours per week to devote your time to the organization Ability to work remotely Ability to travel locally on occasion. Basic experience with Google Docs and excel spreadsheets Great communication skills. Willingness to work individually as well as in a team. Experience in using social media platforms to reach out to individuals.", "title": "Program Manager - Get Excited", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2508521%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "We are a 501 (c) 3 non profit organization dedicated to inspiring and nourishing children with cancer through the therapeutic form of the arts. We are currently seeking an EXPERIENCED Event Coordinator to help us with our Annual Gala! We are currently working on our annual gala for our Organization where this is our huge Fundraising Gala event. We are currently looking for a fun, enthusiastic, and really engaging individual who has a passion for the arts, children being affected by cancer, and a willingness and drive to help us raise money and create an extraordinary event. Emailing, phone calls, reaching out to individuals to perform. Helping with finding a space, working with Fundraising Department for sponsors and donations for the event. Working with Programs to see which children are able to perform. Requires 10 hours per week as well as meeting once every week or every other week to come into the office for any questions and updates with the event! Please submit a resume to hr@afreebird.org", "title": "Event Coordinator Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2340273%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Provide strategic consultation for AFB marketing and branding across print and digital media and collaborating with marketing department to develop a plan to maximize AFB awareness through marketing campaigns. Overall Responsibilities: -Identify and report on marketing targets and goals. -Working on AFB&rsquo;s auction site. -Meeting with marketing department weekly to discuss and provide feedback on past, current, and future marketing materials and campaigns, such as next steps and/or improvements. -Evaluate the success rate of marketing campaigns. -Analyze marketing situations and pass judgement on most optimal course of action and working with Marketing Materials Specialists to allocate marketing materials and resources. -Create briefing documents and build relationships, remain in contact, and negotiate with external parties. -Research and identify new market demands and growing trends and report them to marketing department. -Must support and maintain mission goal and statement of organization. Competencies: -Has/working towards a degree in Marketing, Business, Psychology, PR and related fields. -Excellent organizational and time management skills. -Excellent verbal and written communication skills. -Ability to think critically. -Knowledgeable about different forms of print and digital media and comfortable with conducting research. -Must be able to work and coordinate with others.", "title": "Marketing Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2338744%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "In Schools Children are impacted by peer pressure, stress, independence, and high expectations. They deal with these issues by developing relationships with others who are around them. We believe if children have access to a whole community like Kids Supporting Kids, it will help alleviate some of that stress as well as benefit long term through school work, community, and relationships with others. We offer this program as a means to raise awareness around pediatric cancer and its effects on the children and those around them. KSK educates children about the importance of giving back to the community and inform them of the implications of juvenile cancer by creating an arts based interactive curriculum. Overall Responsibilities: Must feel comfortable speaking and introducing the organization to schools and researching schools to reach out to. Telephone Communication and Email communication is key and necessary. Come up with ways to have the children interact with each other and find ways to help raise funds for the organization Reach out to news companies, newspapers, etc. about the events and try to provide press towards the events Qualifications Ability to work with Microsoft Office Be able to communicate via Telephone, Emails, and in person Have an upbeat personality and can-do attitude Support mission of the organization Prior experience with events or the like", "title": "Program Manager - Kids Supporting Kids", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2286311%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: The Intern/Volunteer will assist the Programs Director with any research, projects, reaching out to individuals in/outside of the organization. Creating templates, documents, spreadsheets, etc for the programs department to run more efficiently. Understanding the role of the Programs Director, putting all information on the calendar for Director. Overall Responsibilities: -Writing Emails for Programs Director. -Must support and maintain mission goal and statement of organization. -Researching topics for Director. -Assisting with any work Programs Director may give assistant. -Creating files, potentially sharing information with other volunteers/interns. -Creating Calendar appointments. -Reaching out to schools, hospitals, childrens programs, etc. -Using the phone, computer, laptop, ipad etc. Competencies: -Knowledge of Google Documents/apps. -Must be working towards a bachelors in psychology, Programs, or have a minimum of 1 year of assistant related work. -Highly organized. -Great communication and self motivated.", "title": "Programs Assistant", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2068411%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Overall Responsibilities: Responsible for the Public Relations activities within the organization. Develop relations associated with press releases, and utilizing multi-media outlets to its fullest extent. Overseeing and meeting goals within the department to ensure growth is being met. Responsibilities: -Identifying stories within A Free bird organization and and creating awareness to the public and media. -Creating a relationship with media outlets, maintaining that relationship and also welcoming new relationship with other media outlets. -Develop strategies that help promote our organization always pertaining to our Mission statement. -Working directly with the President of the organization to ensure goals are being met, media outlets are being reached out to, and growth is continuing within the department. -Prepare or edit organizational publications for internal and external audiences. -Respond effectively to requests for information from the media or designate another appropriate spokesperson or information source. -Establish and maintain cooperative relationships with representatives of community, consumer, employee, and public interest groups. -Attends all meetings of the Organization at least weekly. -Must support and maintain mission goal and statement of organization. Skills/Qualifications: -Must have a college degree or working towards a bachelor's degree within their school. This include an English major, or Communications Major. -Excellent writing skills. -Management skills. -Communication Skills. -Team Player. -Proactive goal setter. -Understanding and basic knowledge of google docs, Microsoft Office, including word, powerpoint, excel, access. -Be able to know basic functions of social media including, but not limited to instagram, facebook, twitter, pinterest, vlogs, blogs, vine, etc.", "title": "Public Relations Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2046399%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Overall Responsibilities: The fundraising manager will raise money for the organization through the fundraising department. Using different methods and campaigns to raise money from organizations, individuals, grants, or receiving donations from those organizations, individuals, and grants to help the organization succeed and grow. The Fundraising Manager will report solely to the Executive Director of the organization. Responsibilities: -Creating a list of new/current donors or sponsors for the organization. -Sends emails, makes phone calls to prospective donors. -Accepts gifts from donors, and assures thank you letters and receipts are sent promptly and according to the organization policy. -Helps Plan and attend all functions of the Organization this includes special events for fundraising purposes. -Coordinates in a timely manner communications with current and prospective donors, either by email, phone, text, etc. -Prepares reports for Board of Directors and Executive Director as necessary. -Attends all meetings of the Organization at least weekly. -Works with other volunteers and interns to create and collect materials for the organization such as brochures, newsletters, special projects, annual reports, etc. this position is not limited to these materials however does include these materials within their job title. -Must complete all other assignments as required by the Executive Director. -Must support and maintain mission goal and statement of organization. -Attends all meetings of the Organization at least weekly. Skills/Qualifications: -Minimum Bachelors Degree preferably in marketing, fundraising, or a related field. -Ability to communicate effectively including having exceptional oral and writing skills. -Attention to detail is key, able to manage multiple projects at the same time, have strong math skills. -Ability to create documents, letters, brochures. -Knowledge of marketing, sales, fundraising practices and techniques that are current. -Understanding and basic knowledge of google docs, Microsoft Office, including word, powerpoint, excel, access.", "title": "Fundraising Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2046385%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "11205": [{"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. The Program Manager for Volunteer Benefits will be working towards finding donated supplies towards the organization for our interns/volunteers. This person must have a can-do attitude, be self-motivated, and be able to communicate well with the HR Director. This person will research current and new companies to allow us to still be able to thank our volunteers, coming up with Volunteer of the month and receiving a gift for them, volunteer for the week. Working closely with Google docs to create excel spreadsheets, etc. The Program Manager for Volunteer Benefits should have: Excellent writing, interpersonal and organizational skills A great attention to detail and ability to maintain confidentiality Previous administrative or HR experience a plus work remotely Commit to 5-10 hours a week Passion for our mission", "title": "Program Manager - Volunteer Benefits", "zipcode": "11205", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2484723%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "10455": [{"end": "2020-07-24", "description": "Want to help in our first family eventof the summer? Come and volunteer with us in the bronx for Family Resource Day in the Bronx! We are looking for 25-30 volunteers to help our staff with our social distance celebration event. Families will learn about local resources from Catholic Charities and our partner organizations, while children get to feast on popcorn and carnival like snacks! Date: Friday, July 24th, 2020 Location: 537 East 146 th Street, Bronx, NY 10455 Shifts: 8am-2pm 8am-10am 10am-2pm What you will do: Set up is between 8am-10am. We need help setting up tents, chairs, signage and more. Crowd control and social distance check in. Serving and prepare food snacks alongside CCNY staff. Break down is between 1pm-2pm COVID 19 POLICY Upon arrival please wear a face mask. All staff members will wear a face covering and we are asking the public to arrive with one as well. TIP- You can bring a second mask to change into. Please use all hand sanitizing stations frequently. Bonus: Our staff is running low on glove supplies at this location. It would be a tremendous help if every volunteer could bring a box of gloves to support this event! We also welcome teen volunteers ages 16-18!", "title": "Family Resources Day at the Betances Houses", "zipcode": "10455", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3302393%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Catholic Charities of the Archdiocese of New York"}], "10029": [{"end": "2020-10-07", "description": "We need a volunteer Security Guard to assist on the food pantry line, to help keep order and deescalate tense situations that have been arising in the last weeks. We are serving over 500 people a day, and some of the clients can be aggressive towards staff/volunteers, and we have had to call the police. This position is good for a retired police officer or a trained security guard, or even for someone who has worked as a bouncer. Able to handle difficult, aggressive individuals without force. Bilingual helpful, but not necessary. For more details, please send your resume/letter of interest to tgough@lsafhs.org", "title": "Volunteer Security Guard Needed to Assist on our food pantry line", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3304137%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "LSA Family Health Service"}], "10024": [{"end": "2020-08-13", "description": "Do you want to make a difference this summer in your community? Join a group of socially conscious teens for the DOROT Summer Teen Internship Program, where you'll earn over 100 community service hours while connecting with older adults. The DOROT Summer Teen Internship Program welcomes highly motivated and socially conscious rising 10th-12th graders who want to make a difference in the lives of older adults. Over the course of 4 weeks, interns work with peers, develop leadership skills and form meaningful connections through a variety of hands-on intergenerational experiences in the community and at program sites. Students earn over 100 hours of community service and develop hands-on leadership experience. In light of the ongoing COVID-19 pandemic and in an effort to ensure the health and safety of all of our participants, DOROT will be running our Summer Teen Internship Program remotely this summer. Join us by video and telephone platforms from the safety of your own home! 2020 Summer Teen Internship Program Dates: Summer Teen Internship - Manhattan Session I: 6/22 - 7/16 Summer Teen Intnernship - Manhattan Session II: 7/20 - 8/13 Summer Teen Internship - Riverdale: 7/20 - 8/13 Summer Teen Internship - Brighton Beach (bilingual Russian/English program): 7/20 - 8/13 Learn more and apply at www.dorotusa.org/summerteenapp Questions? Contact teens@dorotusa.org or (212) 769-2850.", "title": "DOROT Summer Teen Internship Program", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3262069%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}], "07605": [{"end": "2020-09-12", "description": "Join Project Purple on September 14th as we run and walk to BEAT Pancreatic Cancer through beautiful Overpeck County Park in Leonia NJ. We are in need of volunteers to help us make this a successful event! Volunteer responsibilities include but are not limited to: parking cars, pre-registration day of registration food/water on course water stations traffic control course direction We ask that all volunteers be available from 6:15am-12:45pm Check out our website and the event page for this race... http://www.projectpurple.org/ https://raceroster.com/events/2019/20735/steps-for-a-cure-of-pancreatic-cancer-in-memory-of-donna-cutrone Any and all volunteers interested in lending a helping hand the day of the event must email me with their name and numbers (in case we need to reach you on race day). GATHER SOME FRIENDS AND COME OUT TO VOLUNTEER FOR AN AMAZING CAUSE!!", "title": "Steps For A Cure At Overpeck County Park", "zipcode": "07605", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3178037%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Project Purple"}], "07505": [{"end": "2020-08-26", "description": "We are seeking interns to help with our PCCYC program which create an environment where parents, residents, and community partners can come together as active and equal partners to identify and discuss the needs, concerns, aspiration and success regarding issues that affect the health, education, and wellbeing of their children.", "title": "Passaic County Council for Young Children (PCCYC) Intern", "zipcode": "07505", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3225474%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "NEW DESTINY FAMILY SUCCESS CENTERS, INC"}], "10036": [{"end": "2020-07-24", "description": "Join us as we Stop The Silence in our hurting communities. Let&rsquo;s use our voice to speak up against social injustice, providing hope for the future to our younger generations. Let&rsquo;s come together and mourn with our family and friends and use our voice to stop another George Floyd from happening. A platform that welcomes all to join in solidarity as ONE people, under the one who made us in HIS image to point our words towards building, healing, and inspiring the next generation to Stop The Silence. Stand in unity. Speak up against injustice. Pray for our nation. A Dynamic Gathering in Times Square on Friday, July 24th from 6-8:30pm.", "title": "Stop The Silence - Times Square 7/24/2020", "zipcode": "10036", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3303212%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Stop The Silence"}], "07501": [{"end": "2020-09-29", "description": "Now organizing a team to clean then photograph to catalogue the Knapp mural panels. https://www.youtube.com/watch?v=g6r8WpX04X8 Knapp mural is actually over 260 tiles. These tiles are in the museum's storage in temporary space is right off route 19 and 80 on Spruce street in Paterson; its also known as the Art Factory. The Bergen Museum's mural once hung on the Alexander's dept. store on route 4 and 17. It was created by Stefan Knapp and the museum needs volunteers to help clean the panels in preparation of a Knapp Mural Panel Exhibit. po volunteer in assisting in this cataloguing process please contact me. We'd like to have things in place so work can begin in May.", "title": "Clean & Photograph Stefan Knapp 260 Alexander Mural Panels", "zipcode": "07501", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2071510%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Bergen Museum of Art and Science"}], "07465": [{"end": "2020-08-05", "description": "Pull up peel and stick tiles, 23 x 43. Put in plywood subfloor. Put down new tile system. For a children's learning center. Reliability is more important than if you've ever done this! Individual or group.", "title": "Replace flooring", "zipcode": "07465", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3300964%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Strengthen Our Sisters"}, {"end": "2020-08-05", "description": "#1 Most important: Please, fix flashing around the vent from the stove. It is a flat roof. It leaks into pails in the kitchen when it rains now! 2. Please, rehang some fallen gutter leaders. Thank you. Please call Betsy at 862.200.5125.", "title": "Roof Work on flat roof", "zipcode": "07465", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3280417%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Strengthen Our Sisters"}], "06854": [{"end": "2020-10-06", "description": "If you are looking for a way to give back in the community, please consider our outdoor Farmer's Market as a (gloved, social distanced) hands-on opportunity to make a difference. Volunteers who can give us one or two hours on one or more Wednesdays between 10:45 am and 3 pm are needed this summer and fall to ensure vendors and shoppers are observing social distancing, mask, and hand sanitizing protocols, to staff information tables with nutritional information, and lend a hand during our COVID19-modified Healthy Back to School and Eating Well days during national Health Center Week in August. Bilingual Spanish/English desirable but not required. Volunteers will be provided with masks and gloves. Our Market will be opening for the 2020 season on Wednesday, July 8 and will return every Wednesday from 11 am to 3 pm until Thanksgiving. Norwalk Community Health Center hosts a public Farmer's Market in its parking lot every Wednesday in season. It has provided access to fresh fruit, vegetables, eggs, honey, and plants for the past 10 years and fills an important and growing need for our patients and in our neighborhood. The Health Center's Farmer's Market voucher program, funded by individual contributions and support from Newman's Own Foundation, Harvard Pilgrim Health Care and others makes fresh produce more affordable as well more accessible to food-insecure patients by stretching their food dollars. More than 300 patient families used these vouchers to shop at our Farmer&rsquo;s Market for seasonal local produce in 2019. Given the spike in unemployment and underemployment that has affected our patients in greater proportion that the rest of the community, we anticipate an even busier season in 2020. Corporate, Faith-based or other Groups - together or with one or more members rotating from week to week- are welcome.", "title": "Weekly Farmer's Market", "zipcode": "06854", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3297287%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Norwalk Community Health Center"}], "10580": [{"end": "2020-09-13", "description": "Volunteers needed to staff event tables at our popular Fall Family Festival - Jay Day! Lunch and volunteer hat or T-shirt included while supplies last. Great way to earn community service hours for teens (please bring forms for signature). The event is part of the Hudson River Valley Ramble and draws over 1300 people annually! Helpers needed for event set-up (tables and tents, signage), admissions tables (work with a friend or make new ones!), family arts and crafts activities (managing queues, helping with paint and glue projects) and much more.", "title": "Do you love American History & Outdoor events? Help us at Jay Day!", "zipcode": "10580", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1426303%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jay Heritage Center"}], "11724": [{"end": "2020-09-17", "description": "Volunteer for United Cerebral Palsy of Long Island! Our annual golf outing, originally planned for June, has been rescheduled for September 17 and relocated to the gorgeous Cold Spring Country Club! Spend the day with a wonderful group of friends, UCP-LI staff and other volunteers as you welcome our donors and help ensure the day runs smoothly. Volunteer tasks include: checking guests in as they arrive, selling raffle tickets, manning the \\\"prize\\\" holes on the golf course, prepping the main ballroom for cocktails/dinner, selling chances on a LUCKY DAY board, etc. This is a very fun, very fast-paced day. The best part? You will feel GREAT knowing you donated your time to UCP-LI and supported our important mission of helping people with disabilities live a life without limits. Dress code is \\\"golf\\\" comfortable: khaki's and a white shirt. Breakfast, lunch and dinner are included. Students 18 years+ are welcome. So are golf enthusiasts and anyone looking to support a wonderful organization and have a great day! Thank you!", "title": "2020 Golf Classic", "zipcode": "11724", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3085673%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "UNITED CEREBRAL PALSY ASSOCIATION OF LONG ISLAND INC"}], "08540": [{"end": "2020-08-03", "description": "Becoming a peer support group facilitator at Good Grief is a unique, engaging, and transformative volunteer experience. Facilitators at Good Grief help to create a safe and empathic environment for grieving children and families after the death of a loved one by helping foster resiliency and develop healthy coping skills that will serve them for the rest of their lives. Good Grief is respected as a national leader in delivering childhood bereavement services. Since its founding in 2004, the mission of Good Grief has been to provide free and unlimited support to grieving children, teens, young adults, and their families after the death of a parent or sibling.", "title": "Become a Peer Support Group Facilitator at Good Grief: Princeton", "zipcode": "08540", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3286007%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Good Grief"}], "11211": [{"end": "2020-09-27", "description": "Who We Are Rescuing Leftover Cuisine is a 501(c)3 non-profit focused on providing a reliable food rescue service by fostering community connections to reduce food waste and food insecurity. What We Do We partner with licensed food vendors (offices, restaurants, etc) who know they will have excess, wholesome cuisine and link their food donations to a human service agency within their local community. We then provide volunteer Food Rescuers to collect that excess food on a weekly (sometimes daily!), recurring basis, and walk it to the human service agency to help feed individuals who could benefit from a good meal!! Who We Need YOU!! RLC is currently seeking passionate and committed leaders who are willing to take on the role of Core Rescuer and lead 5 food rescue events on a weekly, recurring basis! Each event typically lasts around 30-60 minutes on any day of the week, and the average number of volunteers you would be working with is three. As a Core Rescuer, you will use your (R)esourcefulness, (L)eadership, and (C)ommunication skills to ensure that the rescued food arrives at its destination safely while providing a positive and supportive experience for all volunteers assisting you on your event. If you are able to commit to leading the same 5 food rescue events per week, you will receive compensation in the form of an unlimited monthly MetroCard in order to reimburse you for your trips around the city! Must be 18 years or older.", "title": "FIGHT FOOD WASTE AND HUNGER IN WILLIAMSBURG !", "zipcode": "11211", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3300575%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Rescuing Leftover Cuisine Inc"}], "11217": [{"end": "2020-08-09", "description": "The Human Resource Assistant position at A Free Bird provides support to the HR Director for all HR administrative processes. The role will be responsible with assisting with recruitment, onboarding, and researching information pertaining to the Human Resources Department. The Volunteer/Intern will maintain records and information for the business. The assistant will schedule appointments, have the ability to work independently and within a team environment; ability to efficiently organize materials and information, ability to easily adjust to changing conditions, maintain effective working relationships with employees an individuals. Responsibilities: -Creating spreadsheets & documents within google drive and Microsoft office. -Assisting with Calendar appointments -Scheduling and participating in interviews -Recruitment & Onboarding of new team members -Organizing and updating documents relating to HR - Creating a pool of volunteers and interns - Updating and posting of jobs online - Evaluating resumes as per job descriptions -Communicating with volunteers/interns and outside representatives as required Competencies: -Working towards/completed a qualification in Human Resources -Ability to maintain confidentiality at all times -Understanding of Google Drive -Understanding of Microsoft Office Suite - PowerPoint, Excel & Word -Highly organized and professional", "title": "HR Assistant", "zipcode": "11217", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2970099%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird, a 100% volunteer-based 501(c)(3) non-profit arts education organization, that strives to empower children with cancer by inspiring and nourishing their artistic passions is looking for a Post Production proficient in adobe premier, adobe after effects (not required), color correction, audio editing and audio mastering. Video Editing. For questions about the position please let us know, get in contact with us!", "title": "Post Production Volunteer", "zipcode": "11217", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2823411%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are seeking a Volunteer/Intern Graphic Designer who can commit 150 total hours over 3 months. We encourage undergraduate and graduate students seeking a for credit internship or fellowship to apply Responsibilities: Working in Photoshop to create layouts, CADS, and design web graphics, Working in Illustrator to create vector objects, print files, and marketing materials. Working in InDesign to create automatic catalogs and other materials. Working with Excel and outlook to update spreadsheets, schedule meetings, answer emails. Skill requirements: Very well trained in CS6 or earlier, especially Photoshop, Illustrator, and InDesign. Working knowledge of Excel, Outlook, Word, and PowerPoint. Knowledge and use of keyboard shortcuts and how to do tasks the fastest way. Knowledge of HTML programming is a plus, but not required. Position requirements: Detail oriented, organized, and a quick learner Follows instructions and completes projects in a timely matter. Work with minimal supervision, a proactive problem solver. Excellent references, grades, & portfolio (even a student portfolio) are required.", "title": "Volunteer Graphic Designer", "zipcode": "11217", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2046390%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "11231": [{"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. After a very incredible and successful year, we are seeking a highly skilled Marketing Intern who can commit 5-10 hours per week for minimum of 3 months. Position is non-paid but can apply for school internship credit. Responsibilities: Assist with daily project management of digital and traditional marketing, working with Marketing Coordinator on strategy, analytics and logistics Coordinate the working document to track projects cross-departmentally Assist in Managing timelines for e-appeals, campaigns, cultivations and optimizations (such as donor pages, homepage and confirmations); Assist with Managing timelines for vetting of direct mail pieces for six different appeals monthly; Assist with coordinating the Integrated Marketing Calendar of all fundraising and cultivation activities; Liaison with the Programs, Graphic Design/Web, Fundraising and PR departments Draft marketing copy for brochures, posters, presentations and other organizational collateral; Coordinate with the Graphic Design and Web department with copy for creative projects; Performing other responsibilities as may be required. Qualifications: Excellent writing and editing skills with ability to produce polished and compelling copy on tight deadlines Creativity in tapping and cultivating mainstream media and social networking communities A positive, energetic and proactive multi-tasker who can work independently or very collaboratively, as part of a team Ability to work effectively, efficiently, diplomatically and calmly in a high-pressure environment on issues that are often complex and politically sensitive Strong listener, with a high degree of professionalism and flexibility, including the ability to prioritize and effectively manage assignments in a timely fashion", "title": "Marketing Assistant", "zipcode": "11231", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191184%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Assisting the Marketing Coordinator with any Job responsibilities. Contacting potential donors/sponsors to help out the organization. Following organization protocol when it comes to emails/phone calls. Using templates within google drive to contact companies, also sharing folders with volunteers/interns. Researching/assisting with any job related tasks available to the assistant for review. Overall Responsibilities: -Emailing donors/sponsors. -Researching information. -Assisting Coordinator/Director with any job duties. -Ability to create templates/sharing potentially with other volunteers/interns and also outside vendors. -Keeping records of donors/sponsors. -Emailing other people with proper email etiquette. -Must support and maintain mission goal and statement of organization. Competencies: -Has/working towards in degree in Marketing or related field. -Excellent communication skills. -Understanding of Google docs and Microsoft Office.", "title": "Marketing Assistant", "zipcode": "11231", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2105534%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "10011": [{"end": "2020-08-15", "description": "Volunteers needed to help disabled adults with food delivery, shopping, running errands, and reading mail. Must be able to work with totally blind people, and must speak, read and write English. Please call Alice Crespo at (917) 696-8115.", "title": "Be a Friend Day", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3304524%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}], "07201": [{"end": "2020-12-07", "description": "Are you an aspiring marketing student looking to make a difference at a nonprofit organization this Fall? Are you looking to gain professional experience across social media platforms and trying to hone your marketing skills? Do you have an interest in helping children in the foster system? CASA of Union County&rsquo;s Marketing Intern position may be exactly what you are looking for! Every year more than half a million abused and neglected children are in need of safe, permanent, nurturing homes. Too many spend years moving from one temporary home to another. They are more likely than other children to face homelessness, unemployment, even prison as adults. CASA was created to make sure the abuse and neglect these children originally suffered at home doesn't continue as abuse and neglect at the hands of the system. CASA trains advocates who are appointed by judges to be a voice for these children in court. The result is that a child is placed into a safe, loving home where he or she can thrive. Our marketing and development team makes sure that the organization has the resources necessary to do this critical work. CASA of Union County is looking for a college or graduate student to volunteer this Fall to help the marketing and development team continue to make CASA thrive. The student would commit to working approximately 10-15 hours per week from September through early December. Duties may include: creating social media posts assisting in maintaining and updating the organization website drafting articles for the monthly newsletter researching press opportunities submitting press releases assisting at recruitment events (if in-person recruitment is an option due to Covid-19) helping promote, prepare for and assist during such upcoming events as the virtual Gala, and exploring potential grant opportunities. Potential volunteers should have a passion for helping children, understand and have experience with various social media platforms including Facebook, Twitter and Instagram, and have excellent written communication and research skills. Please note: We hope this internship will be on-site in our Elizabeth office. However, if current Covid-19 health and safety concerns preclude that possibility, the position can be fully remote if necessary.", "title": "Marketing Internship at CASA of Union County", "zipcode": "07201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2375395%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "CASA of Union County, Inc."}], "11235": [{"end": "2020-08-13", "description": "Are you a high school student who would like to have a meaningful summer? Do you speak Russian fluently? We want you to join us for DOROT's Summer Teen Internship in Brighton Beach! To learn more about this internship, please click here or contact Peri Smilow at psmilow@dorotusa.org.", "title": "DOROT's Summer Teen Internship in Brighton Beach", "zipcode": "11235", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3271985%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}], "10014": [{"end": "2020-08-29", "description": "The Walks to End Bladder Cancer are BCAN&rsquo;s signature awareness events and take place in numerous cities throughout the United States, principally in May which is Bladder Cancer Awareness Month. Raising awareness about bladder cancer, the sixth most commonly diagnosed cancer in the US saves lives. Our walks also generate critical funds that enable BCAN to offer educational resources and support programs free of charge, advance research, serve more patients and families, and continue as the leading provider of bladder cancer services and information in the country. We need volunteers to help with setup, registration, and maintaining the walk route. Come on out and support a great cause!", "title": "Walk to End Bladder Cancer - NYC", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3095865%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Bladder Cancer Advocacy Network"}], "08807": [{"end": "2020-11-30", "description": "Recruit, mentor and support a group of volunteers and organize adult trainings and activities in your local area for girl and volunteers. Responsible for the Girl Scout program and membership in a given geographic area. Host virtual meetings bi-monthly.", "title": "Share your wisdom with local Girl Scout volunteers!", "zipcode": "08807", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3304081%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Girl Scouts Heart of New Jersey"}, {"end": "2020-10-02", "description": "Help an adult to read, write, and communicate in English. Become a literacy tutor! Training provided. PRE-REGISTRATION is REQUIRED. Literacy Volunteers of Somerset County is looking for volunteers to become Basic Literacy and English as a Second Language (ESL) tutors. Volunteers must complete a 12-hour training course during 4 class sessions. Upon completion of training, tutors will be matched with students. Tutoring is usually held at the local libraries in Somerset County. The schedule for our next Tutor Training class is as follows: Sept. 11, Sept. 18, Sept. 25, Oct. 2, 2020. To learn more about becoming a tutor, please call (908) 725-5430 or email info@literacysomerset.org. You can also attend an information sessions at local library branches in August and September. See the following link for dates and times: http://www.literacysomerset.org/index.php/tutor-information-sessions Training takes place at the PeopleCare Center, 120 Finderne Ave., Bridgewater. There is a $50 charge for training materials. Please visit our website at Literacysomerset.org for details. PRE-REGISTRATION is REQUIRED. To register for training, please visit http://literacysomerset.org/index.php/tutor-online-registration", "title": "Become a Literacy Tutor - Change Someone's Life", "zipcode": "08807", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1039695%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Literacy Volunteers of Somerset County"}], "11797": [{"end": "2020-08-12", "description": "Are you passionate in the fight to save lives and help create a world without cancer? Do you want to be a part of the official kickoff to breast cancer awareness season in Long Island? Event: The Corporate Breakfast is a high-energy, inspirational event where Team Leaders come to celebrate breast cancer survivors, learn about our research achievements, and discover the local programs and services we offer. Last year, the Making Strides Against Breast Cancer Corporate Kickoff Breakfast welcomed 900 guests, including 200 survivors. Breakfast attendees are team leaders from a variety of different industries, including Fortune 500 companies, large corporations, small local businesses, health systems, as well as members of the community. Description: The Making Strides of Long Island is seeking 15 volunteers to support our staff during the kickoff. Duties include but not limited to: *Final decorating details *Check-in of guests *Merchandise sales *Distribution of Team Leader gift *Collection of registration forms *Assistance with online registration (training provided) *Packing up and loading event materials *Photography of event Expectations: *Attire: Business Appropriate (not casual or business casual) *Arrive at venue at 6:15 AM for final instructions *Plan to stay until all materials packed and loaded into transport cars *Typically a modest spread of breakfast items are provided for staff & volunteers on a rotating basis, however please plan accordingly and come with energy to complete the morning For more information about this volunteer opportunity, please email Christine.haskell@cancer.org Please email your name ( First & Last), address, along with your phone number and email address. ------------------------------------------------------------------ The American Cancer Society's Making Strides Against Breast Cancer walks raise awareness and funds to save lives from breast cancer. The Making Strides of Long Island bring together more than 80.000 local participants and have raised more than $2,5 Million annually.", "title": "Corporate Breakfast Volunteer-Making Strides Against Breast Cancer -2020", "zipcode": "11797", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2662416%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "American Cancer Society- Nassau Region"}]}