{"10004": [{"end": "2017-08-18", "description": "Be part of the movement of college students helping high school students get into and graduate from college! As a College Access Coach, you will coach and mentor a small group of high school students by providing FREE SAT preparation and college admissions counseling to students who do not have access to college preparation support. The commitment includes: One evening per week from mid-June through mid-August (times vary from between 5:30-8:30pm) Locations throughout NYC in Manhattan, Brooklyn, Queens, and the Bronx Training session prior to start of program to prepare you to teach SAT material and College Choice curriculum You'll gain: Excellent hands-on education field and non-profit experience Training and professional development that will make your resume stand out Opportunity to impact students on a personal and systemic level! Questions? Contact ominick@letsgetready.org to learn more and apply!", "title": "Calling all college students who are passionate about education & mentorship!", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2549077%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Let's Get Ready"}, {"end": "2017-06-04", "description": "The LoveYourself Project is looking for volunteers to help out with some of our programs. It's an all day event for 2 days from 10am to 5pm. We will be painting, making origami hearts and other fun activities! Contact Michael for more information and come visit Governors Island, volunteer and enjoy FIGMENT. Check out what figment is at http://newyork.figmentproject.org/about", "title": "Figment NYC", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2665195%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Love Yourself Project"}, {"end": "2017-06-05", "description": "Mock Interviews are a great way to prepare our program participants for the rigors of job searching and interviewing.Volunteers will interview between 2-4 program participants and provide them with quality feedbackWe would greatly appreciate if you could come in and perform a mock interview with our Learning and Development students. Date: Monday, June 5th 2017 Time: 8:30 am - 11am Location: Wall Street campus 85 Broad St, 6 thfloor New York, NY 10004", "title": "Mock Interviews", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2525431%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Year Up New York"}, {"end": "2017-07-10", "description": "As our program participants prepare for theirinternship experiences they present a summary ofthe skills that they have gained as well as their strategies for success on their internship. Join us for a day of celebrating past successes, and looking forward to new opportunities.", "title": "Internship Readiness Presentations", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2536285%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Year Up New York"}, {"end": "2018-06-30", "description": "The Board of Engineers (BoE) is a passionate group of volunteers that supports Blue Engine&rsquo;s mission and work through program-related initiatives, and fundraising and awareness-building campaigns. Committed to facilitating in-classroom instruction that taps the infinite potential of all students, board members give of their time, expertise and resources to ensure the sustainability of Blue Engine&rsquo;s team teaching model. Each fiscal year (July 1 st - June 30 th), the board develops and executes a robust calendar of events/campaigns to reach goals established in partnership with Blue Engine staff. The BoE seeks energetic recruits to bring committee activities to life! The board employs three committees to support Blue Engine's work in classrooms: Program Initiatives Committee - plans a series of professional development and networking activites for Blue Engine teaching apprentices. Fundraising Committee - plans fund/friend-raising events to expand Blue Engine's supporter network and build greater brand awareness. Corporate Engagement Committee - develops relationships with potential corporate funders and conceptualizes engagement touch points for current funders. Committee members also work toward an individual fundraising goal of $1,300: the per student cost of Blue Engine's work in classrooms. To join the Board of Engineers, please click the \\\"I want to help\\\" button above or visit www.blueengine.org/boe-application to complete our online application. To learn more about this opportunity and Blue Engine, please email Morolake Odeleye, Blue Engine Development Manager, at morolake@blueengine.org.", "title": "Join the Board of Engineers! Help us unlock student potential.", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2644363%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Blue Engine"}, {"end": "2017-07-13", "description": "Year Up New York is seeking individuals to volunteer their time to tutor for the IT track participants of the professional skills training program at Year Up New York. Providing adequate academic support is essential in our mission of closing the opportunity divide. Read more about Year Up NY at http://www.yearup.org/about-us/our-locations/new-york/ or watch a recent mini-documentary about us at · http://fortune.com/2016/11/02/youth-unemployment-opportunity-divide-skills-gap-threatens-americas-economic-future/ . Key Responsibilities: Provide academic support in areas of IT track training to expand understanding (specific details below) Hold open tutoring sessions each week Provide one on one tutoring for Year Up training program participants Optional participation in participant events including, but not limited to- mock interviews, presentation critique, and resume review. IT Course/Track Description: In this course participants receive a thorough introduction t o software, hardware and networking. Participants learn and practice skills used in preparation for the daily activities required of professionals in a business and or helpdesk environment. These skills include diagnosing, troubleshooting and repairing software, hardware, and network components, installing and maintaining operating systems, applications, and working on deliverables independently and as part of a project team. The outcome of this course is to prepare participants with the business and technical skills necessary for internships and professional helpdesk, and junior network administration positions. Through a focus on the practice of hands on installations, diagnosis and repair, participants learn techniques that produce effective technicians. Qualifications: Candidate will ideally have expertise in the following subject matter: Hard Skills Computer diagnosis Computer repair Computer assembly/disassembly Computer imaging Network Design Network Setup Network Maintenance Time Commitment: Tutoring sessions are usually held for around an hour, on one or more of the following days/times: 11:30am-12:30pm during the scheduled lunch hour on Monday, Tuesday, or Thursday 2:10-3:30pm on Tuesdays during the participants&rsquo; Independent Study Time 3:45-4:45pm on either Monday, Tuesday, or Thursday Training/Support Provided: All volunteer tutors will meet instructors of the track they are tutoring for to discuss curriculum and will have the opportunity to attend training sessions if necessary. They would also meet with the volunteer supervisor to receive an orientation for the tutoring program where all necessary information will be given regarding schedules, information about participants on mandatory tutoring, as well as additional volunteering opportunities. Benefits: Being a volunteer at Year Up provides you with the rewarding experience of making a positive difference in the experience of our program participants. Volunteer Supervisor and Contact Information: Please insert your resume in the message body and include a brief note about why you are interested in volunteering as a tutor at Year Up. This will be reviewed by the volunteer leader within a week of your submission. Carissa Chunasamy cchunasamy@yearup.org (646) 346 - 8534 Academic Support Associate/Volunteer Supervisor", "title": "Help a Young Adult as an IT Tutor!", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2509787%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Year Up New York"}], "10005": [{"end": "2017-05-31", "description": "Want to help out at the American Foundation for Suicide Prevention? Help the Out of the Darkness Overnight Staff compile check-in envelopes for people participating in the final 2017 Out of the Darkness Overnight Walk in Washington D.C. (June 17-18). This is one of our largest Volunteer Nights of the year, so we need all hands on deck to help out at the Overnight Offices for our Volunteer Night on Wednesday, May 31 from 4-8pm. Our offices are located at 120 Wall St., 29th Floor, New York, NY 10005. You will need to bring a photo ID to gain access to the building. If you are interested in joining us, please RVSP for this Volunteer Night by filling out our 2017 Volunteer Night Form (please copy and paste the following link into your web browser to fill out the form: https://goo.gl/forms/2gvwwGYANaFw1zr33). If you are unable to attend this time, but would like to be added to our Volunteer Database, please email us and let us know. The Out of the Darkness Overnight Walk is the flagship fundraising event for AFSP and is responsible for almost 15% of AFSP&rsquo;s annual income. This event takes place in two cities every year, providing the opportunity for our nation to take a stand against suicide and mental illness. Our first Overnight this year was in San Diego (May 20-21). The Overnight in Washington, D.C. is our final Overnight for 2017. To find out more, please visit theovernight.org. The American Foundation for Suicide Prevention (AFSP) is the leading national not-for-profit organization exclusively dedicated to understanding and preventing suicide through research, education and advocacy, and reaching out to people with mental disorders and those impacted by suicide. See www.afsp.org for more details. We look forward to seeing you there. Have any questions? Please email coaches@theovernight.org", "title": "Volunteer for Suicide Prevention", "zipcode": "10005", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2682649%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Overnight Walk"}, {"end": "2017-05-30", "description": "This year NFTE NY Metro will have about 35 student business participating in our regional competition where they will have the chance to win $1500 in seed capital in June! We need volunteers to help these aspiring entrepreneurs improve their Business Plans or App Designs and refine their presentation skills throughout the 5 weeks leading up to the competition on June 8, 2017.", "title": "NY Metro Business Plan Coach", "zipcode": "10005", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2655980%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Network for Teaching Entrepeneurship"}, {"end": "2018-02-08", "description": "Girl Vow, Inc is seeking volunteer women mentors who can conduct various gender-focused workshops or who are interested in mentoring a girl for an academic year. You must live in the NYC area. Please send an updated resume to the email address girlvow@gmail.com.", "title": "Mentor Girls in the Foster Care & Juvenile Justice Systems", "zipcode": "10005", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2091428%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Girl Vow, Inc."}], "10007": [{"end": "2017-06-04", "description": "Millions of people and organizations care deeply about the oceans and will stand together for their protection. These are the voices that will be raised at World Ocean Festival 2017. World Ocean Festival is dedicated to advocating for action on a global scale for the implementation of Sustainable Development Goal 14, which aims to promote conservation and sustainable use of the world's oceans. Visit https://www.worldoceanfest.org/ for more information! We are looking for volunteers to help with the World Ocean Festival in various ways. Saturday June 3: Booth Setup - 12 - 5 p.m. Help unload and carry supplies to the event area for organizations and booths Sunday June 4: 2 Shifts - 7 a.m. - 2 p.m. & 2 - 9 p.m. Need help during the event (June 4) with: Entrance/Greeting Attendees Security/Bouncers Waste Management Booth Help and Organization VIP Section Production Help - Electricity, Wifi, Stage Area", "title": "Volunteers Needed for the World Ocean Festival", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2682822%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Global Brain"}, {"end": "2017-07-31", "description": "This is a great opportunity to introduce healthy eating habits and the joys of cooking to groups of 25 girls grades 9-12. We need highly organized, self-motivated, and outgoing volunteers to help us prepare and deliver Cook Play Live&rsquo;s Buds multi-cultural and interactive curriculum. You will: Work as a team with a Lead Educator to prepare for and implement interactive cooking and healthy eating activities following a provided curriculum Set up food preparation and cooking equipment, supplies, and educational materials Share your knowledge about origins, culinary uses and/or health benefits of ingredients Maintain food safety, including cleaning and sanitation of all cooking equipment used in cooking activities Engage with and direct middle schoolers in various activities including meal preparation Our ideal volunteer has: Basic knife skills and ability to execute basic cooking techniques Experience or training in nutrition or cooking for large groups Dynamic personality and excellent presentation, interpersonal and communications skills Ability to stand and walk for extended periods, and carrying heavy and bulky items Knowledge of or enthusiasm about food and nutrition issues as part of multi-cultural healthy living is a plus! Volunteer sessions are: A) From 9:15 am to 11:45 am July 10, 11, 17, 18, 24, 31 or B) From 11:30 am to 1:30 pm on July 10, 11, 17, 18, 24, 31 Volunteering for all six dates makes the program particularly impactful and beneficial to the youths.", "title": "Get HS Girls Healthier: Volunteer with Cook Play Live's Nutrition and Culinary Program", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2678921%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Cook Play Live"}, {"end": "2017-07-31", "description": "This is a great opportunity to introduce healthy eating habits and the joys of cooking to 20 girls grades 6-8. We need highly organized, self-motivated, and outgoing volunteers to help us prepare and deliver Cook Play Live&rsquo;s Sprouts multi-cultural and interactive curriculum over 6 sessions on July 10, 11, 17, 18, 24, 31 from 1:00pm to 3:30pm. We ask that you be able to commit to multiple sessions, ideally all 6. You will: Work as a team with a Lead Educator to prepare for and implement interactive cooking and healthy eating activities following a provided curriculum Set up food preparation and cooking equipment, supplies, and educational materials Share your knowledge about origins, culinary uses and/or health benefits of ingredients Maintain food safety, including cleaning and sanitation of all cooking equipment used in cooking activities Engage with and direct middle schoolers in various activities including meal preparation Our ideal volunteer has: Basic knife skills and ability to execute basic cooking techniques Experience or training in nutrition or cooking for large groups Dynamic personality and excellent presentation, interpersonal and communications skills Ability to stand and walk for extended periods, and carrying heavy and bulky items Knowledge of or enthusiasm about food and nutrition issues as part of multi-cultural healthy living is a plus!", "title": "Inspire Girls to Eat Better: Volunteer with Cook Play Live's Nutrition and Culinary Program", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2678790%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Cook Play Live"}, {"end": "2017-06-16", "description": "The National September 11 Memorial and Museum welcomes millions of visitors each year from around the world. 9/11 Memorial & Museum volunteers play a critical role in providing visitors with a meaningful experience. Summer Visitor Services volunteers help with operations at the Memorial & Museum during this busy time. They ensure visitors feel welcome by proactively greeting and answering questions. We are seeking Visitor Services volunteers who are friendly, outgoing, courteous, and comfortable with interacting with Memorial & Museum visitors. Duties include: -Welcome and interact with visitors -Inform visitors about the programs and exhibitions available inside the Museum -Assist visitors with directions -Direct visitor queues and pathways Summer Visitor Services volunteers work at least eight hours per week for 2-3 months. It is also requested that volunteers maintain the same shifts each week. The Memorial & Museum is open every day. Volunteer posts require the ability to stand for up to four hours at a time, inside the Museum and occasionally outdoors on the Memorial. You must be 16+ years old and successfully complete our application process. We provide all the training for volunteers to perform their duties effectively. Volunteering is a rewarding experience that enables individuals to develop interpersonal and teamwork skills. Join our exceptional team today. For more information and to apply, please visit: www.911memorial.org/volunteer", "title": "Summer Visitor Services volunteer", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2275908%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "NATIONAL SEPTEMBER 11 MEMORIAL & MUSEUM"}], "10037": [{"end": "2017-08-11", "description": "We are seeking enthusiastic, creative, industrious, responsible, punctual, and best of all, creative people who can generate fun every moment of the summer day camp experience. Depending upon your experience, you will work as Teacher, Head Counselor, or Group Leader in the classroom, in offsite locations, or in the gymnasium/outdoor playground. Must have tons of energy, a willingness to make a fool of yourself for the sake of making someone smile, the ability to give \\\"warm fuzzies\\\" on a daily basis, and a desire to have FUN! If you have experience in any of the following, this camp is for you: visual art, music, dramatic art, wacky science, coding, maker faire, financial literacy, entrepreneurship, community service, activism, literacy, education, chess, juggling, sports, yoga, firethrowing, marching band, drill team, gardening, cooking, learning, sharing love with children.", "title": "Sunny Faces Welcome! Looking For Summer Camp Counselors - NYC", "zipcode": "10037", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2336769%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "STEM Kids NYC"}, {"end": "2017-08-11", "description": "We're looking for CodeSters who have the ability, fluidity, and patience to work with students between the ages of 6-16 with instruction on app development, website development, robotics, or game development. You will be on the cutting edge of teaching computer science concepts, as less than 10% of New York City, as well as US schools have a computer science curriculum. You will utilize the existing creativity that already exists within the spirits of children, as well as their knack for apps and video games, and channel this energy into supporting them in learning wireframing, weibsite, app & game development. If you are into Scratch, Arduino, JAVA, or HTML, this is a PLUS. Come contribute your mastery to increase the interest in STEM in our students one of our Harlem locations!", "title": "Teach Kids How To Code: Join Our Summer STEM Program In Harlem!", "zipcode": "10037", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2336778%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "STEM Kids NYC"}], "10001": [{"end": "2017-08-25", "description": "We are seeking an excellent communicator, writer, and avid social media user as a Marketing and Communications intern to support public relations, marketing, blog and social media for GGP. Social Media and Web Responsibilities: Create content to grow the organization&rsquo;s footprint, including social media and blog posts Research current artisan partners and product, maintain sample closet Expand and maintain GGP&rsquo;s social networking and online presence to promote GGP products, fundraising efforts, and stories of women artisan partners around the world. Create compelling narratives about GGP&rsquo;s partners and work around the world. Research and update country and partner information currently on the website. Craft descriptive and appealing product descriptions for the website. PR and Events Responsibilities: Connect with influential media outlets and journalists to place stories about company news, relevant holidays, and collections Outreach to potential media partners with pitches, press releases and curated line sheets Actively pursue permanent links on like-minded sites, and assist with implementing social media strategy. Organize events designed to engage our target market. Develop and enact a strategy for digital communications with consumers and other key stakeholders to include artisan stories, product information, and resources. Personal Requirements: Excellent research, communication and writing skills Proficient in Microsoft Excel and PowerPoint Experience with social media, blogging and creating public relations campaigns Interest in and knowledge of fair trade and ethical business Able to commit to 2-3 days per week Specific Qualifications (a plus but not necessary): Experience in creating and implementing public relations campaigns, including familiarity with print and online media Proficiency with Photoshop, Shopify, SEO, Adwords Familiarity with e-mail marketing applications like vertical response Interest in fashion, design, or craft production Hours: 18-25 hours/week", "title": "Marketing and Communications Intern", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2684840%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Goods Partners"}, {"end": "2018-12-31", "description": "Non-Profit Management/Video Internship for Award-Winning Non-Profit Theater and Educational institution in NYC! This is an intensive Leadership Training Program in non-profit business management. Interns receive hands-on training as a management assistant. Students and professionals skilled in video will assist in videography, video production and editing at our award-winning theater arts and community service organization. We seek intern candidates who are leaders, passionate about making an impact in the community, and possess skills in video production and editing. Are you a professional, detail-oriented person who is positive and curious, with a desire to learn and engage in a process? If yes, then this opportunity is a great fit for you! Interns' will work under the direction of a project manager on a combination of logging, editing, and production of on-going video projects that depend on the intern's skill level. We seek applicants with training and experience logging footage, editing in Adobe Premiere, http streaming, digital shooting, lighting, sound, videography, web design and development. Interns consistently report they gain tremendously from filming and reviewing footage of ATW classes and workshops and have benefited as if they had actually taken creative classes themselves. The Actors Theatre Workshop is an award-winning non-profit theater, educational institution and community center in NYC founded by award-winning actor, director, writer and producer, Thurman E. Scott, an acclaimed master teacher of acting and creative process with over 30 years of professional experience. Stella Adler declared, \\\"Thurman E. Scott is the inheritor of the Stanislavsky legacy and of my legacy. His work advances acting technique for the next generation.\\\" Internships are available for 4 to 18 months in duration and are 20 - 40 hrs per week. This is a non-paid internship program. Application instructions: Go to http://www.actorstheatreworkshop.com/get-involved/internship-program/ to fill out an online application for this position!", "title": "Video Internship for Non-Profit NYC Theater/Education Center!", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2695382%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Actors Theatre Workshop"}, {"end": "2017-08-31", "description": "Thank you for your interest in Maya's Hope! Our mission is to improve the lives of orphaned, special needs, and disenfranchised children on a global scale. We our looking for an extraordinary event planner to join our Volunteer Team. We meet monthly to plan special events like Happy Hours or exclusive events in order to grow our NYC base as well as raise money for our cutie pies in need. If you have or want to gain more experience in event planning, project management, and fund raising, this is the perfect opportunity for you. Please send an email to maya@mayashope.org for more information. Include your resume, phone number, and a good time for a phone coversation about this opportunity. Thanks again! Maya's Hope Volunteer Team", "title": "Event Planner needed for upscale fun events for charity!", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2117071%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Maya's Hope"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2640850%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2640845%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-06-15", "description": "We are looking for amazing and exceptional individuals to join our host committee for the Maya's Hope Lotus Ball on Friday, October 27, 2017 at 583 Park Avenue! Maya's Hope improves the quality of life of disadvantaged, orphaned and extremely impoverished children around the world. This will be the 6th Annual Gala for Maya's Hope and you can help us reach our goal of $300,000! We are looking for individuals from a wide array of backgrounds: law, medicine, entrepreneurs, real estate, finance and those who want to make a difference! Here's what is required: -Purchase your ticket upon joining ($350.00) - Attend and actively participate in a majority of Committee Meetings In person participation is assumed although a conference call option will be available for those with special circumstances or last minute scheduling issues. - Commit to raising a minimum of $3,500 for the Gala through sponsorships, ticket sales, and auction items with the goal of securing at least one sponsor, one live auction item (Auction item needs include exotic vacation destinations, airfare, unique experiences such as celebrity chef-hosted house parties, rounds of golf with local celebrities, exclusive tickets to sporting or arts event, etc.) - Solicit sponsorships from at least five companies - Solicit in-kind donations such as graphic design and photography services, discounted printing, - Hand address and personalize invitations to at least 15 individuals from your personal network for the Gala. -Be Ambassadors of Maya's Hope -Have integrity and show respect to all volunteers, members of the committee, board and humankind :) If you meet this criteria, please email maya@mayashope.org and you will meet with our gala chairs. If selected, you will be part of an extraordinary event which directly impacts the lives of the children we serve. Here is a video from our gala last year: https://www.youtube.com/watch? v=O_L5YKKcmn0 Here are photos from last year's Gala: https://www.facebook.com/pg/MayasHope/photos/?tab=album&album_id=1365612953457518 We understand that not everyone has the time and resources to meet these expectations, but still have a desire to help. To this end, there are other volunteer opportunities available for those individuals who are unable to commit to the full list of tasks outlined above.", "title": "Host to Join Host Committee for Maya's Hope Lotus Ball", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2633814%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Maya's Hope"}, {"end": "2017-05-31", "description": "Global Goods Partners (GGP) is seeking expert guidance on developing a system for packaging materials for retail products. We want to create a comprehensive set of shipping boxes, product tags, and gift packaging options for multiple product categories, which will reflect our mission and elevate our brand image. The design process itself will follow this preliminary stage of the project. Packaging elements will include: Hangtags specific to each artisan group with which we partner Fabric pouches for jewelry, accessory cases and bags Standardized packaging protocol for other product categories: jewelry, accessories, homewares and kids. Gift cards for personalized messaging Package insert - postcard or other piece that communicates GGP&rsquo;s work and mission Global Goods Partners (GGP) is a not-for-profit social enterprise dedicated to alleviating poverty and promoting social justice by strengthening women-led development initiatives for marginalized communities in the Global South. Founded in 2005, GGP creates economic opportunity for women in some of the world&rsquo;s poorest communities by providing access to the US market for the fair trade, handmade products they produce. Working in partnership with women-led producer groups with strong social missions, GGP provides technical assistance, product development, operational expertise and small capacity building grants to our community based partners. With this support, GGP is empowering women to create sustainable change-advancing the health and wellbeing of their families and communities.", "title": "Product Packaging Professional", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2623822%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Goods Partners"}, {"end": "2017-05-31", "description": "Institute for Immigrant Concerns, a not-for-profit ESOL school for adult immigrants and refugees, started in 1997, is looking for ESOL instructors. Must have previous English teaching experience (whether domestic or abroad), certificate not essential but a plus. Our students are all motivated and studious adults. Our program is more intellectual than the usual as well, leaving more room form teachers to be creative and introduce own ideas into the curriculum. We have a substancial emphasis on cross-cultural awareness. This is the ideal position for retired teachers or teachers completing a certificate program.", "title": "ESOL Teachers for Adult Immigrants", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2003398%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-05-31", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in French. Experience with immigrants a plus. Duties will include: Intake amd registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organised lists of pertinent student information.", "title": "French Speaking Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1982724%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-05-31", "description": "ESOL School for immigrants and refugees, educating since 1997. is looking for a dynamic and efficient marketing assistant. This is the ideal position for professionals and students wanting to jumpstart their career in marketing. Duties will include: ? Assist with all marketing communications to the student network as required. ? Assist in developing, implementing and monitoring of a social network program. ? Assist in coordinating of the annual, regional, zone and marketing meetings. This includes bookings, invitations, and other duties as required. ? Assist in communicating campaign parameters and details to students ? Assist with the design of monthly flyers, business cards, yellow page ads, and miscellaneous design projects as required. ? Other duties as assigned This is a great opportunity for new graduates who want to get some experience in the non-profit management sector. Lots of leeway for new ideas and out of the box thinking!", "title": "Marketing Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1936547%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-05-31", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in Spanish. Experience with immigrants a plus. Duties will include: Intake and registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organized lists of pertinent student information. Requirements for the position include: Bilingual in Spanish Familiarity with Microsoft Office Suite (Word, Excel etc.) Attention to detail This is a great opportunity for new graduates who want to get some experience in the non-profit management sector. Lots of leeway for new ideas and out of the box thinking! Could develop into paid position for the right person. Start time is ASAP.", "title": "Spanish Speaking, Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1924612%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-05-31", "description": "ABOUT THE INSTITUTE Launched in 1997, the mission of the Institute for Immigrant Concerns is to equip a citywide population of adult immigrants and refugees of all nationalities with ESOL skills, computer training, job readiness, and referrals for social services thus empowering them to succeed in their quest for social and economic independence. Since its inception the Institute has provided services to 8,000 immigrants, refugees and asylees from 112 countries. Institute students have included an economist from Guinea, a hotel housekeeper from Columbia, a yak herder from Tibet, a butcher from Peru, a sailor from Burma, and a Togolese journalist. The common ground for our students is their incredible motivation and the support they give to each other as they struggle to become self-sufficient. INTERNSHIP SUMMARY The Institute is seeking a well-organized, motivated college/graduate student or recent graduate who is eager to gain hands-on grant writing experience at a busy Manhattan non-profit. Intern will work directly with the Institute Director to draft and edit grant proposals, develop proposals for fundraising campaigns, research potential donors and sponsors, and assist with the development and implementation of special events. QUALIFICATIONS Current college/graduate student or recent graduate Strong writing and research skills Highly organized with attention to detail Excellent interpersonal communication skills as well as ability to work independently Proficient in MS Office Knowledge of foreign language(s) a plus Note: This internship is unpaid; school credit may be available depending on your institution. Interns are expected to work 15 hours a week. Position open until filled.", "title": "Fundraising and Development Intern", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1789209%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-05-31", "description": "Institute for Immigrant Concerns, a not-for-profit ESOL school for adult immigrants and refugees, started in 1997, is looking for ESOL instructors. Must have previous English teaching experience (whether domestic or abroad), certificate strongly preferred. Our students are all motivated and studious adults. Our program is more intellectual than the usual as well, leaving more room for the teachers to introduce their own ideas into the curriculum. The education director welcomes his teachers' opinions. We have a substantial emphasis on cross cultural awareness. This is the ideal position for retired teachers or students wanting to jumpstart their career in ESL teaching (we've had a fair bit of both in the past!). Many of our students came to this country to escape persecution or harm in their original country and are trying to get a foothold in the US through our jobs program. They want to become citizens. We are looking for ESL instructors who can teach Tuesdays and Thursdays from 6.00pm - 8.00pm. Please send a resume and cover letter to Donna Kelsh at dkelsh77@gmail.com and Mark Brik at mbrik13@gmail.com", "title": "Assist ESOL Teachers", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1720286%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-05-31", "description": "About the Institute The Institute for Immigrant Concerns (http://http://instituteforimmigrantconcerns.com/) is committed to equipping immigrant communities city-wide with English skills, computer training, job readiness, and referalls for social services. The Institute empowers immigrant families and communities in their quest for social and economic independence. To reach immigrants the Institute operates across New York City and frequently collaborates with other community groups. Our staff is as diverse as our clients and draws on talented individuals to create a powerful, sustainable impact in America's newest immigrants. Job Description The Bilingual Administrative Assistant is essential to maintaing an efficient office environment in support of Institute programs, staff, and volunteers. This position will be responsible for general office administration, organizing office resources, coordination of program activities, and program management support. This is an ideal position for those seeking administrative experience at a busy Manhattan non-profit. Though this internship is primarily administrative, it presents an opportunity to get an introduction to non-profit management. Requirements: Commitment to work 3 months minimum Bilingual oral and written skills, preferably Spanish but other languages welcome Excellent written and oral communication Knowledge of foreign language Proficiency in MS Office and Excel Ability to work independently and alongside a team of staff and volunteers with a passion for immigrant empowerment Ability to work in a multi-cultural environment This internship is unpaid, but college credit may be available.", "title": "Bilingual Adminsitrative Assistant(Russian)", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1854257%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2018-01-31", "description": "Make a Difference for Women and Girls! Intern or Volunteer with ChangingThePresent.org About ChangingThePresent.org The NY Times called ChangingThePresent.org \\\"an amazon.com of the nonprofit world.\\\" Our business-like approach channels funding to nonprofits so they can better fulfill their missions. We help them capture some of the $450 billion that Americans, alone, spend each year on birthday, wedding, and holiday presents. We do so by making the experience of donating in a friend&rsquo;s name feel like a rewarding alternative to buying and giving more \\\"stuff.\\\" Visitors can choose from among thousands of tangible gift opportunities (preserve an acre of the rainforest, fund an hour of cancer research, etc.) from hundreds of leading nonprofits, send personalized printed greeting cards, and share wish lists & registries. What You Will Gain from the Experience At ChangingThePresent.org, you will: Make a big impact in the world. You will help channel to nonprofits addressing your favorite causes some of the $450 billion Americans spend each year on presents. That will enable them to do their important work. Use your skills, experience, knowledge, creativity and talent. Assume responsibility and take a leadership role. Learn a tremendous amount. Have a great time working with wonderful people from around the world in a friendly and supportive environment. Enhance your resume with a record of achievement and community service. Earn a great recommendation letter to help advance your studies and career. Focus on Your Field of Study or Your Favorite Cause You can focus on your professional field of studies, including Human Resources (HR), graphics, marketing, social media, communications, finance, business, tech (computer science, information technology, etc.), supply chain management, or accounting. You can also focus on your favorite cause, including any of those listed below. Focus on Your Favorite Causes We address all causes, as well as ethnic, religious, city, and country categories. You can focus on your favorites. Here are some of them: African-American, Aging, Agriculture, Animals, Arts and Culture, Blindness & Vision, Books for Kids , Bullying, Cancer, Catholic, Children, China, Christian, Civil Society, Community Health, Computer Literacy, Conserve Sea And Marine Resources, Deafness, Diabetes, Disabilities, Disaster Relief, Domestic Abuse, Education (Art), Education (Early Childhood), Education (Higher), Education (K-12), Education (Music), Education (Special), Education (STEM), Education (Vocational), Environment, Financial Literacy, Gender Equality, Global Health, Global Warming, Health, Hispanic, HIV and AIDS, Housing, Human Rights, Human Trafficking and Slavery, Hunger, Inclusive Cities, Inclusive Societies, India, Jewish, Latino, LGBTQ, Legal Services, Mental Health, Microcredit, Multiple Sclerosis, Native Americans, New York, Peace, Poverty, Protect Environment And Biodiversity, Public Broadcast, Reduce Inequality, Refugees, Sexual Abuse, Stem Education, Strengthen Global Partnerships, Suicide Prevention, Sustainable Consumption And Production, Sustainable Development Goals, Sustainable Economy, Sustainable Energy, Sustainable Industrialization, Technology, Urgent Action On Climate Change, Veterans, Water, Women And Girls, Youth Sports, etc Our Impact Imagine the impact we can make together as more and more people show their love by sharing the experience of changing the world for the better. The Environment This is a great place to work. We have interns and volunteers from all over the United States and all around the world. The atmosphere is energetic, creative, and fun. We value brainstorming, initiative, sharing, and collaborating. Think of it is a laboratory, studio, seminar, or incubator. We are also casual. We are interested in your brains, creativity and heart, rather than your attire. Want to work in jeans, t-shirt and flip-flops? That&rsquo;s fine with us. Who, Where, When We are glad to hear from great high school, undergraduate, and graduate students, as well as professionals who want to make the greatest impact with their skills. Work at our office or remotely. We are conveniently located at 7th Avenue and 33 Street, across from Penn Station in Manhattan. Full-time or part-time, school-year or summer, day or evening, weekday or weekend. We are glad to have your help whenever and wherever you are available. Unpaid We provide a great experience, but this is an unpaid position. Learn More and Apply Now Are you ready for a great experience and eager to make a difference? Please see the slideshow at www.ChangingThePresent-Join.org. Then send a resume and short cover letter (which should say if you will be here or remote, and when you would want to join us) to: join [AT] ChangingThePresent [DOT] org.", "title": "Intern/Volunteer For Women's Rights", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2584975%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Changing The Present"}, {"end": "2018-01-04", "description": "Great Internships for International Students, Graduates, and Professionals ChangingThePresent has had fantastic interns and volunteers from more than 50 countries. We welcome: international students who are attending American universities Chinese and other international graduates looking for a great OPT opportunity in their field international students who come from abroad just to work with us international professionals whose visas may not allow them to get paying jobs but want to use their skills and make a difference. trailing spouses of international professionals and of students on F-2 dependent visas You can Join us for a month, a semester, or longer. You can focus on your professional specialty or your favorite cause. Work Here or Remotely You can work in our Manhattan office (very conveniently located at 7th Avenue and 33 Street) or remotely. What We Do More and more people, tired of buying and receiving yet more stuff, are showing their love in a more meaningful way. They honor births, birthdays, weddings, anniversaries, and graduations with donations made in a friend&rsquo;s name. Until now, it has been too difficult for nonprofits to offer the requisite gift-like experience (tangible charitable opportunities, wish lists & registries, and personalized printed greeting cards). Now, ChangingThePresent.org makes it easy. In fact, the New York Times called us \\\"an amazon.com of the nonprofit world.\\\" What You Will Gain from the Experience Join us for your alternative break. You will: Make a big impact in the world. You will help channel to nonprofits addressing your favorite causes some of the $450 billion Americans spend each year on presents. That will enable them to do their important work. Use your skills, experience, knowledge, creativity and talent. Assume responsibility and take a leadership role. Learn a tremendous amount. Work with great people from around the world and have a great time. Enhance your resume with a record of achievement and community service. Focus on Your Field of Study or Your Favorite Cause You can focus on your professional field of studies, including Human Resources (HR), graphics, marketing, social media, communications, finance, business, tech (computer science, information technology, etc.), supply chain management, or accounting. You can also focus on your favorite cause, including any of those listed below. Our Causes We address all causes, as well as ethnic, religious, city, and country categories. You can focus on your favorites. Here are some of them: African-American, Aging, Agriculture, Animal Welfare, Arts & Culture, Blindness & Vision, Bullying, Cancer, Catholic, Children and Youth, China, Christian, Civil Society, Community Health, Computer Literacy, Conserve Sea And Marine Resources, Deafness, Diabetes, Disabilities, Disaster Relief, Domestic Abuse, Education (Art), Education (Early Childhood), Education (Higher), Education (K-12), Education (Music), Education (Special), Education (STEM), Education (Vocational), Environment, Environment: Global Warming, Gender Equality, Global Health, Health, Hispanic, HIV/AIDS, Housing, Human Rights, Hunger, Inclusive Cities, Inclusive Societies, India, Jewish, LGBTQ, Legal Services, Microcredit, Multiple Sclerosis, Native Americans, New York, Peace, Poverty, Protect Environment And Biodiversity, Public Broadcast, Reduce Inequality, Refugees, Sexual Abuse, Stem Education, Strengthen Global Partnerships, Suicide Prevention, Sustainable Consumption And Production, Sustainable Development Goals, Sustainable Economy, Sustainable Energy, Sustainable Industrialization, Technology, Urgent Action On Climate Change, Veterans, Water, Women And Girls, Youth Sports, etc. Our Impact Imagine the impact we can make together as more and more people show their love by sharing the experience of changing the world for the better. Learn More Please see the illustrated presentation on the home page of this site. click me now Please Share This Opportunity You can help other students and graduates when you share this opportunity. Use the social media buttons on the left side of our web page, or share the following via email, WeChat, Weibo, FB, Twitter, etc. We also have banners you can share here. This NYC nonprofit has a great internship program for international students and for graduates seeking an OPT opportunity. Take a look: http://www.ChangingThePresent-join.org/international.html 我们是一家位于纽约的非营利组织，可以为国际学生提供丰富的实习项目，并且为毕业生提供OPT工作机会。详情请查看链接： http://www.ChangingThePresent-join.org/international.html How to Apply If you are reading this in an email or a recruiting site, please read more at http://www.changingthepresent-join.org/international.html To apply, please send a cover note about your interest and availability, as well as your resume (or a link to your Linkedin page) to: Join [AT] ChangingThePresent [DOT] org", "title": "Intern, Volunteer, and OPT Opportunities for International Students", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2504044%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Changing The Present"}], "10002": [{"end": "2017-09-01", "description": "We are seeking a highly motivated, focused, outgoing individual to coordinate our fundraising efforts. The Fundraising Coordinator will be integral in sustaining this growth, making a significant contribution to the organization and the youth we serve. As the coordinator of fundraising events you will play an integral role in ensuring Global Potential's short and long-term fundraising goals. This is an opportunity for a motivated self-starter interested in helping to implement our fundraising strategy over the course of the next year. You will be spearheading fundraising efforts and delegating tasks to other staff while receiving support and guidance from the Director of Operations. Responsibilities include: Facilitating fundraising campaigns including donor appeals Assisting in the production of fundraising and promotional materials Managing organization&rsquo;s member and donor database Opportunities include: Providing creative fundraising ideas Attending events in the community to engage new members and donors Becoming familiar with the inner workings of a non-profit organization This is an unpaid internship. Qualifications (Who we are looking for): Self-motivated, detail-oriented, enthusiastic personality Ability to work independently and creatively, as well as part of a team Solid writing, communication, organizational and time management skills Strong computer skills (PC or MAC): Microsoft Office, Internet Knowledge of Salesforce a plus Spanish Language a plus Education: College or Master level Other work requirements: Passionate about underserved youth and commitment to GP mission, interest in working with nonprofits or in international development.", "title": "Fundraising Coordinator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2685805%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}, {"end": "2017-11-15", "description": "Global Potential (GP) is a non-profit organization founded in 2007. GP provides urban youth from low-income communities with an eighteen-month leadership program, giving them the skills and perspective to effect positive change in their lives and communities. Youth engage in leadership training, social entrepreneurship, international cultural exchange and service learning. GP's vision is that as youth develop, communities develop. Global Potential is currently seeking an individual for an Accounting Associate position. This position will primarily process, track and report financial transactions and will interact, in various degrees, with the CFO, CEO, Finance Committee and Program staff. Tasks and Responsibilities Prepare monthly and/or quarterly financial statement package for management and/or Board review. Research and explain budget-to-actual variances. Assist in the preparation of annual budget and quarterly re-forecasts. Includes maintenance of budget model, interaction with CFO, Program staff and/or Board members. Assist in the preparation and filing of GP financial and other information on various not-for-profit and regulatory websites (e.g., Charity Navigator, NY Charities Bureau). Assist in the preparation and submission of various grant applications/reimbursement requests (e.g., NY City Council, US Department of State). Assist in preparation of information required for annual audit and tax filings. Review all accounting transactions for adherence to organization&rsquo;s accounting procedures and policies manual; work with staff to assure compliance. Work with staff to facilitate proper capture, recording, and reconciliation of summer program cash advances and expense reporting. Process and record all cash receipt and cash disbursement transactions in QuickBooks Online (QBO). Includes preparation of computer and manual checks, wire transfers and bank deposits. Monitor and record donation transactions from various funding platforms (e.g., Network for Good, Razoo, AmazonSmiles). Assist in processing payroll transactions and federal, state and/or local payroll tax filings by due dates. Monitor, record and reconcile petty cash transactions. Prepare monthly bank account reconciliations. Prepare QBO to Salesforce revenue reconciliations. Assist in maintenance and update of the chart of accounts, chart of departments and accounting policies and procedures manual. Skills and Knowledge Self-motivated, detail-oriented, highly organized, enthusiastic personality. Ability to work both independently and as part of a team. Strong communication, organizational and time-management skills. Strong computer skills (Mac or PC). Intermediate-level understanding of accounting (i.e., more than a single, basic-level accounting course). Knowledge of non-profit accounting a plus. Working familiarity with general ledger applications. Knowledge of QBO a plus. Strong working knowledge of Microsoft Excel and Word (knowledge of PowerPoint a plus). Knowledge of Google applications (Gmail, Calendar, Docs, Drive) a plus Knowledge of Salesforce a plus. Education: Degree in Accounting or other financial / business discipline or current degree-seeking (major or minor) accounting student. Commitment 8-15 hours weekly for at least 6 months.", "title": "Accounting Associate", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2676592%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}, {"end": "2017-06-20", "description": "We&rsquo;re looking for 5 volunteers to set up the event space, serve food and drinks, clean up after the event and engage with our residents, providing them with warm hospitality and a good time. Located on the corner of Pitt and Houston Streets on the Lower East Side, this 12-story building is both a design standout and a seamless addition to a dynamic neighborhood. The Lee is home to a mix of homeless adults with special needs (HIV/AIDS, chronic mental illness), low-income workers, many of whom are from the community, and 55 young adults who were at high risk of homelessness at the time they aged out of the foster care system. Many tenants make use of extensive bike storage in the courtyard, riding to the store, to the subway, or in neighboring Hamilton Fish Park, and blending in with the long-time locals, immigrant newcomers and trendy hipsters who make the neighborhood what it is today.", "title": "Summer BBQ at the Lee", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2684044%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Breaking Ground"}, {"end": "2017-06-21", "description": "Join us as volunteer for the Steve Nash Foundation's 2017 Showdown! We are looking for energetic, friendly, and committed volunteers for our event on June 21, 2017. Event: Steve Nash Foundation Showdown Date: June 21, 2017 Location: Sara D. Roosevelt Park (Lower East Side, NYC) Hours: We can accommodate volunteers for 4-8 hour shifts between 7am and 10pm. We will also require attendance at an in-person volunteer team meeting on Monday, June 19. What you will be doing: We have a variety of tasks and roles that we need help with and will make sure to place you at the best location for your skills and ability. Tasks could include: set-up, break-down, check-in, field-side support, Scoreboard support, helping our sponsors set up, etc. I'M IN! What are the next steps?! If you are interested in participating in the Showdown as a volunteer, please click the link below to complete your application form. Our team will be in touch with you about this volunteer opportunity to schedule a follow up call. APPLY HERE: https://goo.gl/forms/3mJkPieozveMRDi03", "title": "Steve Nash Foundation 2017 Showdown!", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2609605%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "STEVE NASH FOUNDATION"}, {"end": "2017-06-21", "description": "Join us as volunteer for the Steve Nash Foundation's 2017 Showdown! We are looking for energetic, friendly, and committed volunteers for our event on June 21, 2017. Event: Steve Nash Foundation Showdown Date: June 21, 2017 Location: Sara D. Roosevelt Park (Lower East Side, NYC) Hours: We can accommodate volunteers for 4-8 hour shifts between 7am and 10pm. We will also require attendance at an in-person volunteer team meeting on Monday, June 19. What you will be doing: We have a variety of tasks and roles that we need help with and will make sure to place you at the best location for your skills and ability. Tasks could include: set-up, break-down, check-in, field-side support, Scoreboard support, helping our sponsors set up, etc. I'M IN! What are the next steps?! If you are interested in participating in the Showdown as a volunteer, please click the link below to complete your application form. Our team will be in touch with you about this volunteer opportunity to schedule a follow up call. APPLY HERE: https://goo.gl/forms/4RiJgbw6SjfxWeVu2 Requirements: Volunteers must complete a basic orientation session as scheduled before reporting to their assignment. Volunteers must agree to represent the Steve Nash Foundation, perform in a professional manner whenever doing so, and not to allow personal views and opinions from clouding (overshadowing) or conflicting with the Steve Nash Foundation&rsquo;s purpose.", "title": "Steve Nash Foundation's 2017 Showdown!", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2553207%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "STEVE NASH FOUNDATION"}, {"end": "2017-08-31", "description": "Global Potential (GP) transforms youth from underserved communities through education, service learning and cultural exchange into globally competitive leaders of positive change in their lives and communities. GP is an 18-month transformative out-of-school time and summer program based in New York City. The GP program includes 14.5 months of workshops locally and 1.5 months of international service learning and cultural exchange in the Dominican Republic, Haiti, and Nicaragua. Global Potential seeks energetic facilitators to help us conduct preparatory workshops and evaluations with youth and community members Facilitate participatory dialogue between GP partner communities, GP youth councils, local leaders (international), partner high schools (local), NGOs (IDDI, CEDESO, Peace Corps, World Vision, Municipal Government), GP youth, and the GP staff team to ensure empowerment of the community and equal and respectful power dynamic Attend staff meetings, conferences, external meetings, professional development trainings, conference calls, webinars, and networking events as appropriate Provide and receive feedback to/from supervisors locally and internationally, report back to supervisors on a weekly basis on all tasks Job type: Volunteer Job location: Nicaragua, the Dominican Republic, Haiti Volunteer Fees: All expenses covered by Global Potential (including flight and accomodations & meals) Job length: 4 Months Start date - End date: May 1-August 31, 2017 Commitment hours: 10-15 hours per week in May and June; full time+ from July 1st to August 18th (approximate dates) with 2 days/1 night off (contingent upon coordination with your team and community); 10-15 hours per week after trip to deliver all paperwork. Position reports to: Chief Program Officer or International Program Director and Field Staff Director Specific responsibilities: Guide workshops, youth development, evaluation, and needs and impact assessments Work closely with GP youth participants to provide support for youths&rsquo; personal development through weekly individual and group advisory/evaluation meetings Work together as team members and role models with GP youth participants and GP&rsquo;s Youth Councils on infrastructure and social development projects in GP partner communities Work closely with GP Youth Councils in administering evaluation and needs and impact assessments, organizing community service events, workshops, and conducting site visits Collaborate in the planning and implementation of the GP Youth Leadership Conference Other Work Requirements: Adhere to GP&rsquo;s rules and procedures, including time and duty commitments; commitment to learning new technologies and social media platforms; and maintenance of GP&rsquo;s cloud-based office spaces. Be open-minded, adaptable, flexible, culturally sensitive, professional, respectful, tolerant, and work to build solidarity with the communities we serve. Ensure a SAFE and EDUCATIONAL experience for staff, youth, and community members. Be an integral part of the team and the daily life of the youth participants. Skills and Knowledge Requirements: Creation and management of groups, teaching and/or facilitating group discussions. Experience working with youth and communities that are historically marginalized. Ability to be both a leader and a compatriot, an inspiration and a guide to youth participants. Experience living in challenging conditions and rural areas internationally. Adept interpersonal skills; strength in developing and maintaining relationships with youth, families, community members, GP staff, and partnering agencies. Self-motivated and capable of working independently as well as with a team. Bi-lingual (Spanish or Haitian Creole) speakers with experience working and living in developing countries are especially encouraged to apply. We are especially interested in individuals who would like to remain involved after the summer. Education/Field: Graduate degree or in process preferred. College degree required (unless significant equivalent experience can be demonstrated) Appropriate fields include: Social Work, Education, International Development, Counseling Psychology, Anthropology, Media, Arts, Social Entrepreneurship, Political Science, Health/Fitness/Outdoors. Certification in First Aid/CPR preferred What we can offer you: An opportunity to be exposed to the workings of a nonprofit grassroots enterprise with a vast network of innovative professionals. Exposure and access to the NGO and international development community. Training in an organization that is fast-paced, innovative, collaborative and creative. Impact: Youth and Volunteers who participate in GP demonstrate increased: Skills in advocacy, activism, fundraising, and social entrepreneurship. Self-esteem, confidence, and sense of purpose. Belief that challenges lead to opportunities. Academic completion rates. Unprecedented professional experience in youth and international development. Interested candidates should immediately send cover letter and resume to hr@global-potential.org. Indicate \\\"International Youth Development Facilitator\\\" in the subject line.", "title": "Summer Abroad: Youth Development Facilitator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2665011%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}, {"end": "2017-08-31", "description": "Reading Empowers was formed with the mission of improving literacy among young children. Our goal is to instill an interest in reading, at a young age, and our hope is that this will develop into a lifelong love and passion. This upcoming school semester (Spring 2017), we will be hosting Saturday morning reading sessions at P.S. 1 and P.S. 124 in Lower Manhattan. We are looking for volunteers to join us on our mission! We will be reading to students in 1st, 2nd, and 3rd Grade. P.S. 1 and P.S. 124 are both located in Chinatown at 8 Henry Street and 40 Division Street, repsectively, in LES Manhattan. Below are the dates for the Spring 2017 semester. February 11 March 4 March 18 April 1 April 22 April 29 Each session is about two hours, during which volunteers and students are broken up into groups, with each group consisting of 2-3 volunteers and 6-8 students. The two hour sessions consist of reading, writing, and an arts and crafts activity with the students. Reading Empowers is a non-profit organization in the state of New York and recognized as a tax-exempt 501(c)(3) organization by the IRS. Please feel free to visit our website http://www.readingempowers.org/ Requirements Volunteers must be 18 or older New volunteers must pass the background check with our vendor, Go Pass. There is a $60 background check fee that will be reimbursed to you after you volunteer with us for 60% of all the sessions in one full school year ~ 8-9 sessions We are looking for consistent commitment for this school year, which is roughly two Saturdays per month To get involved please fill out our online application at: www.readingempowers.org/application", "title": "Read to 1st, 2nd or 3rd Graders in a public school in Lower Manhattan!", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1596852%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Empowers"}], "10003": [{"end": "2017-06-04", "description": "Calling all science enthusiasts! The World Science Festival is back! The annual live, week-long New York Festival, which launched in 2008, has collectively drawn more than a million and a half visitors, with millions more viewing the programs online. Volunteers are the heart and soul of the World Science Festival, serving as our ambassadors to the public and participants alike. They are a welcoming face to visitors, chock-full of information about the Festival and its programs. Volunteers also support the many production teams that make so many compelling programs and experiences possible. Qualifications: · Feel comfortable working with people of all backgrounds, ages, and levels of familiarity with science. · Possess excellent communication skills. · Have a background in science, or a passion for learning and sharing knowledge. · Be dedicated, committed, reliable, flexible and professional. · Be at least 16 years old. The 2017 World Science Festival runs from May 30 - June 4, 2017. You can volunteer for one day or for all of them! We also need volunteer help for the two weeks leading up to the Festival. What&rsquo;s Involved? · A quick & easy application process · A mandatory volunteer orientation on May 23, 2017 · A post-event wrap party To apply, visit our website at worldsciencefestival.com.", "title": "World Science Festival 2017 // Call for Volunteers", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2688534%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "World Science Festival"}, {"end": "2017-06-12", "description": "Join members of our Junior Board and the young men of the Kaplan House for a night of sports and games.", "title": "Young Professionals: Recreational Night at Kaplan House (Manhattan)", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2626530%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jewish Board of Family and Children's Services"}, {"end": "2017-08-04", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. GO Getter Summer Internship: How YOU Can Help The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important (Maximum 750 words). ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2595065%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2670983%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2670977%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2670973%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2670965%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2656354%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2656346%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2640869%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2640861%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2640838%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2640827%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2628279%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism.", "title": "GO Getter High School Summer Internship", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2595788%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-01", "description": "Mount Sinai Beth Israel, located in Manhattan&rsquo;s Lower East Side- Gramercy Park- neighborhood, seeks volunteers with an interest in counseling, public health, social work, or pastoral care. In order to ensure that we provide high quality care, Mount Sinai Beth Israel has created a Chi Cart program for staff. Volunteers visit clinical and administrative floors in the hospital and provide a space for our employees to spiritually and physically recharge. Volunteers will be given resources to serve tea, snacks, and aromatherapy as a way to help staff take a break. Volunteers will have the opportunity to go behind the scenes of the hospital, participate in reporting data from each visit, and gain experience in conducting informal group counseling sessions. Volunteers must be comfortable with introducing themselves to the floor and encouraging staff members to take a short break with them. In addition to being warm and welcoming, volunteers should be comfortable with hospital systems and vernacular. Qualifications: Students: Mature, caring students. Ideal for students interested in pursuing social work or counseling. Must have completed 2 college level courses in a relevant field. Must be 18+. Community Members: Mature, caring, and compassionate people who would like to engage in supporting the well-being of professionals at a local hospital. Must have 1-2 years of experience working in a relevant setting.", "title": "Chi Cart Program", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2628669%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Mount Sinai Beth Israel"}], "10040": [{"end": "2017-12-31", "description": "Friendly Visiting is a program that pairs volunteers with homebound seniors to provided company and friendship. Upper Manhattan Partnership for Senior Independence provided friendly visiting services to senior that resides from North 110th street and West of Fifth Avenue to the Northern tip of Manhattan. One visit per week for a period of six months or more can make a difference in a senior&rsquo;s life. Friendly Visiting Coordinator Elissette Reyes De Jesus 212-342-9694 646-228-1812 ereyesdejesus@isabella.org", "title": "Friendly Visiting Program", "zipcode": "10040", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1661881%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Friendly Visiting Program"}], "10043": [{"end": "2017-06-04", "description": "2017: Fifteenth Annual Drums Along the Hudson A Native American and Multicultural Celebration Sunday, June 4th, 2017- Inwood Hill Park 11am to 6pm - Rain or Shine. FREE The 15th Annual DRUMS ALONG THE HUDSON(r): A Native American and Multicultural Celebration will take place on Sunday, June 4th, 2017 in Upper Manhattan&rsquo;s Inwood Hill Park from 11:00 am until 6:00 pm, rain or shine. This event is free to the public and is presented by Lotus Music & Dance in collaboration with the New York City Department of Parks & Recreation, sponsored in part by the New York City Department of Cultural Affairs and the New York City Councilmember Ydanis Rodriguez. The host for the event will be Sandra Bookman, weekend anchor for WABC-TV and host of \\\"Here and Now\\\". The afternoon host will be Patrick Riley Pop Culture Expert/Blogger. During the day, we take time to honor individuals and organizations for their contributions to environmental and humanitarian causes. This year, Yvonne Wakim Dennis, Executive Director of the Children&rsquo;s Cultural Center of Native America will be our honoree.", "title": "\"Drums Along the Hudson: A Native American & Multicultural Celebration\"", "zipcode": "10043", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2635432%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Lotus Music and Dance"}], "10044": [{"end": "2017-06-04", "description": "The Girls on the Run 5k is a non-competitive event that marks the end of our 10 week curriculum and celebrates a season of learning about the importance of taking care of our emotional and physical health. As the culminating event of the Girls on the Run curriculum, it is a moment that beautifully reflects the very essence of the program goals and truly embodies our mission of inspiring girls to be joyful, healthy and confident. We believe that accomplishment comes in all flavors and that everyone who participates - whether they run, walk, hop, skip or cartwheel across the finish line - is to be honored and congratulated. We invite you to join us in this season of celebration! We are excited to announce we are back on Roosevelt Island for our Spring 2017 season! With our program growth, Girls on the Run NYC will be hosting an incredible 5k event for our largest season ever on Sunday, June 4. Your support as a runner or volunteer - whether a parent, teacher, friend or fan - is so important to helping our girls cross the Finish Line with confidence. Our 5k course will have us running the perimeter of Roosevelt Island with beautiful views the entire way. 5k Run/Walk Options: Sparkle Runner ( $35 registration fee): Sparkle Runners will be paired with one of our Girls on the Run teams and will get the chance to run the course, cheering for all of the girls! Open to all females 18 or older. 5k Runner ($30 registration fee for those under 18; $35 registration fee for 18 & up). This category is for any adult and youth participants who would like to run/walk this fun, non-timed 5k, including siblings & friends of our girls! All runners receive a 5k shirt! 5k Volunteer Info: We invite you to join us in this season of celebration! As girls from across our area come together to achieve their goals on 5k day, they will be depending on volunteers like you to help them shine! Below are descriptions of our volunteer needs: Activity Stations: Activity station volunteers help generate excitement for the girls and families before the 5k with the happy hair station and the photo booth. (35 Volunteers) -Happy Hair: volunteers help girls and families get GOTR-ized before the race with colored hair spray. -Photo Booth volunteers help girls, coaches and families capture the joy of the day. All smiles at this station! Course Marshal: Course Marshal volunteers will serve as cheerleaders along the girls and their running buddies! They will also help to ensure safety of all participants. (150 Volunteers) Field Set-up: Field Team volunteers assist with set-up and breakdown of team site flags, tables and water near the finish line. (35 Volunteers ) Registration: Registration volunteers help check-in runners & distribute t-shirts and bibs to 5k participants [non-program participant runners]. (15 Volunteers) Water Station: Water Station volunteers hand out water to participants and encourage them along the way. (30 Volunteers) To learn more about how to run the 5k with us, visit gotrnyc.org/5kinfo.", "title": "Girls on the Run NYC Spring 5K", "zipcode": "10044", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2341397%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Girls on the Run NYC"}, {"end": "2017-06-01", "description": "Objective Be The Match Board of Ambassadors (BoA) is an integral part of our fundraising efforts, serving as representatives of Be The Match within the community to identify, engage and build relationships with individuals and corporations in support of the Be The Match Soiree event to advance our lifesaving mission. Attributes * Individuals of affluence and/or influence in the community * Strong interest in fundraising and charitable giving * Well respected in the community and/or their individual networks * Goal oriented * Has an affinity for Be The Match mission Responsibilities** ** in collaboration with Development Manager and Be The Match Foundation * Actively engage in raising $5,000 in sponsorship, attendees and/or contributions * Collaborate with BoA to identify and coordinate fundraising asks * Support the mission and activities of Be The Match Foundation as a representative, relationship builder and recognition provider * Promote Soiree event through personal and professional network * Identify additional leaders to join BoA * Attend monthly BoA meetings * Provide input and ownership in the Be The Match Soiree development plan Our Board of Ambassadors will be recognized at the Be The Match Soiree, on our Be The Match Soiree materials program and the Be The Match Annual Report.", "title": "Be The Match New York Soiree Board of Ambassadors", "zipcode": "10044", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2573341%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Be The Match"}], "10009": [{"end": "2017-07-09", "description": "We are no accepting applications for Civic Art Lab 2017. Please fill in this form no later than May 15th : http://bit.ly/2nIPDDH Civic Art Lab is a pop-up gallery and workshop space on the Lower East Side at Avenue C & 7th Street, hosted by GreenspaceNYC. For our third year, we return to the Lower East Side. Our 3 day lab themes include sustainability and design; creative re-use; mapping and neighborhood placemaking; urban agriculture; sustainable architecture; health & well-being; and environmental justice, to name a few. Please fill out the following form to apply. Call for submissions is open between April 1st and May 15th, 2017. For additional questions, please email laura@greenspacenyc.org and jeff@greenspacenyc.org.", "title": "Civic Art Lab 2017 |  Call for workshops, talks, and pop-up exhibitions | LES", "zipcode": "10009", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2645727%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GreenspaceNYC"}], "10035": [{"end": "2017-08-22", "description": "We are currently accepting applications for Volunteer Dance Teachers for our Summer Program at Groove With Me, Inc. Groove With Me is a free dance school for girls in East Harlem. It engages girls during the idle out-of-school hours when 90% of youth violence occurs; and seeks to decrease teen pregnancy, truancy, crime, violence, prostitution, substance abuse and gang related activity. East Harlem has the highest unmet need for after school programming of any neighborhood in NYC. By volunteering you provide much needed out-of-school time safety - and arts programming. Summer Programming 2017 Schedule: Session 1 will run from July 5th - August 1st (4 weeks) Session 2 will run from August 2- August 22nd (3 weeks) If you are interested in this opportunity, please give me a call at 212-987-5910 or reach me via email at beatriz@groovewithme.org Beatriz Coronel, MA Program Director Groove With Me, Inc. 186 E 123rd St NY, NY 10035 Phone: 212-987-5910 Fax: 212-987-5080 www.groovewithme.org", "title": "Volunteer Dance Teachers Needed for our Summer Program at Groove With Me, Inc.", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2678136%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Groove With Me, Inc."}, {"end": "2017-06-16", "description": "We are currently accepting applications for a Volunteer Ballet Dance Teacher and Teaching Assistants for our School year Program. This Ballet Class meets twice a week: Tuesdays & Fridays 4 :30pm-6:00pm This teaching opportunity has an immediate start date & requires a full semester commitment, February 3rd through June June 16th. During the semester, you will prepare your students for the Spring Dance Recital taking place on June 17, 20017 at the United Palace Theatre. There are also other opportunities to perform at community events. At Groove With Me, we strive to provide an opportunity for girls to try something new, make new friends, and develop their self-confidence through dance. We create friendships that last a lifetime, girls who are strong in both body and in spirit, and skills that the girls can use both in and out of the studio. If you are interested you can call me at 212-987-5910 or reach me via email at beatriz@groovewithme.org Beatriz Coronel, MA Program Director Groove With Me, Inc. 186 E 123rd St NY, NY 10035 Phone: 212-987-5910 Fax: 212-987-5080 www.groovewithme.org", "title": "Ballet Dance Teacher", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2583939%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Groove With Me, Inc."}, {"end": "2017-06-16", "description": "We are currently accepting applications for a Volunteer Ballet Dance Teacher and Teaching Assistants for our School year Program. This Ballet Class meets twice a week: Tuesdays & Fridays 4 :30pm-6:00pm This teaching opportunity has an immediate start date & requires a full semester commitment, February 3rd through June June 16th. During the semester, you will prepare your students for the Spring Dance Recital taking place on June 17, 20017 at the United Palace Theatre. There are also other opportunities to perform at community events. At Groove With Me, we strive to provide an opportunity for girls to try something new, make new friends, and develop their self-confidence through dance. We create friendships that last a lifetime, girls who are strong in both body and in spirit, and skills that the girls can use both in and out of the studio. If you are interested you can call me at 212-987-5910 or reach me via email at beatriz@groovewithme.org Beatriz Coronel, MA Program Director Groove With Me, Inc. 186 E 123rd St NY, NY 10035 Phone: 212-987-5910 Fax: 212-987-5080 www.groovewithme.org", "title": "Ballet Dance Teacher", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D79233%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Groove With Me, Inc."}, {"end": "2017-05-29", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS 7 Samuel Stern, Manhattan)", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2449360%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}], "10128": [{"end": "2017-05-23", "description": "Have fun and make an impact at one of ten projects across New York City for The Jewish Board's Spring 2017 Month of Hope! For our Abraham Residence III Month of Hope event, you can share your favorite tunes and smoothies with the our adult residents living with mental illnesses. No talent is required, just an interest in having fun! Tuesday, May 23 | Manhattan- Upper East Side | 4:00pm - 6:00pm", "title": "Month of Hope: Song and Smoothies - Manhattan (Upper Eastside)", "zipcode": "10128", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2648433%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jewish Board of Family and Children's Services"}], "10029": [{"end": "2017-05-27", "description": "We're looking for several people to volunteer with our Meals on Wheels program on Saturday, May 27th! We welcome both individual volunteers and small groups. For over 40 years, Union Settlement has provided Meals on Wheels to East Harlem's older residents that are often economically struggling and living alone. Our Meals on Wheels program currently serves approximately 450 homebound seniors each day. Prior to the volunteer date, volunteers will be sent a short training video and brief quiz to help prepare them for participation with Meals on Wheels. Volunteers will help pack hot and cold meals and then join staff on deliveries where they will get to hand out meals to our clients and interact with the East Harlem community. When: Saturday, May 27th from 8:30am to 12:30pm Where: Jefferson Senior Center in East Harlem Interested individuals or groups should email volunteers@unionsettlement.org with the subject line \\\"Saturday, May 27th Meals on Wheels Volunteer\\\".", "title": "Volunteer with Meals on Wheels on Saturday, May 27th!", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2694109%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Union Settlement"}, {"end": "2017-08-03", "description": "Volunteer in Our Summer Program & Support Our Scholars! EHTP seeks passionate volunteers to work with elementary and middle school students during our summer program! Our summer program runs Monday through Friday, and volunteers play a huge role in making the summer successful. Volunteers can choose between the morning or afternoon shifts or do a full day. In the morning, volunteers support our teachers and scholars during academic instruction. In the afternoons, volunteers support during field trips, outdoor activities, and enrichment clubs such as comics, drama, dance, and sports. Volunteers must commit to a minimum of 3 shifts a week or 2 full days for the full 4 weeks of program. When : July 6 - August 3, Monday - Friday Times : 7:45am - 12:00pm (Morning) and/or 12:00pm - 4:00pm (Afternoon) All interested volunteers should apply online here: https://ehtp.cloud.talentedk12.com/hire/ViewJob.aspx?JobID=36 If you have any questions, please contact our Associate, Volunteers & Interns, Raul Lazo, at volunteerinfo@ehtp.org Requirements Volunteers must be at least 14 years old Summer Program is a highly active environment and volunteers must be able to climb multiple flights of stairs, carry heavy boxes, stand for a minimum of 4 hours a day, feel comfortable supervising children in outdoor and indoor settings, and participate in physical activities such as running and sports Acceptance contingent on clearance of a Criminal Background and Medical Check (forms provided during application process)", "title": "Volunteer in Our Summer Program & Support Our Scholars!", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1980798%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "East Harlem Tutorial Program"}, {"end": "2017-08-12", "description": "Harlem RBI, an award winning youth development program, is seeking volunteer T-ball coaches to work with youth ages 5-7 in practices and games. Coaches teach T-ball and provide youth with opportunities to play, learn and grow; inspiring them to recognize their potential and realize their dreams. Each coach serves as a member of a small coaching staff. There are powerful rewards gained from the Harlem RBI coaching experience. Harlem RBI volunteer coaches can have a direct and noticeable impact on the positive development of the youth they coach. The ideal candidate is passionate about youth development, has experience working with youth, and can commit to attending six Saturday practices and games in July/August, as well as a one-day pre-season coaches training on June 25 th. Roles and Responsibilities Guide a team of 16-18 youth through practices and games; Ensure youth safety on the field; Provide a fun and positive, team-based environment; Attend all practices and games on six Saturdays in July and August. Qualifications Passionate about youth development; Understand the power of teamwork; Have the ability to create a positive, team-based environment focused on teaching T-ball; Organized, energetic and flexible; Skilled communicators; Experience in baseball/softball a plus; Able to commit to six Saturdays, in July and August; At least 18 years of age. Hours: Coaches conduct practices and games for an hour and a half on six Saturday mornings or afternoons from 7/9/16 to 8/13/16. Coaches must be able to commit to attend all six Saturday coaching sessions during the summer, as well as the coach training day in June. Harlem RBI provides equal opportunity for all volunteers.", "title": "Volunteer T-Ball Coaches!", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2631647%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Harlem RBI"}, {"end": "2017-06-01", "description": "Urgent! We need caring, responsible Child Care volunteers to assist with toddlers (age 15 months - 3 years old) while their mothers receiving counseling. Times available: Mondays through Fridays Thursdays: 9:30 - 11:30 12:30 - 2:30 and 3 - 5 pm are the session times. Must enjoy interacting with toddlers, engaging in developmental play.", "title": "URGENT: Child Care Volunteers Needed!", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2461383%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "LSA Family Health Service"}, {"end": "2017-06-18", "description": "We need an Office Assitant to help our in various LSA programs, inlcuding Development and also our Early Childhood program. Help with a multitude of tasks to help support our Development Office and/or Early Childhood Parent and Child Development program. Duties may include organizing projects, assist as may be needed in a very busy office environment that support parents at children at the LSA Family Health Service. Computer skills not necessary; just need someone who likes to help out as needed in a busy office environment. Hours: flexible: 2 - 3 hours two days a week. Please contact the Volutneer Director for more details tgough@lsafhs.org", "title": "Office Helper Needed!", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2485118%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "LSA Family Health Service"}], "10027": [{"end": "2017-06-25", "description": "The Harlem Arts Festival (HAF) is proud to announce its 6th annual festival, a weekend-long party full of free music, dance, theater, and visual art, taking place June 23-25 in Marcus Garvey Park! The Festival is the centerpiece of HAF's ongoing programming that celebrates and promotes Harlem&rsquo;s vibrant cultural landscape and contemporary artistry. At last year's festival, more than 6,000 attendees enjoyed performances by more than 40 artists over two days on two different stages. We're expecting an even larger crowd for this year's festival, and that is why we need you more than ever! Volunteers are the key to making the Festival happen, and we've got jobs for everyone. You can help out for one 6 hour shift, a whole day, or even the whole weekend. Below is a list of the positions we need to fill; you can find longer descriptions and more information at http://www.harlemartsfestival.com/volunteer/ Stage Crew Greeters & Street Teams Info Booth Attendants Kids Corner Attendants Builders/Runners Medical Assitants Merchandise Sales Artist Liaison Whether you've volunteered with HAF before or this is your first time, we look forward to working with you on this incredible event that brings artists across Harlem together to celebrate the culture of one of the most diverse neighborhoods in New York City.", "title": "Volunteer with the Harlem Arts Festival #HAF2017!", "zipcode": "10027", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2678515%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Harlem Arts Festival"}], "10024": [{"end": "2017-06-17", "description": "If you&rsquo;d like to help your community and the park, join us for this Community Volunteer event to help paint the iron fences throughout the park! These projects are great ways to meet other volunteers or just explore a different area of the park. Community volunteer events take place rain or shine. Volunteer projects are dependent on the season and the needs of the park. Closed toe work shoes required. Do not bring additional bags, as there is really no place to store belongings. Email: grassroots@riversideparknyc.org or call (212) 870-3073 for more details or to register to volunteer.", "title": "Paint the Park Black Day at Riverside Park", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2689961%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Riverside Park Conservancy"}, {"end": "2017-08-17", "description": "Since 2001 DOROT&rsquo;s prestigious Summer Teen Internship Program has been inspiring high school students to become leaders and give back to the community. Volunteer with a diverse group of socially-conscious high school students to help local seniors connect. The internship is designed to provide students with a minimum of 92 hours of community service. * Documentary Filmaking - Session I * Intergenerational Theater - Session II * Deliver meals and birthday cakes * Teach computer skills * Cook and dine with seniors * Plan intergenerational trips to local museums * 104 hours of community service Session 1: June 26 - July 20 (exceptions made for regents exams) Session 2: July 24 - August 17 Apply here: www.dorotusa.org/teenapp Watch a Day in the Life of a DOROT Teen Intern: https://www.youtube.com/watch?v=jeXyE2YSHCM ''It&rsquo;s an incredibly fulfilling experience to reach out to the seniors in the community and help them with whatever they need assistance with. It's also an added benefit that, as teen interns, we can build relationships with other teens who love the same service work. -Maude, Summer Teen Intern The DOROT Summer Teen Internship Program is jointly funded by UJA-Federation of New York and the Jim Joseph Foundation. The Jewish Education Project serves as lead operator of the Initiative.", "title": "Summer Teen Internship Program 2017", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2565124%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}, {"end": "2017-08-18", "description": "Volunteer tutors needed for low income students for summer session from 7/5/17-8/18/17. You will be matched one-to-one for just two hours per week. Students range in age from 7-18. There are no weekend hours available.", "title": "Help a Child!  Be a Summer Volunteer Tutor", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1110743%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Star Learning Center"}, {"end": "2017-05-24", "description": "Please join us for a special intergenerational reading adventure for 2nd and 3rd graders and older adults. The program is ideal for youth who need extra encouragement to reach for a book and spend time discussing books. Nurture your child&rsquo;s natural love of reading and chatting through a variety of fun and creative intergenerational activities. The group will read aloud a few books over the course of 14 sessions and discuss the major themes of the books respecting other&rsquo;s differences and the value of kindness. Great food and art activities will follow. 2017 Dates: February 1 - orientation (for youth only) February 8, 15 March 1, 8, 15, 22 April 5, 19, 26 May 3, 10, 17, 24 Register online starting December 12. Only 12 spaces are available for youth. Parents need a pre-phone interview. For more information, please contact Shelley Levine at slevine@dorotusa.org. Please note: This program is only for students in 2nd and 3rd grade. We are not in need of teen or adult volunteers to assist in the program.", "title": "Intergenerational Reading Adventure for 2nd and 3rd Grade Students", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2544814%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}], "10025": [{"end": "2017-06-02", "description": "Part pep rally, part global summit, the World Savvy Festival is an annual gathering during which middle and high school students present their ideas for changing the world, and teachers, parents, and community members from across the New York City area provide their support. The day-long event is designed so students leave with an increased confidence in their own ability to effect change, improved global competence, and skills to support their growth as global citizens. During the Festival, students showcase their work exploring solutions to community and global issues. The Festival includes: Students presenting their ideas for addressing issues they&rsquo;ve chosen - such as hunger, homelessness, human trafficking, racial discrimination, or habitat preservation - and receiving feedback A design challenge, during which students from different schools come together for a workshop with their peers about strategies to address a global issue A closing ceremony to celebrate student work and recognize high-scoring projects On Festival day, we&rsquo;re looking for volunteers to help Serve as a greeter, welcoming students, teachers, judges, and other participants and guiding them around campus Serve as judges, meeting with groups of students to listen to them present their projects and offer feedback using a rubric With logistics, including setting up, providing tech support, and documenting student work", "title": "World Savvy NYC Festival", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2687223%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "World Savvy"}, {"end": "2017-06-20", "description": "Each year, on the longest *day, Care for the Homeless and our allies take a few hours to recognize the stories of our homeless and formerly homeless neighbors. The Summer Solstice Success Celebration is an observance developed by Care for the Homeless in New York City and first held in 2014 to both celebrate success in overcoming homelessness and as an effort to de-stigmatize and humanize people experiencing homelessness in New York City. *The actual solstice is on June 21st but, due to important advocacy work in Albany that date, we will celebrate a day later. We are recruiting volunteers to assist with various duties at this event, including food service, set-up, break-down, etc. Where: Broadway Presbyterian Church, 601 West 114th Street, NY, New York 10025 When: June 20th. Time: 3pm - 7pm Who: 10+ Superstar Volunteers If interested, please contact the Volunteer Coordinator at jriendeau@cfhnyc.org directly for more information.", "title": "Help Us Recognize the Successes of Homeless Individuals At Our Annual Summer Solstice Celebration!", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2676691%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Care for the Homeless"}, {"end": "2017-09-01", "description": "The New Jewiish Home, Manhattan Division has a wide variety of opportunities for high school and college students to volunteer with over the summer vacation. Opportunities vary and we will try our best to meet your interest Opportunities include but not limited to: Recreation Assistant (Bingo, Games, Exercise, Arts & Crafts, Nail Spa) Pharamacy (selective, limited spots) Library Assistant (upkeep of shelving, assisting book selections, assisting computer users) Clerical/Office Assistant Please apply online at the following link: https://www.volgistics.com/ex/portal.dll/ap?AP=229551104 Please mention Volunteer Match & Summer Volunteering in your application If you have any questions - Please contact Jessica at JSinovoi@jewishhome.org", "title": "Summer Volunteer at The New Jewish Home (HS & College students)", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D855373%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The New Jewish Home, Manhattan Division"}, {"end": "2017-08-26", "description": "BECOME A SCIENCE, TECHNOLOGY, ENGINEERING and MATH (STEM) VOLUNTEER! Help middle school and high school students develop a passion for math and science by becoming a dedicated instructor, teaching assistant, or afterschool tutor. Whether you're great, good or fair at Science, Technology, Engineering and Math (STEM), you can help make an impact on inner-city youth. Here's how: The Parris Foundation S.T.E.M.ulating Minds Weekend Enrichment Program has returned for the Spring 2017 session . The program began after a successful summer pilot in 2012, and our subsequent programs have grown to continue to serve middle school students and high school students . With the growing impact on the community, we need your support to continue to bring STEM to our middle school and high school youth throughout New York City . As we expand to more locations to serve more youth, there is a growing need for volunteers! Our ideal volunteer is enthusiastic about working with youth, can commit to multiple Saturdays, and possesses, at minimum, basic science and math skills. No previous education experience is required. Your passion for science and math coupled with a desire to help New York City youth realize their true potential is all that is required.", "title": "Spring & Summer 2017 - S.T.E.M.ulating Minds Weekend Enrichment Program", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2489882%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Parris Foundation, Inc."}], "10023": [{"end": "2017-08-25", "description": "Do you want to SEE beyond the declining level of dialogue in the world to what (actually) is real in everyday items of news? This free news sheet is being made available by the Global Center for Human Change at a time when confidence in the veracity of even the basic facts about our world has sunk to an all-time low. 'The REAL News' shows the principles upon which constructive dialogue and the fashioning of a new world built on those principles can take place. It does NOT reflect partisan bias or seek to make any point about current political positioning - it is forward thinking only, beyond the current fixed line of conflict and critique. Do you want to SEE what (actually) is real in everyday items of news at a time when we urgently need to see clearly? Each week, 'The REAL News Team&rsquo;, together with Philosopher and Writer, Richard A. Bowell, take a news story from around the world and show what really is occurring in these times within the context of our evolution and the way to contribute consciously to a new world. Volunteers will become trained in these sessions in the way to SEE what (really) is real in the news, beyond the alarmist or sensationalist portrayal of news we have grown to think is normal. Applications will be accepted until noon on Saturday, 20 May. Successful applicants will be invited to our live training session in New York City on Thursday, May 25 (8pm). JOIN us today! Never before have we needed to be able to SEE our human situation on this planet within the context of our evolution as NOW! Click here for a sample of our weekly news sheet: http://mailchi.mp/globalcenterforhumanchange.org/seeing-what-is-real-news-issue-1-may-1-993549 The Global Center for Human Change is a 501(c)(3) not-for-profit organization in the USA.", "title": "Seeking 20 Volunteers To Join Our News Team And Help Deliver The REAL News!", "zipcode": "10023", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2685081%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Center for Human Change"}], "10021": [{"end": "2017-05-26", "description": "The Carter Burden Network (CBN) is dedicated to supporting the efforts of older people to remain in their homes living independently, safely, and with dignity. Volunteers are an integral component of the Carter Burden Center&rsquo;s 40+ years of success. No matter your age, experience or schedule, CBN can accommodate your needs to ensure that you have a meaningful and effective volunteer experience. The month of May is Senior Month! CBN is looking for volunteers to help us celebrate at our senior centers! Volunteers can participate in activities such as the kick off parties, art shows, ice cream socials, and Senior Celebration parties. Volunteers can choose between volunteering at the following locations: Carter Burden Luncheon Club is located at 351 East 74th Street Carter Burden/Leonard Covello Senior Program is located at 312 East 109th Street. Please join us at one or both of these locations to celebrate our wonderful seniors! Dates and times are flexible.", "title": "Volunteer to help celebrate seniors during Senior Week!", "zipcode": "10021", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1988839%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Carter Burden Network"}, {"end": "2017-07-17", "description": "DKMS is proud to announce that we are an official charity partner in the 2017 New York City Triathlon! DKMS is currently recruiting athletes to race on Team DKMS in the NYC Triathlon and raise crucial funds to give hope to blood cancer patients everywhere. Benefits: All participants are asked to raise $2,000 for DKMS and will receive the following benefits · Guaranteed entry for the 2017 NYC Triathlon · Paid race registration fee · Team DKMS socks, jersey, and warm-up jacket · Invitation to team social events · Pre-race team dinner for you and your family · Cheering section for family and friends along the course · Personalized online fundraising page · Fundraising toolkit · Fundraising support from DKMS staff member Join Team DKMS today in the NYC Triathlon and help us take down blood cancer! Training calendar detailing workouts for self-led training · Group training meet-up · Access to a Team DKMS mentor for personalized training tips", "title": "Volunteers Needed to Join Team DKMS in the 2017 New York City Triathlon!", "zipcode": "10021", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2637870%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DKMS"}], "10065": [{"end": "2017-06-17", "description": "Responisbilities of our volunteers will include, but not limited to, providing instruction and or oversight of event programming, managing lines/crowds, and fulfilling general event operations. We ask all interested parties to register by completing this form, https://docs.google.com/forms/d/e/1FAIpQLScznRfFKzyAlvBUuT627YZnvxUgcijFS-RRAKSV_HXD9JdGQw/viewform?usp=sf_link. If you have any questions, please contact Anthony Sama at Anthony.Sama@parks.nyc.gov with the title \\\"Adventures Volunteer\\\" in the subject line. Please note that at this time we are only accepting volunteers over the age of 18, but welcome groups of any size! Volunteers for our events all receive lunch for the day as well as a token of our gratitude! Volunteer's need not have volunteered with us before, nor need any event experience, but there are certain requirements we ask of those who will join us: 1. Must be over the age of 18 2. Must be available for seven (7) hours, 9:30am-4:30pm on June 17, 2017 3. Should be able to attend a 45 min live volunteer orientation webinar on Wednesday, June 14th at 6:30pm. *If you cannot commit to all of the above mentioned requirements, we may not be able to consider you for this opportunity.", "title": "NYC Parks Adventures 2017!", "zipcode": "10065", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2692690%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "NYC Department of Parks and Recreation"}], "10030": [{"end": "2017-09-01", "description": "Behind the Book works directly in New York City public schools, providing rich, innovative literacy programs to urban classrooms. Working with students from pre-K to 12th grade, Behind the Book identifies books that speak to students, then partners with teachers to create immersive curriculum units that bring the authors into classrooms. Through a series of workshops, authors discuss their book and teach a genre of writing, encouraging students to see themselves as readers and writers. Behind the Book seeks a Program Intern to assist with the design, implementation, and administration of our school programs. The intern will work closely with the Director of Programming and the Program Coordinators to support all aspects of our programs. The position is based in our Harlem office. The commitment is for one semester, minimum two days per week, hours are flexible. Responsibilities include: Working with students in classrooms Managing the Behind the Book library; conducting research and managing review copies Assisting with student book publication as needed Supporting staff with program logistics and administration Assisting in creating lesson plans, activities and worksheets for our school programs QUALIFICATIONS: Detail-oriented, eager to learn, and able to manage tasks independently. Excellent written and oral communication skills in English are required, as are strong skills in Microsoft Office. A background in education theory or previous teaching experience a plus. TO APPLY: Please submit a resume, cover letter, and a one-page writing sample to Jo Umans at info@BehindtheBook.org. \\\"Program Intern\\\" should appear in the subject heading of your email. Deadlines to apply for next two semesters: Spring 2017: February 13th Summer 2017: May 31st Behind the Book is committed to providing equal opportunity to all employees and applicants without regard to race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, political affiliation, family responsibilities, or any other characteristic protected under federal, state, or local law. We are committed to maximizing the diversity of our organization, as we want to engage all those who can contribute to this effort.", "title": "Program Intern", "zipcode": "10030", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2450226%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Behind the Book"}, {"end": "2017-09-01", "description": "Behind the Book works directly in New York City public schools, providing rich, innovative literacy programs in urban classrooms. Working with students from pre-K to 12th grade, Behind the Book identifies books that speak to the students, and partners with teachers to create immersive curriculum units that bring the authors into the classroom. Through a series of workshops, authors discuss their book and teach a genre of writing, encouraging students to see themselves as readers and writers. Learn more about Behind the Book on our website. Behind the Book seeks a Fundraising and Development Intern to assist the Development Manager in all aspects of fundraising. The position will be based at our Harlem office. The commitment is for one semester, for a minimum of two days per week. Responsibilities include: Researching prospective funders Assisting with donor communication, including thank you letters, appeal letters, and letters of inquiry to foundations Publicizing donations (and/or profiling donors) on Behind the Book&rsquo;s website, newsletter and social media Assisting with database management (training on Salesforce provided) Assisting with promoting fundraising events. QUALIFICATIONS: Detail-oriented, eager to learn, and able to manage tasks independently. Excellent written and oral communication skills in English are required, as are strong skills in Microsoft Office. Strong research skills are a plus. Candidates interested in fundraising and philanthropy are strongly encouraged to apply . TO APPLY: Please submit a resume and cover letter, along with a two-page writing sample to Kara Matthews at kara@behindthebook.org. \\\"Fundraising & Development Internship\\\" should appear in the subject heading of your email. Deadlines to apply for next two semesters: Spring 2017: February 1st Summer 2017: May 31st Behind the Book is committed to providing equal opportunity to all employees and applicants without regard to race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, political affiliation, family responsibilities, or any other characteristic protected under federal, state or local law. We are committed to maximizing the diversity of our organization, as we want to engage all those who can contribute to this effort.", "title": "Fundraising & Development Intern", "zipcode": "10030", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2343675%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Behind the Book"}, {"end": "2017-09-01", "description": "Behind the Book works directly in New York City public schools, providing rich, innovative literacy programs in urban classrooms. Working with students from pre-K to 12th grade, Behind the Book identifies books that speak to the students, and partners with teachers to create immersive curriculum units that bring the authors into the classroom. Through a series of workshops, authors discuss their book and teach a genre of writing, encouraging students to see themselves as readers and writers. Behind the Book seeks a Social Media Intern to work with our Development Manager to coordinate a range of social media platforms. The position is ideal for a go-getter with a strategic mind and excellent communication skills who wants to be an integral part of implementing BtB&rsquo;s social media strategy. The position will be based at our Harlem office, with a commitment is for one semester, a minimum of two days per week. Responsibilities include: Developing and posting social media content on Facebook, Twitter, Instagram and other social media platforms Updating BtB&rsquo;s blog (WordPress) regularly with new content that features stories and pictures from our school programs and other news of interest from our organization Selecting and editing pictures, student work, and videos related to our programming for the blog, social media, and newsletter QUALIFICATIONS: Detail-oriented, eager to learn, and able to manage tasks independently. Excellent written and oral communication skills in English and experience with social media sites required. Experience with WordPress and Mail Chimp a plus. TO APPLY: Please submit a resume and cover letter that includes some ideas about BtB&rsquo;s social media to Kara Matthews at kara@behindthebook.org. \\\"Social Media Internship\\\" should appear in the subject heading of your email. Deadlines to apply for next two semesters: Spring 2017: February 1st Summer 2017: May 31st Behind the Book is committed to providing equal opportunity to all employees and applicants without regard to race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, political affiliation, family responsibilities, or any other characteristic protected under federal, state or local law. We are committed to maximizing the diversity of our organization, as we want to engage all those who can contribute to this effort.", "title": "Social Media Intern", "zipcode": "10030", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2095952%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Behind the Book"}, {"end": "2017-08-28", "description": "We are trying to start a coding and or robotics program for students in Central Harlem. Volunteers need that are interested in teaching and coaching High School students on how to write codes and develop the skills needed to build , understand and compete in the robotics field.", "title": "ROBOTICS OR CODING VOLUNTEER NEEDED", "zipcode": "10030", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2536143%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Future Giants"}], "10032": [{"end": "2017-06-07", "description": "Opportunity: The Wa-Shokuiku Project is a new initiative from TABLE FOR TWO USA* which provides practical application to the universal principles found in washoku, or Japanese cuisine, through free afterschool educational programming for elementary school students . Through guided lessons and activities, students will learn about well-known foods such as sushi, which many already recognize as Japanese, as well as other home-style dishes such as miso soup and onigiri (riceballs) which can be easily prepared. Through these interactive programs, we hope to instill a deeper understanding of Japanese food and culture while equipping them with lifelong practical knowledge and skills about one of the world&rsquo;s healthiest diets. Our Cooking Instructors and Volunteers will implement and teach the Wa-Shokuiku Curricula in schools across New York City, Washington D.C., and Boston. Instructing children about Japanese cuisine (washoku) and food education concepts, the cooking instructors will help to introduce children to cuisine and culture which many are learning about for the first time. Volunteer Responsibilities: Assist the Cooking Instructor in cooking and curricula implementation. Oversee and assist the safe participation of young student cooks. Encourage interest in Japanese food and culture. Coordinate with the Instructor and other key Wa-Shokuiku staff to gather information, data, and resources on the success of our programs. Time Commitment: At least 2 hour for training and orientation. Approximately 2-2.5 hours per week for lesson preparation, travel time, class time, set-up and clean-up during program period duration. About the Wa-Shokuiku Project: * TABLE FOR TWO USA (TFT) is a 501(C)(3) organization that that addresses the opposite issues of hunger and obesity through a unique \\\"meal-sharing\\\" program. TFT partners with corporations, restaurants, schools and other food establishments to serve healthy, low- calorie, TFT-branded meals. For each one of these healthy meals served, a small portion of the cost is donated to provide one school meal for a child in need. In this way, TFT has served healthy meals to both sides of the \\\"table\\\" and helped to right the global food imbalance. TFT started in Japan and now operates in 14 countries. As one of the most well-known NPOs in Japan which is noted for the longevity of its people, TFT promotes Japanese healthy eating culture as well to tackle the critical health issues. Learn more at: http://usa.tablefor2.org", "title": "Volunteer Support for Japanese Food Education Class", "zipcode": "10032", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2661841%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "TABLE FOR TWO USA"}, {"end": "2017-06-07", "description": "Nonprofit TABLE FOR TWO seeks a volunteer Photographer or Videographer for the launch of our new Japanese-inspired food education \\\"Wa-Shokuiku Project.\\\" Our program offers free Japanese cooking classes to children in New York City Schools, teaching them not only about Japanese food and food culture, but mindfulness and appreciation towards food and the environment. We are seeking photos/videos of students participating in the cooking class. The photos/videos will be used for our website, social media and other development materials. TABLE FOR TWO is an award-winning non-profit organization with a mission to promote healthy eating around the world (we have received many international social entrepreneurship awards). Let's make a difference!", "title": "Photographer/Videographer for Kids Food Education Event! NYC", "zipcode": "10032", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2613419%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "TABLE FOR TWO USA"}], "10019": [{"end": "2017-06-04", "description": "The American Liver Foundation Greater New York Division is looking for volunteers to help out at the 2017 Liver Life Walk in New York City! Event duties include: Event Set-up Duties: Assist in hanging banners, setting up tables and chairs, decorating etc. Registration Duties: Welcome participants as they check-in, pick-up their t-shirts and receive detailed information about the day. Parking Attendants Duties: Direct vehicles to empty parking spaces one at a time. There will be an area for volunteers to park separate from participant parking. Also, parking attendants will assist with placing directional signs to designate where the event is being held. Course Set-up Duties: Place route markers and educational signs throughout the walk course approximately every few blocks so walkers/runners are able to stay on the course. Responsibilities also include: 1. Deliver tables, water and cups to water stations 2. Drop-off water station volunteers and course monitors 3. During the Walk, patrol the course to pick-up any tired walkers 4. Follow the final walkers to pick up the course monitors and water stop volunteers 5. Return to the course to pick up the remaining water, cups, tables and signage Course Monitors Duties: As a Course Monitor, you will be stationed at specified intersections along the course to help participants cross any busy intersections and cheer them on to the finish. You might be asked to wear a bright orange vest to distinguish yourself. Greeters Duties: This is every participant's first impression of the event! Greet participants after they have parked and direct them to the registration area. T ent Supervisors Duties: We will be having several tents with food, drinks, games, etc. so we will need people to oversee that everything is going smoothly. We are happy to provide proof of volunteer time for those who need it for schools, community service, etc. If interested, please contact Stefany Arias at sarias@liverfoundation.org.", "title": "2017 Liver Life Walk New York City", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2643488%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "American Liver Foundation Greater New York Division"}, {"end": "2020-12-31", "description": "The National Chorale is a premier NYC choral organization, founded 49 years ago, made up of an Ensemble of professional singers and soloists. Our annual concert series is presented in David Geffen Hall at Lincoln Center. We also present choral performances in other NYC venues as well as at other local, national and international festivals and music events and conferences. We also have a K-12 music training program where we provide professional music teachers in local NYC public schools. Our Executive Director is underwater with her workload, some of which we would like to offload to Administrative / Clerical Assistants. Work ranges from researching items on the Internet, to answering phones, to preparing reports, to scheduling events and people, to occasionally running an errand, typing - letters and reports and input to our database, attending meetings, communicating with our audience members, Board Members, concert personnel, funders, sponsors and K-12 NYC school administrators and teachers. Folks who have worked in the corporate environment with experienced office skills would be ideal. Office is in midtown Manhattan (Broadway & West 51st Street. Friendly office environment. Prefer a minimum of 20 hours per week, but we will work with you to design a schedule that is comfortable for you. We really need your help and like most nonprofit organizations, cannot afford to hire the support staff we require. BTW, one of the perks for our volunteers is that they are provided with two tickets to every Lincoln Center concert, and more if needed! Come join us and know that you will be making a real impact with a deserving nonprofit organization!", "title": "Administrative / Clerical Help", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2583139%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National Chorale"}], "10018": [{"end": "2017-06-02", "description": "Global Green is seeking help from a reseacher to support our Solar for Sandy initiative. Global Green has built the first two resilient renewable projects at community centers in areas impacted by Super Storm Sandy, including the first solar + battery project in NYC at the Red Hook Recreation Center. See video here for more background: Solar for Sandy project https://www.youtube.com/watch?v=281Xbww9D-E We're in the process of building four more projects. Global Green is seeking help from a volunteer to help us model new options for building additional projects that include exisitng solar and battery incentives in New York and New Jersey. Volunteers with a background in engineering, financial modeling and/or economics research are welcome. Above all, this research takes a combination of persistence and analytical curiousity.", "title": "Researcher Needed for Solar Resiliency Initiative", "zipcode": "10018", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2667240%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Coalition for Resource Recovery Global Green USA"}, {"end": "2017-06-16", "description": "Global Green has built two pioneering solar resiliency projects in New York City, including the first solar + battery project at a New York City community center. The project is at the Red Hook Recreation Center in Brooklyn and featured in this video here: https://www.youtube.com/watch?v=281Xbww9D-E Following our education and demonstration programs, we're seeking to advise other commuity centers how they can adopt similar programs. Global Green is seeking help from a researcher to model a) incentives b) demand charges and other factors to see where and how solar resiliency programs can be cost effective for community centers to adopt similar programs.", "title": "Energy Markets Researcher Needed for Solar Resiliency at Community Centers", "zipcode": "10018", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2671561%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Coalition for Resource Recovery Global Green USA"}, {"end": "2017-06-16", "description": "Global Green NY is looking for volunteers to help with our food donation work this summer. Volunteer opportunities are for food donation pick-ups in Midtown Manhattan on weekday nights (during typical resutrant closing time), where food will then be transported to food banks and shelters for those in need. http://www.globalgreen.org/getinvolved/ Ideally volunteers: For food rescue volunteers, the only qualifications are that they are punctual, reliable and able to carry 20+ lbs of food.", "title": "New York GGUSA Volunteer", "zipcode": "10018", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2371092%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Green USA"}], "10038": [{"end": "2017-06-30", "description": "Community center in Chinatown in Manhattan desperately needs a makeover to make our students smile. We provide the paint, rollers and everything else and you are the painters. Looking for some amateur painting experience and neat workers. Mural artists are welcome too.", "title": "Paint smiles on the faces of our students by painting our classrooms", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2676189%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Hamilton-Madison House"}, {"end": "2017-12-31", "description": "We are looking for volunteers with dance experience to help run a weekly movement-based creative workshop for students with intellectual disabilities in Fort Hamilton, Brooklyn, Wednesdays from 11-12. This opportunity takes place over 12 weeks, for a small group of middle and high school students. The workshop will culminate with an informal showing. We are also looking for volunteer yoga instructors in all boroughs.", "title": "Looking for Dance Teachers and Yoga Instructors", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2556600%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "AHRC NYC"}], "10013": [{"end": "2017-06-04", "description": "Great Strides is the Cystic Fibrosis Foundation&rsquo;s signature event and its largest and most efficient nationwide fundraising campaign. This year, Great Strides will raise over $43 million in an effort to add tomorrows to the lives of all those living with cystic fibrosis. Join the Greater New York Chapter on Sunday, June 4th (Foley Square, Lower Manhattan) and help us prepare for Great Strides 2017. Check-in, opening ceremonies and breakfast will begin in the morning. The walk will conclude with entertainment, our Kid&rsquo;s Korner, family festival, lunch, closing ceremonies and much more. Listed below are descriptions of various volunteer roles. Your help will ensure that Great Strides 2017 is a huge success! Set-up & Signage Greeters Registration Route T-Shirt Distribution Food Distribution Clean-up Contact Shara Swift, Development Manager, at 212-986-8783 or by e-mail at sswift@cff.org for more information or to sign up!", "title": "Volunteer at the 2017 Great Strides Walk in NYC!", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2331484%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Cystic Fibrosis Foundation, Greater NY Chapter, Manhattan Branch"}, {"end": "2018-05-28", "description": "Vice President/Secretary This combined role brings together two integral functions of our NYC Chapter Board - the Vice President and Secretary positions. Simply put, this person will ensure that things get done and is the perfect role for a \\\"can-do\\\" project director. Among his/her principal responsibilities, the VP/Secretary will: Work with the President to o versee all strategy and operations for the NYC Board of Shine Foundation, including... Presiding over Team Meetings Inspiring and motivating team members to advocate for Shine&rsquo;s mission and to move toward the Chapter&rsquo;s goals Set and ensure adherence to internal timelines Prepare meeting agendas and minutes Manage the team&rsquo;s internal documents Work alongside each team member on his/her responsibilities, such as recruitment, fundraising, volunteer training, etc., on an as-needed basis Perform other duties outside of this role, within his/her ability and as needed", "title": "Vice President-NYC Chapter", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2687884%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Shine Foundation"}, {"end": "2017-06-10", "description": "For many new immigrants, learning English is a first step to full participation in American society. Help them take that first step by becoming a volunteer teacher in English or Citizenship classes. English classes help students improve their communication skills. Citizenship classes help students prepare for the U.S. citizenship test. Volunteers work in teams to plan lessons and teach the class. This fun and rewarding experience gives you a chance to make a difference in the lives of others. Individuals with an interest in education careers are encouraged to apply. Requirements Must have good communication skills and a strong desire to help and work with new immigrants Prior teaching experience is preferred. Bilingual skills are a plus. We prefer volunteers who can commit to teaching at least two semesters Prospective volunteers must complete application and be interviewed. Volunteer Schedule: 9:30 am-11:30am (Tues or Thurs) 10:15am-12;15pm (Monday) 1pm to 4pm (Saturday) 6:30pm to 8:30 pm(Mon, Tues or Wed) Spring 2017 - Jan 33, 2017 to June 10, 2017 Summer 2017 - July 10, 2017 to August 19, 2017 Fall 2017 - September 19, 2017 to December 16, 2017 Prospective volunteers must complete application and will be interviewed. Please contact us at cpanyc@cpanyc.org for an application OR apply on-line here: http://bit.ly/volunteerteacherapp", "title": "Teach English or Citizenship Class in Chinatown", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D906407%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chinese Progressive Association"}], "10012": [{"end": "2017-06-11", "description": "Contact the volunteer coordinator at volunteer@housingworksbookstore.org with any questions or to sign up. If you are looking to schedule a group, please include the name of the organization you work with and how many volunteers you hope to sign up for the opportunity. Please do not contact us through VolunteerMatch. Thanks for you interest in supporting us for Housing Works Bookstore Cafe's annual Open Air Street Fair! The Open Air Street Fair is our daylong block party and shopping bazaar along Crosby Street, between Houston and Prince. Featuring thousands of donated books, records, and CDs for $1 each; live music presented by Two Boots Americana Jamboree; food specials from our Bookstore Cafe, and unique finds from our Soho Thrift Shop. This event is a can&rsquo;t-miss start to the summer, and all to support a great cause. This is sure to be a great event and we look forward to sharing the experience with you! We currently have four shift openings: Event Set-Up Team: 7:00 am-10:00 am This opportunity is great for early risers! Volunteers will be helping us set-up the tables, arranging books, and moving the first batch of books to the tents before customers arrive. Morning Team: 9:30 am to 1:30 pm This is a customer-facing opportunity, where you will be helping shoppers as well as restocking books. Afternoon Team: 1:00 pm-5:00 pm This is a customer-facing opportunity, where you will be helping shoppers as well as restocking books. Event Break-Down Team: 4:00 pm-7:00 pm This group of volunteers help us clean up following the Street Fair, including packing up books and some additional light cleaning.", "title": "Help Housing Works out at our Annual Outdoor Street Fair on June 11th! **great for groups!**", "zipcode": "10012", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2661506%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Housing Works"}, {"end": "2017-06-30", "description": "Housing Works Bookstore and Cafe is an entrepreneurial arm of Housing Works, a New York non-profit whose mission is to end the dual crises of homelessness and AIDS through relentless advocacy, the provision of lifesaving services, and entrepreneurial businesses that sustain our efforts. All of the books we sell are donated by members of the community, and a majority of the people that work in the bookstore are volunteers. You can find out more about Housing Works' mission, services, and advocacy by visiting our website: http://www.housingworks.org/ We are looking for a group of volunteers to help us out with our annual inventory on Friday, June 30th. This is a crucial activity for the continued running of the Bookstore Cafe, and we would love to have your group participate! Members of your group will help us keep track of our stock of each and every one of our books. This is a great opportunity to explore a variety of different books, as well as enjoy the atmosphere of the Bookstore Cafe at a time when it will be closed to the public. We are currently looking for groups of around 10 people for two shifts: 10 am to 2 pm and 1:30-5:30. We are flexible in terms of scheduling, so if these shifts do not work for your oranization, please contact the volunteer coordinator, and we can set up a time that works best for you. Please contact the volunteer coordinator at volunteer@housingworksbookstore.org if you are interested or have any questions!", "title": "Group Volunteer Activity at the Housing Works Bookstore Cafe on Friday, June 30th", "zipcode": "10012", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2392116%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Housing Works"}, {"end": "2017-07-03", "description": "This opportunity is available every Monday and Tuesday! Spare just half an hour to bring leftover food to the nearby Bowery Mission! The final destination will be the Bowery Mission at 227 Bowery. Middleweight: the average amount of food is 15-20 pounds. Sign up directly on our website: Monday 2/13/17 http://www.rescuingleftovercuisine.org/events/15501 Tuesday 2/14/17 http://www.rescuingleftovercuisine.org/events/15502 Monday 2/20/17 http://www.rescuingleftovercuisine.org/events/15503 Tuesday 2/21/17 http://www.rescuingleftovercuisine.org/events/15504 Monday 2/27/17 http://www.rescuingleftovercuisine.org/events/15505 Tuesday 2/28/17 http://www.rescuingleftovercuisine.org/events/15506 Monday 3/6/17 http://www.rescuingleftovercuisine.org/events/15507 Tuesday 3/7/17 http://www.rescuingleftovercuisine.org/events/15508 Monday 3/13/17 http://www.rescuingleftovercuisine.org/events/15509 Tuesday 3/14/17 http://www.rescuingleftovercuisine.org/events/15510", "title": "Stop Food Waste and Feed the Hungry Every Monday & Tuesday In Soho. 3:00-3:30pm", "zipcode": "10012", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2259867%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Rescuing Leftover Cuisine, Inc."}], "10011": [{"end": "2017-06-28", "description": "Dance to Unite, Inc is a non-profit organization whose mission is to use dance as a vehicle to teach and to celebrate cultural diversity. To learn more about us and what we do, please check: www.dancetounite.org We are currevtly in need of volunteer photographers (students are welcome) to take photos at our students' final performances. Day, time and location varies as we partner with 10 different schools in the 5 boroughs. Date/time is dependent upon when the performace is scheduled to be held. Performaces will be held anytime between Mid-May to the first week of June and photographers will be needed for approximately 2 hours. We will credit your photos at our social media. It's also a great opportunity to build a portfolio for students. For more info, please contact Tal Adani- taladani@msn.com", "title": "Volunteer photographers needed for our final student performances!", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1859922%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Dance to Unite"}, {"end": "2017-06-03", "description": "Photographers and videographers are needed to capture our first annual Business Plan Competition Finals! BUILD NYC&rsquo;s Business Plan Competition will bring together 80 student teams across 10 schools from the Bronx, Brooklyn, and Manhattan. The Competition will be the culminating event for our 450 9th-graders, who have spent the academic year pitching their business ideas and funding requests, creating prototypes, and working alongside mentors to strengthen their business acumen. 40 teams will have the opportunity to sell their products from 10AM-12PM, and the top 5 teams in each of the following categories will compete to take home the prize: 30-Second Elevator Pitch, and Top Overall Pitch. Winners will receive cash awards, prizes, and invaluable experiences.", "title": "Photographer and/or Videographer for Student Pitch Competition!", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2682370%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "BUILD"}, {"end": "2017-07-14", "description": "We're looking for six (6) compassionate volunteers to help throw a garden party for our residents at the Christopher. Built originally in 1904, The Christopher is the site of the former Robert McBurney YMCA, and was an important fixture in Manhattan&rsquo;s vibrant Chelsea neighborhood. Immortalized in the song \\\"YMCA\\\" by the Village People, the McBurney YMCA provided affordable accommodations for single working men, low-income individuals and merchant seamen. Andy Warhol and playwright Tennessee Williams were among the famous residents who took advantage of the YMCA&rsquo;s affordable lodging and recreational facilities. Rehabilitated by Breaking Ground in 2004, The Christopher provides 207 units of permanent supportive housing for low-income or formerly homeless adults and persons living with HIV/AIDS. The Christopher also houses the Foyer Program, a housing-based career development program targeting young adults ages 18-24 who are \\\"aging out\\\" of foster care or already homeless. Good Shepherd Services provides education, career and other assistance to residents of the Foyer Program which are specifically tailored to the circumstances of young adults preparing for independence.", "title": "Garden Soiree at the Christopher", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2681930%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Breaking Ground"}, {"end": "2017-08-23", "description": "GRANT WRITER The Grant Writer is primarily responsible for developing and writing grant proposals to foundations and other grant-making organizations, and will persuasively communicate CSP's mission and programs to potential funders. Reporting to the Executive Director, the Grant Writer will assemble and submit grant requests, establish and maintain personal contact and relationships with foundation contacts, conduct prospect research, and maintain a calendar of submissions and other deadlines. To get a response please send RESUME.", "title": "Grant Writer", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D643540%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2017-08-23", "description": "Computer/It - Tech Support - All aspects of tech support for the organization including maintenance, troubleshoot, specially ANTI-VIRUS, and optimal functioning of the system. Must have experience with Microsoft and Windows systems. To get a response please send RESUME .", "title": "Computer support", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D601216%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2017-08-23", "description": "Education Program Coordinator - Chelsea Sculpture Park. New York , New York. Basic Requirements: BA or MA in related discipline required (Art Education) Post college professional work experience required Demonstrated experience with art education or other informal art programming and curriculum design Demonstrated knowledge of Microsoft computer programs and excellent presentation skills Job Responsibilities: Coordinate and develop of new partner-institution/organization relationships and curriculum Provide leadership and direction towards the design and implementation of art educational programming and curriculum in compliance with national and state learning objectives, accreditation guidelines, and innovative art methodologies Establish and grow professional relationships with constituents, peers, associations and partner schools To Apply: Please submit your resume with cover letter and references to the contact information listed below. Set against the backdrop of the Hudson River, Chelsea Sculpture Park will offer fine art for the public to experience, up close and outdoors. The park's mission is to provide an aesthetic oasis in the Chelsea Cove section of Hudson River Park located between 22nd and 26th Streets, just steps away from the world-class Chelsea Art District. We are looking for a Education Program Coordinator to assist the founder and executive-director of Chelsea Sculpture Park develop and implement an educational program foccusing on the exhibitions of the sculpture park.", "title": "Educational Program - Coordinator", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D481515%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2017-08-23", "description": "Chelsea Sculpture Park New York, New York Are you considering a future in arts administration, nonprofit management, fundraising, arts education or a related field? This is a great opportunity to gain experience working at a brand new nonprofit arts organization that is dedicated to building a sculpture park on the banks of the Hudson River Park. Gain invaluable insights and learn fundraising strategies as part of a dynamic Development team. Assist with prospect research, special events, direct mail, and our donor database, as well as pursue special projects. Internship credit may be arranged through your academic program. The ideal candidate will be organized and detail-oriented, and have good computer skills. Those with prospect research experience and graduate students in arts administration and arts education are especially welcome. The hours for this position are flexible within the work week. A modest stipend is available. To Apply: Please be sure to include current contact information so that we may arrange an interview. To get a response please send RESUME .", "title": "Development Intern", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D297980%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2017-06-30", "description": "- The PR & Marketing Manager will be in charge of newsletter, developping partnerships, assisting executive director in scheduling meetings and social media. This position is NOT PAID.", "title": "CHELSEA FILM FESTIVAL: PR & Marketing Manager", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2579116%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Film Festival"}, {"end": "2017-06-08", "description": "Job Description Development and Special Events Intern (Unpaid) About Corlears Corlears School, is a Nursery through 5th Grade, New York City independent school. When you enter Corlears School from its front door on West 15th Street in Chelsea, you are immediately struck by the energy and the excitement of the community. Students and teachers know each other in deep and authentic ways. Families support and partner with the school to elevate every child&rsquo;s experience. Our Mission: Corlears students learn, play and grow together in a school designed for who they are at ages 2 through 10. During these crucial formative years, we build a foundation of compassion, critical thinking, imagination and leadership, and cultivate a joy and confidence in learning that serves our graduates throughout their lives. Responsibilities Working closely with the Director of Development & Alumni Affairs assist with the following key projects: Assist in reviewing our current Annual Fund messaging, researching current strategies used by small independent schools serving N-5th grade Analyze FY17 Annual Fund strategies and develop recommendations for changes to strategies and timing for FY18 (July 1, 2017 - June 30,.2018). Review FY17 Annual Fund metrics, tabulating and reporting on FY17 outcomes. Assist in developing tracking and metrics for Alumni engagement program. Research Alumni current industries/geographic distribution and craft tracking database to be used for engagement strategies. Special Events: Assist Director of Development in collaborating with the Auction Committee for our annual gala fundraising and auction event on Friday, March 3rd at Tribeca Rooftop, including opportunity to assist day of event and attend the event. Assist in the development and execution of two Alumni events aimed at cultivation A spring intergenerational community service project A summer cocktail event Qualifications Strong analytical skills and some experience working with databases helpful Interest in learning about the field of philanthropy especially individual giving, major gifts and special events. Excellent written and verbal communications skills Passion for education and the impact child centered early childhood education has in building a lifelong love of learning. Availability Minimum 12 hours weekly on-site. Monday-Friday between 8:00am -5:00pm. Specific days/hours are flexible. Location Corlears School, 324 West 15th Street, New York, NY 10011 Website : www.corlearsschool.org To Apply Please send a cover letter and resume to Mallory King, Director of Development & Alumni Affairs at: malloryk@corlearsschool.org . In your cover letter please share why you are interested in this position and what skills and experience you bring that are relevant to this opportunity. College credit may be arranged at the discretion of your institution.", "title": "Development/Special Events Intern", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2562628%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Corlears School"}, {"end": "2017-06-09", "description": "Job Description Admissions and Marketing Intern (Unpaid) About Corlears Corlears School, is a Nursery through 5th Grade, New York City independent school. When you enter Corlears School from its front door on West 15th Street in Chelsea, you are immediately struck by the energy and the excitement of the community. Students and teachers know each other in deep and authentic ways. Families support and partner with the school to elevate every child&rsquo;s experience. Our Mission: Corlears students learn, play and grow together in a school designed for who they are at ages 2 through 10. During these crucial formative years, we build a foundation of compassion, critical thinking, imagination and leadership, and cultivate a joy and confidence in learning that serves our graduates throughout their lives. Responsibilities Working closely with the Communication and Admission Associate assist with the following key projects: Improving the website SEO Utilize guidance provided by enrollment consultant and SEO consultant to implement their plan to modify Corlears website content and structure with a focus on optimizing the site&rsquo;s search engine results. Assist in adding keywords throughout the Corlears website and testing the SEO results under the direction of the SEO consultant. (Corlears website is powered by SquareSpace ) Launch corporate connections initiative Utilize guidance provided by enrollment consultant to identify materials needed for outreach to the HR departments at local corporations re: locally based independent school options Draft corporate outreach materials working with Communications Associate Research local corporations HR/People Operations/Employee Success departments to identify most appropriate contacts for outreach to employees on pre-school/elementary school options. Make initial outreach to identified corporate contacts Draft web content demonstrating our expertise in early years education Utilize guidance of enrollment consultant and SEO consultant to determine parameters of new content needed to build web presence and expand our profile as experts in early years education. This may include a YouTube channel, a Blog and other social media/web-based outlets. Assist with drafting and launching new web content Assist with creating new web/social media presence (potentially a YouTube Channel, a Blog, Instagram) Social Media Content Assist Communications Associate with weekly social media posts on varied platforms with a focus on Facebook Qualifications Social media experience in business/non-profit settings Experience creating website content and editing/updating existing website content Skills in Photoshop and/or working with digital images on social media / website platforms Ability to conduct business research and compile findings for further use Web-based marketing skills a plus Availability Minimum 12 hours weekly on-site. Monday-Friday between 8:00am -5:00pm. Specific days/hours are flexible. Location Corlears School, 324 West 15th Street, New York, NY 10011 To Apply Please send a cover letter and resume to Mallory King, Director of Development & Alumni Affairs at: malloryk@corlearsschool.org . In your cover letter please share why you are interested in this position and what skills and experience you bring that are relevant to this opportunity.", "title": "Admissions Intern Position", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2535177%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Corlears School"}], "10010": [{"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10010", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2671010%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10010", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2670997%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10010", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2656404%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10010", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2656395%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}], "10031": [{"end": "2017-08-12", "description": "We make sure all our volunteers are recognize for their hard work.The volunteers will be welcome into a basketball family Program", "title": "Playing on the Edge Basketball Program Inc.", "zipcode": "10031", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2080109%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Playing On The Edge Basketball Program Inc"}, {"end": "2017-08-28", "description": "Google CS First Guru The Boys and Girls Club of Harlem is committed to providing access and opportunity fo r students throughout the area to reach their full potential. The Boys and Girls Club reaches students at 5 sites across Harlem. O ur mission for the CS program is to introduce kids to STEM programs at a young age . This is designed to peak an interest so students will one day enter the career field of STEM. Volunteers are crucial to the advancement of these goals. We appreciate every volunteer who comes through our door s and provide you the best skills to succeed with the organization. Should the full 2 hours work for you our sessions are 1 hour blocks. We would love to have you for just 1 hour in that window. CS first volunteer BGC Harlem is seeking a dedicated individual to teach a computer science program to students during the summer We will provide all training necessary to make sure you are confident with your skills before placing you in the classroom We understand you may have a very busy schedule, however, we would ask for 2 hours a day 1-2 days per week. College and high school students looking for volunteer hours are strongly encouraged to apply.", "title": "Google CS First Guru", "zipcode": "10031", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2676610%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Boys & Girls Club of Harlem"}], "10016": [{"end": "2017-06-17", "description": "Volunteers needed to help disabled people with shopping, running errands and reading mail to the blind. If interested call 718-606-9712 This the 3rd Saturday of every month", "title": "Be A Friend Day", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2069184%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-06-26", "description": "On Monday, June 26, 2017, Breaking Ground is having its annual Health Games at the Prince George Ballroom at 1pm. Hosted by Cigna, the event is an opportunity for Breaking Ground staff to learn more about healthy living in order to better serve our most vulnerable, fellow New Yorkers. Additionally, this is a chance for volunteers to network and engage with Breaking Ground personnel, while learning more about the work that goes into supporting the people we serve. Volunteers will arrive at noon for a briefing and assignments. Tasks will include, but are not limited to: event check-in, prize distribution, participating in demonstrations and being all-around engaging. We can only accommodate volunteer requests on a first-come-first-serve basis. If you&rsquo;d like to participate, or have any questions, do not hesitate to contact me. Also, please feel free to share this message with family and friends; the more, the merrier! Thank you for thinking of us. We look forward to hearing from you very soon.", "title": "2017 Annual Health Games with Breaking Ground", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2687855%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Breaking Ground"}, {"end": "2017-06-29", "description": "Breaking Ground is looking for eight (8) compassionate volunteers to take on the following tasks at our BBQ: 1. Food Server (Main Course) Serve food, refill food pans, making sure everything stays hot, explain any of the food items to tenants or refer to staff. 2. Food Server (Main Course) Serve food, refill food pans, making sure everything stays hot, explain any of the food items to tenants or refer to staff. 3. Food Server (Main Course) Serve food, refill food pans, making sure everything stays hot, explain any of the food items to tenants or refer to staff. 4. Food Server (Main Course) Serve food, refill food pans, making sure everything stays hot, explain any of the food items to tenants or refer to staff. 5. Dessert Table Serve dessert to tenants, pre-cut desserts and answer any dietary questions. 6. Beverage Table Pass out beverages and refill supply of beverages. 7. Condiments Take photos of tenants during the event and against the photo wall. Candid and posed photos. 8.0Dance floor initiator! / Photographer Encourage tenants to take a part of the dancing offered. Talk with tenants and create an inviting atmosphere. Built in 1904, the Prince George was once one of New York City&rsquo;s premier hotels. After many years of decline and neglect, it was rehabilitated by Breaking Ground and reopened in 1999 to provide 416 units of affordable housing for low-income and formerly homeless adults and persons living with HIV/AIDS. The Prince George is now listed on the National Register of Historic Places. In 2005, Breaking Ground completed the restoration of the building&rsquo;s 5,000-square-foot Neo-Renaissance ballroom. Working with four other non-profit groups, including Alpha Workshops, Parsons School of Design, Brooklyn High School of Preservation Arts, and YouthBuild, the Neo-Renaissance ballroom was completed as a design-build project by Beyer Blinder Belle Architects. The Prince George Ballroom is now an event venue, available for rental with proceeds supporting the expansion of Breaking Ground&rsquo;s housing development work. World Monuments Fund has located its permanent exhibition space at the entry foyer/gallery, designed and built by architecture students of the Parsons School of Design. Individualized case management services are provided on-site by Center for Urban Community Services.", "title": "Summer BBQ at the Prince George", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2683208%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Breaking Ground"}, {"end": "2017-08-04", "description": "HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2656369%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-04", "description": "The GO Project Summer Internship Powered by Echoing Green&rsquo;s Work on Purpose Program HEART + HEAD = HUSTLE The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social, and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home, and in life. Internship Description The GO Project summer internship is an opportunity for high school students to learn and develop leadership skills while working with GO Project students in academic and/or enrichment classes. During the 5-week GO Summer program, interns will be supporting instruction in one of our K -7 th grade classrooms under the guidance of a Head Teacher or Enrichment Teacher. Interns will work in small groups or one-to-one within the classroom to help students complete projects, remain focused, and build confidence as learners. Morning interns provide support in an academic classroom setting for math and literacy. Afternoon interns provide support in a particular enrichment activity, such as: art, theater, ballet, hip-hop, capoeira, yoga, and more. Interns will also be participating in rigorous daily professional development sessions where Echoing Green&rsquo;s book, Work on Purpose, will be used to help them discover and enhance their passions (HEART) and their talents (HEAD) to become change-making leaders in their community (HUSTLE). A strong social justice-centered curriculum and required readings will form the core framework for the internship. At the end of the summer, interns will have completed a portfolio with work from daily classroom and professional development sessions, co-led a professional development session, gained leadership skills, and developed a culminating Hustle project that they will showcase for other GO Project interns, staff members, board members, and community supporters. Time Commitment ¨ Attend mandatory orientation and trainings June 28 th-June 30 th, 2017 ¨ Commitment to the entire summer session is required. ¨ July 5 th-August 4 th, 2017, Monday-Friday, either the morning academic session (8:30am-2pm) or the afternoon enrichment session (12pm-5:30pm). ¨ Daily participation in professional development sessions. Location ¨ Avenues; The World School (259 Tenth Avenue, New York, NY 10001); or ¨ Grace Church School (86 Fourth Avenue, New York, NY 10003); or ¨ Grace Church High School (46 Cooper Square, New York, NY 10003) Location and internship schedule will be assigned upon hire. Responsibilities ¨ Assist teachers and work one-to-one or in small groups with students who are in need of academic intervention. ¨ Actively engage with the students, teachers, fellow interns, and other program staff. ¨ Enthusiastically participate in daily professional development sessions. ¨ Attend all sessions punctually and consistently. ¨ Co-lead one professional development session during the summer. ¨ Contribute regularly to the volunteer blog. ¨ Read all assigned materials. ¨ Meet all internship deadlines. Benefits ¨ Personal gratification through enhancing the lives of young learners. ¨ Development of leadership skills. ¨ Ongoing personal and professional development opportunities. ¨ Continual onsite support from GO Project staff. ¨ Portfolio for support with college and career selection. ¨ Completion of a service learning project which will have a larger impact on the community. ¨ Potential participation on the High School Student Leadership Council. Qualifications ¨ High school students in good academic standing (rising 10 th to recent high school grads). ¨ Commitment to and belief in all children&rsquo;s ability to succeed and thrive. ¨ Commitment to social justice through educational equity. ¨ Ability to work collaboratively on a team. ¨ Strong or emerging leadership skills. ¨ Punctuality and professionalism. Application Process ¨ Complete online application form. ¨ Submit a personal statement explaining why you want to intern with the GO Project and reflecting on a social justice issue which you consider the most important. ¨ Submit a copy of your most recent school transcript. ¨ Provide one written letter of recommendation a ( References can only be teachers, employers, school administrators, supervisors). ¨ Attend an interview as part of the initial screening process. The online internship application can be accessed on the GO Project website under Get Involved, Volunteer Opportunities, GO Getter Summer Internship www.goprojectnyc.org. If you have any questions about the internship, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org. Deadline for application submission will be Monday, May 15 th, 2017. Early applications are encouraged as space is limited.", "title": "GO Getter High School Summer Internship", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2656363%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-06-12", "description": "Join Left Forum&rsquo;s Program Development and Events team as we expand our events and activities. This volunteer opportunity merges a rigorous program of research, analysis, editorial and administration work with high-level forms of planning and outreach to noted scholars and organizers from around the world. You will gain the skill sets of program development practices, engage in individual and collective research projects, and develop verbal and intellectual acuity in helping to organize events. This position provides a great opportunity to develop small workshops and events, including our conference which annually features over 1,000 speakers including Noam Chomsky, Angela Davis, Harry Belafonte, Immortal Technique, Arundhati Roy, Naomi Klein, Michael Moore, Amy Goodman, Cornel West, Bolivian Vice President Álvaro García Linera, Frances Fox Piven, Slavoj Zizek, and Grace Lee Boggs. We&rsquo;re a small organization with a dedicated group of organizers, staff and volunteers with a passion for social justice, community organizing, and progressive change. Located in the CUNY Graduate Center, you&rsquo;ll be working in an interesting (and very relaxed) office where you&rsquo;ll interact, meet, and learn from scholars, activists, authors and artists in a rewarding intellectual political milieu. Primary Responsibilities Engage in extensive outreach to speakers, organizers, and activists through email, phone communication, and in-person meetings Assisting in brainstorming, identifying, and implementing conference/event program content Aide the development and implementation of individual and team plans in all aspects of large-scale event organizing Help administer all phases of event planning and organizing from initial contact to conference and event scheduling Help organize envisioning meetings using diverse facilitation styles Engage in workshop and panel organizing and outreach to under-represented progressive and social justice groups and individuals Background and Experience Passion for grassroots organizing and social justice Excellent research, writing and verbal communication skills Strong publicity and outreach skills Ability to prioritize and handle a variety of projects simultaneously Ability to work effectively both individually and in a team Experience with databases and websites, project management tools and related technologies - knowledge of CiviCRM and Drupal systems is a plus Interest in politics and political analysis About Volunteering We ask for 8-10+ hours a week, although any amount of volunteer time will help. Hours are flexible and can be adapted to fit your schedule. We also ask for a minimum of a three month commitment. This volunteer position is most beneficial when carried out through the entire conference cycle (which ends in mid-June). A modicum of computer skills is desired. Volunteer opportunities begin immediately. Please send a cover letter and/or resume to volunteer@leftforum.org www.leftforum.org 212-817-2003", "title": "Program and Panel Administration Volunteer Spring 2017", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2611063%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Left Forum"}, {"end": "2017-06-13", "description": "Join Left Forum&rsquo;s Publicity and Outreach team comprised of individuals who have an interest in expanding the voices of social justice and progressive communities. This volunteer opportunity merges research, analysis, editorial, and administration work with high-level forms of planning and promotional outreach to noted scholars and organizers from around the world. The volunteer will be tasked with brainstorming, implementing, and following through on new ideas to bolster conference participation and coverage. This position provides a great opportunity to develop public relations skills and allows for unique opportunities to creatively engage various teams, individuals, and organizations. We&rsquo;re a small organization with a dedicated group of organizers, staff and interns with a passion for social justice, community organizing, and progressive change. Located in the CUNY Graduate Center, you&rsquo;ll be working in an interesting (and very relaxed) office where you&rsquo;ll interact, meet, and learn from scholars, activists, authors and artists in a rewarding intellectual political milieu. Primary Responsibilities Develop and execute media outreach and publicity promotional strategies Work with publicity contacts in medium- and large-scale organizations (e.g., schools) for posting and expanding publicity materials (leaflets, brochures, posters) Update and organize our publicity/public relations and press contacts database Assist with mailings, print production, and other administrative duties Engage in outreach to scholars, organizations, under-represented progressive and social justice groups and individuals Engage in building and developing relationships with the groups and individuals mentioned above Engage former speakers, organizers, and activists in email and phone communications along with in-person meetings Help administer all phases of event planning and organizing from initial contact to conference and event scheduling Background and Experience Passion for grassroots organizing and social justice Excellent research, writing, and verbal communication skills Ability to prioritize and handle a variety of projects simultaneously Ability to work effectively both individually and in a team Confidence in interpersonal communications and outreach Coursework in communications, public relations, or marketing is helpful Proficiency with MS Office and Google Docs Interest in politics and political analysis is a plus About Volunteering We ask for 8-10+ hours a week, although any amount of volunteer time will help. Hours are flexible and can be adapted to fit your schedule. We also ask for a minimum of a three month commitment. This volunteer position is most beneficial when carried out through the entire conference cycle (which ends in mid-June). A modicum of computer skills is desired. Volunteer opportunities begin immediately. About Left Forum: Left Forum is the largest annual progressive conference in the country. Also engaged in a range of events throughout the year, the Forum brings together thousands of conference and event participants to discuss pressing local, national, and global issues; to better understand commonalities and differences, as well as alternatives to current predicaments; or to share ideas to help build social movements. Speakers at the New York City events include Noam Chomsky, Angela Davis, Harry Belafonte, Arundhati Roy, Naomi Klein, Michael Moore, Cornel West, Bolivian Vice President Álvaro García Linera, Kshama Sawant, Amy Goodman, Slavoj Žižek, Grace Lee Boggs, Marina Sitrin and Immortal Technique. Please send a cover letter and/or resume to volunteer@leftforum.org www.leftforum.org 212-817-2003", "title": "Left Forum Publicity and Outreach Volunteer Opportunity Spring 2017", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2611076%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Left Forum"}, {"end": "2018-01-13", "description": "Volunteers needed to deliver food in all boroughs. Car not necessary. If you cannot do it on a specific date we can still use your help with food delivery during thae week. Interested persons should call 718-606-9712.", "title": "Deliver Food", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2318462%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-12-31", "description": "Volunteer Buddies needed to help disabled adults. Commitment is 1 day a week for 3 hours. Volunteers will help disabled clients with shopping, running errands, and reading mail to the blind. Call 718-606-9712 for more information.", "title": "Volunteer Companions Needed", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2062578%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-12-31", "description": "Be a friend to a disabled adult help 1 day a week for 2 or 3 hours with shopping, running errands, and reading mail.", "title": "Be A Buddy to a Disabled Adult", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2025017%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-06-30", "description": "Left Forum seeks organized and tech-savvy individuals to work alongside our experienced organizers and volunteers in managing our growing administrative systems and expanding collection of special projects that are essential to the maintenance and growth of the organization. This volunteer position can be modified to fit your interests and/or schedule. Depending on the time you have to give and the areas you would be interested in helping out in, this volunteer position can focus on a specific project (i.e. managing our fundraising administrative processes and correspondence) or have a general focus that develops as new projects arise. With this rounded general focus: volunteers will spend time collaborating with others and working with various coordination teams (from PR to Event Planning) as we build upon our existing databases, administrative systems, content, and overall resources. The ideal person for this role is someone who is committed to social justice, self-motivated, comfortable taking on project-coordination, has a keen eye for detail, and has the ability to bring creative ideas into organizational and administrative processes. Experience in administrative systems is also a plus. PRIMARY RESPONSIBILITIES and PROJECT AREA EXAMPLES Engage all aspects of contact record and database management, including: maintaining/updating/deduping contact records, inputting and searching data, generating reports, etc. Physical and digital administrative file organization and maintenance Update website and social media content Assist in volunteer/intern outreach, recruitment, and application evaluation Assist in the development and maintenance of office schedules, procedures, and timelines Assist in the day to day operational concerns (from financial planning and research to cross-team coordination and long-term planning/roadmap development for the upcoming conference) Work alongside Left Forum coordinators to engage and develop new administrative projects as necessary BACKGROUND AND DESIRED EXPERIENCE Strong organizing and research skills High level of attention to detail and ability to see projects through to their completion Ability to prioritize and handle a variety of projects simultaneously Ability to work effectively both individually and in a team Strong written and verbal communication skills Generally tech savvy and a quick learner Excellent communication and research skills Experience working with Microsoft Office and Google Docs is a plus Passion for grassroots organizing and social justice ABOUT VOLUNTEERING We're a small organization with a dedicated group of staff, organizers, and volunteers, leaving lots of room for your creativity. We understand that every volunteer&rsquo;s schedule is different and would be thrilled to have you commit a couple hours a week or more (if you are able). This opportunity can begin immediately or according to your upcoming availability. Please note: this volunteer opportunity is unpaid.", "title": "Administrative Systems and Special Projects", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2543741%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Left Forum"}, {"end": "2017-12-31", "description": "Volunteers needed who can bring food to homebound adults, car is not necessary you can pick up food in Queens and deliver it to Brooklyn if interested call 718-606-9712", "title": "Deliver Food", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2485917%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-12-31", "description": "Volunteers needed to take people to doctor's appointments and other necessary errands. Car is not needed will use Acess A Ride. If interested call 718-606-9712", "title": "Volunteer needed to help people to doctor's appointments and run errands", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2131251%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}], "10014": [{"end": "2017-08-31", "description": "The National Parks Conservation Association's (NPCA) Northeast office is seeking volunteers to join the NPCA staff in tabling in Christopher Park to increase awareness regarding Stonewall National Monument. This summer, volunteers will be tabling near the Stonewall Inn in Christopher Park to answer questions and provide more information to the public about the recently designated Stonewall National Monument in Greenwich Village, the first National Park Service (NPS) site dedicated to LGBT history and the site of the 1969 uprisings that sparked the modern LGBT civil rights movement. Through the end of August, we plan to reach hundreds of visitors at tables located around Stonewall from 3-6pm on weekdays and 12-6pm on weekends. Engage with the public and help us celebrate the upcoming one-year anniversary of Stonewall's National Monument designation! Responsibilities: Talk to passers-by and share the story of Stonewall Discuss the recent designation of the Stonewall National Monument, and provide answers to basic questions Get feedback from visitors about their ideas for the future of Stonewall National Monument Maintain sign-up list for people interested in getting on the park's mailing list Direct the public to a website where they can learn more Set up and break down tabling materials Requirements: Be friendly and outgoing, ready to engage the public Interest in LGBT rights Available for 2 or 3 hour shifts Enjoy being outside Ability to lift table and chairs", "title": "Stonewall National Monument Volunteers", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2691779%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National Parks Conservation Association"}, {"end": "2017-06-25", "description": "We are looking for Volunteers to march with us down 5th Ave. for Pride March this summer! You will recieve a Love Yourself T-shirt, stickers and a button. March with us!!", "title": "Pride March", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2665210%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Love Yourself Project"}, {"end": "2017-11-18", "description": "JOIN HUDSON RIVER PARK&rsquo;S HRPGreenTeam Gain meaningful experience working with like-minded individuals looking to beautify and maintain Hudson River Park&rsquo;s picturesque waterside landscape! This volunteer program is an exciting opportunity for community members to nurture their inner green thumb alongside their neighbors while improving public green space. Members of the HRPGreenTeam will work with our seasoned horticulture staff and participate in landscape enhancement activities including planting, weeding, pruning, mulching, trimming of ornamental grasses, addition of soil amendments, cleaning of vegetation beds, and other general gardening tasks. When: One Saturday of every month from March-October; 10AM-1PM March 25th April 15th May6th June 3rd June 17th July 15th July 29th August 12th August 26th September 9th October 21st November 18th What we provide: Safety and horticulture training, tools and equipment, Hudson River Park Volunteer T-Shirt, water, snacks, FUN! Can&rsquo;t commit to all of our events? No problem! RSVP to any or all of the Green Team volunteer days. Locations and activities will vary each month, and volunteers will get to experience the Park from a whole new perspective throughout the seasons. Space is limited, so RSVP today to volunteer@fohrp.org or call for more information (347-515-2242)", "title": "HRP GreenTeam at Hudson River Park!", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2080469%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Hudson River Park Trust"}], "10034": [{"end": "2017-05-25", "description": "Volunteer with Behind the Book (www.behindthebook.org), a non-profit literacy organization that inspires New York City public school students to love reading. Through our innovative programs, accomplished authors lead workshops in high-needs pre-K-12 classrooms, where they guide students in creating their own writing and art projects based on the theme of the author's book. No experience or training is necessary to work with students. As a writing, research or art coach, you'll engage them and encourage their progress on a project. This workshop needs your support at an elementary school in Inwood. To sign up, please contact volunteer@behindthebook.org with the program code: Program 981JSR-V Date: Thursday, May 25th, 2017 Time: 11:00 AM - 12:15 PM Volunteer Role: Writing coach Overview: First-graders read Julia Sarcone-Roach&rsquo;s Subway Story to learn about subways and what happens to them when they&rsquo;re no longer useful as transportation. To help them synthesize the concept of sustainability, and appreciate how one thing can be turned into another that's equally useful, students will embark on a writing project to imagine how they might repurpose a subway car. They&rsquo;ll also create art to complement their writing. To find other Behind the Book programs around the city, visit http://www.behindthebook.org/current-volunteer-opportunities/ To join our team and receive announcements of new volunteer opportunities as they're posted, please complete our brief questionnaire at http://www.behindthebook.org/join-us/volunteer/", "title": "Writing coach for Inwood, NYC public school literacy workshop", "zipcode": "10034", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2686593%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Behind the Book"}]}