{"10004": [{"end": "2017-12-18", "description": "Museum Marketing Internship - Fall 2017 Hours: Negotiable - Mondays, Thursdays, or Fridays Application Deadline: September 8, 2017 Fraunces Tavern Museum&rsquo;s mission is to educate the public and create genuine appreciation for New York City history as it relates to Colonial America, the Revolutionary War, and the Early Republic. The Museum was founded in 1907 by Sons of the Revolution in the State of New York, Inc. Housed in historic Fraunces Tavern, the permanent collection focuses on 18th and 19th century buildings, period rooms, prints, paintings, sculpture, decorative arts, and manuscripts relating to or reflecting aspects of early American culture and history. Also included in the collection are items associated with the history of the Sons of the Revolution of the State of New York. The Marketing Intern will spend the semester under the guidance of the Marketing Coordinator working to develop and execute new communication and marketing strategies to increase the Museum&rsquo;s effectiveness in engaging with visitors and members of the media. This is also a fantastic opportunity to play a role in the Museum&rsquo;s re-branding process, and help build and grow a newly established marketing department in a small non-profit institution. The Intern&rsquo;s duties will include: Assist with routine website updates and maintenance Help develop content for the Museum&rsquo;s website and social media channels Help design and plan digital and print collateral Perform research related to marketing and PR opportunities on both a local and national level Perform research related to digital marketing initiatives: social, email, and paid search Carry out maintenance and building of email lists and databases Maintain press coverage database and compile press clippings book Copyediting across multiple platforms and various collateral Qualifications: Must be recent college grad or currently enrolled in undergraduate or graduate studies in Communications, Marketing, Public Relations, or a related field. A solid Early American, Colonial American, Revolutionary War, or New York City history a plus, but not required. Experience working with e-communications, web-publishing (SquareSpace) helpful but not required Excellent written skills and attention to detail If interested please send cover letter and resume to Amy Kennard: marketing@frauncestavernmuseum.org. An in-person interview is required. *NO PHONE CALLS PLEASE.", "title": "Museum Marketing Internship", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2758993%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Fraunces Tavern Museum"}, {"end": "2017-11-30", "description": "Be part of the movement of college students helping high school students get into and graduate from college! As a College Access Coach, you will coach and mentor a small group of high school students by providing FREE SAT preparation and college admissions counseling to students who do not have access to college preparation support. The commitment includes: One evening per week from late-September through late-November (from between 5:30-8:30pm) Locations throughout NYC in Manhattan, Queens, and the Bronx Training session prior to start of program to prepare you to teach SAT material and College Choice curriculum You'll gain: Excellent hands-on education field and non-profit experience Training and professional development that will make your resume stand out Opportunity to impact students on a personal and systemic level! Questions? Contact zsmolen@letsgetready.org to learn more and apply!", "title": "Calling all college students who are passionate about education & mentorship!", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2549077%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Let's Get Ready"}, {"end": "2018-06-29", "description": "Blue Engine partners with school leaders, teachers, and Blue Engine Teaching Apprentices (BETAs) to create a powerful classroom environment for students in which teachers and BETAs teach together as a team, resulting in dramatic academic gains in gateway subjects. Blue Engine recruits, trains, and matches a team of three BETAs with a teacher in ELA or algebra in 8th, 9th, or 10th grades (where Blue Engine currently focuses). More adults in the classroom reduces the teacher to student ratio from about 30:1 to 6:1 enabling teachers to build authentic relationships with students, provides significantly more instructional hours during class and before/after school, and differentiates, individualizes, and personalizes instruction. The teacher-BETA collaboration enables daily student-centered reflection and learning that improves teacher practice. No student goes unseen or heard. At the same time, Blue Engine's hybrid model helps a diverse, local wave of educators enter the teaching profession through an apprenticeship (as a BETA and AmeriCorps member), teaching alongside a team for one or two years with the opportunity to earn their teaching credential in their second year through Relay Graduate School of Education. Blue Engine is more than an \\\"equal opportunity employer.\\\" We acknowledge the roles we play as educators and leaders in the very tangible systems of oppression and racism that exist in our communities and classrooms and strive to be an actively anti-racist organization. We believe that by assembling diverse and inclusive teams, we can build alliances that fundamentally disrupt and dismantle these systems at their root. Desired Skills Is curious about an apprenticeship model to implement a team teaching approach within public middle and high school classrooms Is motivated by building relationships and working on a team Is interested in collaborating with others and learning & developing through feedback Is flexible and can adapt to the often fast paced and changing school environment Qualifications Bachelor&rsquo;s Degree. You must have received your bachelor&rsquo;s degree from an accredited college or university by the first day of Blue Engine&rsquo;s summer training institute in August. 2.50 Minimum GPA (undergrad). You must have a cumulative 2.50 GPA on a 4.00 scale from an accredited college or university upon graduation. US Citizenship or National / Permanent Resident Status. BETAs must be cleared through background and security checks prior to beginning their year of service. Interest in being a teacher and prior education or AmeriCorps experience is not required to become a BETA. Responsibilities BETAs devote 1-2 years of service (as AmeriCorps members) in partnership with certified Department of Education teachers in critical gateway skills; high school Algebra and English Language Arts. BETAs complete four weeks of training in August and receive consistent support throughout the school year. While they are not the lead teacher in the classroom, BETAs are responsible for many of the same things, including attending meetings, preparing for lessons, tutoring, grading, attending school events, and making parent phone calls. Upon completing the year of service, BETAs have the option to stay for a second year as a Team Coordinator, where they manage a team of BETAs, and can choose to enroll in Blue Engine&rsquo;s teacher residency program at Relay Graduate School of Education to become a certified, full-time teacher. Apply Now at http://application.blueengine.org/", "title": "Blue Engine Teaching Apprentice", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2745626%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Blue Engine"}, {"end": "2018-06-30", "description": "The Board of Engineers (BoE) is a passionate group of volunteers that supports Blue Engine&rsquo;s mission and work through program-related initiatives, and fundraising and awareness-building campaigns. Committed to facilitating in-classroom instruction that taps the infinite potential of all students, board members give of their time, expertise and resources to ensure the sustainability of Blue Engine&rsquo;s team teaching model. Each fiscal year (July 1 st - June 30 th), the board develops and executes a robust calendar of events/campaigns to reach goals established in partnership with Blue Engine staff. The BoE seeks energetic recruits to bring committee activities to life! The board employs three committees to support Blue Engine's work in classrooms: Program Initiatives Committee - plans a series of professional development and networking activites for Blue Engine teaching apprentices. Fundraising Committee - plans fund/friend-raising events to expand Blue Engine's supporter network and build greater brand awareness. Corporate Engagement Committee - develops relationships with potential corporate funders and conceptualizes engagement touch points for current funders. Committee members also work toward an individual fundraising goal of $1,300: the per student cost of Blue Engine's work in classrooms. To join the Board of Engineers, please click the \\\"I want to help\\\" button above or visit www.blueengine.org/boe-application to complete our online application. To learn more about this opportunity and Blue Engine, please email Morolake Odeleye, Blue Engine Development Manager, at morolake@blueengine.org.", "title": "Join the Board of Engineers! Help us unlock student potential.", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2644363%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Blue Engine"}], "10007": [{"end": "2017-09-11", "description": "Volunteers for the NYC Votes Get Out the Vote Phone Bank will call voters and deliver a voting themed message and provide information about voting. There will be a training at the beginning of the session. Phones, call lists and scripts will be provided. This initiative in nonpartisan.", "title": "NYC Votes Get Out The Vote Phone Bank", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2499959%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "New York Campaign Finance Board NYC Votes"}, {"end": "2017-09-23", "description": "Volunteer to register new voters at city shelters in partnership with the Department of Homeless Services.NYC Votes will be visiting shelters in City Council districts with open races around the city to register residents to vote in the November 2017 citywide election. We need you to make sure every eligible voter can make it to the polls! There will be a required training for this initiative on Thursday, September 21 at 6 pm at the CFB office at 100 Church Street, 12th floor.", "title": "Day of Action", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2761360%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "New York Campaign Finance Board NYC Votes"}, {"end": "2017-12-15", "description": "Day One partners with New York City youth to end dating abuse and intimate partner violence through community education, counseling, legal advocacy and youth leadership development. We use an empowerment model that invests young people in maintaining safe relationships for themselves and their peers. Day One is seeking an undergraduate or graduate student, or a community member, to participate in a part-time, unpaid Development and Event volunteer opportunity from August until December 2017. The volunteer's primary responsibilities are: Assist in planning related to Day One events Organize sponsorship opportunities, auction solicitation and coordinating a database of guests and volunteers. Generate communications with donors (including an electronic newsletter, periodic written appeals and thank you letters), Manage educational material requests HOW TO APPLY Please submit a cover letter and resume to Namasha Schelling, Program and Communications Coordinator, by email to nschelling@dayoneny.org.", "title": "Development and Event Volunteer", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715713%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Day One"}], "10001": [{"end": "2017-09-10", "description": "Thank you for your interest in volunteering for the only urban 100-mile bike ride in the country: The NYC Century. Whether you want to ride, set up, help out at a local park or guide bicyclists through tricky intersections, we have a way for you to pitch in! Transportation Alternatives staff and the 7,000 riders of the NYC Century are grateful for your energy and your time. Volunteer Opportunities Start/Finish Sites We launch from Central Park and Prospect Park, and we need folks to set up, register riders, guide folks in and out of the parks, pass out schwag, register volunteers, and celebrate our valiant cyclists as they complete their tour. Rest Stops Help us do EVERYTHING! From hanging signs to making peanut butter sandwiches, rest area volunteers are the glue that makes our rest areas so great. At rest areas you will help prep and serve food and drinks to our riders --- and cheer them on of course! Groups are invited to sign up for one or more shifts. We have rest stops in four boroughs -- this could be your opportunity to travel to a part of the city you've never been or find the one in your neighbordhood! Ride Marshals You are an experienced cyclist with the ability to fix flats and handle other minor mechanical breakdowns. Please bring your bike and be ready to ride the entire course. Help riders navigate the route, negotiate tricky intersections, fix flats and find their way to rest areas and bike repair stations. Stationary Marshals Guide riders through potentially tricky areas of the route. Stationary marshals do not need any prior experience marshalling but should have access to a bike and be willing to ride it to your marshalling station, which may be a substantial distance from public transit.", "title": "Support Safe Streets: NYC Century Bike Tour", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2439278%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Transportation Alternatives"}, {"end": "2017-09-20", "description": "WE Day is returning to New York, and we are looking for dynamic and engaging volunteers to help make this unique event possible! WE Day is the celebration of the WE Movement, an ocean of people coming together to create impact. Watch the WE Day video: https://www.youtube.com/watch?v=eqtzsIEn-lg Why join us as a volunteer? Meet new people Earn volunteer hours Gain skills and experience in the realm of live events Witness inspirational speakers and performers Be a part of an amazing movement empowering young people to make a difference There are opportunities for youth, adults, families, friends and co-workers Event Details: WE Day New York - Wednesday, September 20, 2017, 7:00 am - 2:30 pm, The Theater at Madison Square Garden Learn More: For more information on the roles available or to register, please visit WE.org/volunteer. You can also contact our amazing team at wedayvolunteers@we.org.", "title": "Volunteer at WE Day New York - Make a difference and inspire!", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2751746%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Free The Children"}, {"end": "2017-12-31", "description": "Intern with Free The Textbooks to Gain Experience and Lower the Cost of Textbooks For Millions of Students! Join Us * Help us build the movement to lower the cost of college textbooks. * Become a member of our dynamic and creative international team. * Assume real responsibility. No coffee runs here! Be a leader among those who share your commitment to helping students. * We have internships, volunteer opportunities, and campus rep positions. About Free The Textbooks The skyrocketing cost of college textbooks undermines the education and lives of millions of students. Colleges and universities should change ten policies, which would save students billions of dollars a year. Free the Textbooks will marshall the voices and political clout of students and those who care about them to make that happen. Where/When * Free The Textbooks is an initiative of www.ChangingThePresent.org, a 501(c)(3) nonprofit. * Work in our office, remotely, or on your campus. We are conveniently located at 7th Avenue and 33 Street, across from Penn Station in Manhattan. * School year or summer. Unpaid We provide a great opportunity to gain experience and make a meaningful impact, but this is an unpaid position. Learn More and Apply Now * Read more about our program on our temporary, introductory website: http://www.freethetextbooks.org/ * Please send a resume and short cover letter about your interests and availability to: o join [AT] ChangingThePresent [DOT] org.", "title": "Intern with Free The Textbooks to Gain Experience and Lower the Cost of Textbooks For Millions of St", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2756705%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Changing The Present"}, {"end": "2017-11-30", "description": "Institute for Immigrant Concerns is a non-profit organization. We provide support to recent immigrants to the New York City areas, mostly in the form of ESL Classes. Institute for Immigrant Concerns needs a PC Technology consultant to come in on a short term basis for the following purposes: - Review current system, which consists of two Windows desktop PCs and two printers. The system is a legacy system and we are currently having performance issues. - Recommend and implement short term upgrades to improve performance, reliability and security of the current system. - Develop a proposal and cost estimate for a replacement of the current system. We require that the candidate has both training and experience in supporting a small Windows PC based office system. The hours for this job are flexible and can be scheduled based upon candidate and IIC staff schedules. The work will take place within a Mon-Thursday 10 am - 3:30 pm office schedule. This position is an unpaid volunteer position. We will provide recommendations to a cooperative volunteer who does a good job in helping us to improve our technology.", "title": "Technology PC Analyst - Review System and Recommend Upgrades", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2749243%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-11-30", "description": "About the Institute The Institute for Immigrant Concerns (http://http://instituteforimmigrantconcerns.com/) is committed to equipping immigrant communities city-wide with English skills, computer training, job readiness, and referalls for social services. The Institute empowers immigrant families and communities in their quest for social and economic independence. To reach immigrants the Institute operates across New York City and frequently collaborates with other community groups. Our staff is as diverse as our clients and draws on talented individuals to create a powerful, sustainable impact in America's newest immigrants. Job Description The Bilingual Administrative Assistant is essential to maintaing an efficient office environment in support of Institute programs, staff, and volunteers. This position will be responsible for general office administration, organizing office resources, coordination of program activities, and program management support. This is an ideal position for those seeking administrative experience at a busy Manhattan non-profit. Though this internship is primarily administrative, it presents an opportunity to get an introduction to non-profit management. Requirements: Commitment to work 3 months minimum Bilingual oral and written skills, preferably Spanish but other languages welcome Excellent written and oral communication Knowledge of foreign language Proficiency in MS Office and Excel Ability to work independently and alongside a team of staff and volunteers with a passion for immigrant empowerment Ability to work in a multi-cultural environment This internship is unpaid, but college credit may be available.", "title": "Bilingual Adminsitrative Assistant(Russian)", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1854257%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-12-31", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in Korean. Experience with immigrants a plus. Duties will include: Intake amd registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organised lists of pertinent student information.", "title": "Korean Speaking Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2754002%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-12-31", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in Japanese. Experience with immigrants a plus. Duties will include: Intake amd registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organised lists of pertinent student information.", "title": "Japanese Speaking Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2753999%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-12-31", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in Chinese. Experience with immigrants a plus. Duties will include: Intake and registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organized lists of pertinent student information. Requirements for the position include: Bilingual in Chinese Familiarity with Microsoft Office Suite (Word, Excel etc.) Attention to detail This is a great opportunity for new graduates who want to get some experience in the non-profit management sector. Lots of leeway for new ideas and out of the box thinking! Could develop into paid position for the right person. Start time is ASAP.", "title": "Chinese Speaking, Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2753951%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-10-21", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO Schoolis a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Chinese (both Mandarin and Cantonese) in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Chinese speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak both Mandarin and Cantonese is preferred. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Chinese Translators Needed!", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770787%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project Spanish Translator (Saturday Volunteer) GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO Schoolis a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Spanish in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Spanish speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak Spanish. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Spanish Translator Needed!", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770764%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-11-30", "description": "Institute for Immigrant Concerns, a not-for-profit ESOL school for adult immigrants and refugees, started in 1997, is looking for ESOL instructors. Must have previous English teaching experience (whether domestic or abroad), certificate not essential but a plus. Our students are all motivated and studious adults. Our program is more intellectual than the usual as well, leaving more room form teachers to be creative and introduce own ideas into the curriculum. We have a substancial emphasis on cross-cultural awareness. This is the ideal position for retired teachers or teachers completing a certificate program.", "title": "ESOL Teachers for Adult Immigrants", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2003398%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-11-30", "description": "ABOUT THE INSTITUTE Launched in 1997, the mission of the Institute for Immigrant Concerns is to equip a citywide population of adult immigrants and refugees of all nationalities with ESOL skills, computer training, job readiness, and referrals for social services thus empowering them to succeed in their quest for social and economic independence. Since its inception the Institute has provided services to 8,000 immigrants, refugees and asylees from 112 countries. Institute students have included an economist from Guinea, a hotel housekeeper from Columbia, a yak herder from Tibet, a butcher from Peru, a sailor from Burma, and a Togolese journalist. The common ground for our students is their incredible motivation and the support they give to each other as they struggle to become self-sufficient. INTERNSHIP SUMMARY The Institute is seeking a well-organized, motivated college/graduate student or recent graduate who is eager to gain hands-on grant writing experience at a busy Manhattan non-profit. Intern will work directly with the Institute Director to draft and edit grant proposals, develop proposals for fundraising campaigns, research potential donors and sponsors, and assist with the development and implementation of special events. QUALIFICATIONS Current college/graduate student or recent graduate Strong writing and research skills Highly organized with attention to detail Excellent interpersonal communication skills as well as ability to work independently Proficient in MS Office Knowledge of foreign language(s) a plus Note: This internship is unpaid; school credit may be available depending on your institution. Interns are expected to work 15 hours a week. Position open until filled.", "title": "Fundraising and Development Intern", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1789209%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-11-30", "description": "Institute for Immigrant Concerns, a not-for-profit ESOL school for adult immigrants and refugees, started in 1997, is looking for ESOL instructors. Must have previous English teaching experience (whether domestic or abroad), certificate strongly preferred. Our students are all motivated and studious adults. Our program is more intellectual than the usual as well, leaving more room for the teachers to introduce their own ideas into the curriculum. The education director welcomes his teachers' opinions. We have a substantial emphasis on cross cultural awareness. This is the ideal position for retired teachers or students wanting to jumpstart their career in ESL teaching (we've had a fair bit of both in the past!). Many of our students came to this country to escape persecution or harm in their original country and are trying to get a foothold in the US through our jobs program. They want to become citizens. We are looking for ESL instructors who can teach Tuesdays and Thursdays from 6.00pm - 8.00pm. Please send a resume and cover letter to Donna Kelsh at dkelsh77@gmail.com and Mark Brik at mbrik13@gmail.com", "title": "Assist ESOL Teachers", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1720286%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-12-31", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in French. Experience with immigrants a plus. Duties will include: Intake amd registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organised lists of pertinent student information.", "title": "French Speaking Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1982724%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-12-31", "description": "ESOL School for immigrants and refugees, educating since 1997. is looking for a dynamic and efficient marketing assistant. This is the ideal position for professionals and students wanting to jumpstart their career in marketing. Duties will include: ? Assist with all marketing communications to the student network as required. ? Assist in developing, implementing and monitoring of a social network program. ? Assist in coordinating of the annual, regional, zone and marketing meetings. This includes bookings, invitations, and other duties as required. ? Assist in communicating campaign parameters and details to students ? Assist with the design of monthly flyers, business cards, yellow page ads, and miscellaneous design projects as required. ? Other duties as assigned This is a great opportunity for new graduates who want to get some experience in the non-profit management sector. Lots of leeway for new ideas and out of the box thinking!", "title": "Marketing Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1936547%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-12-31", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in Spanish. Experience with immigrants a plus. Duties will include: Intake and registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organized lists of pertinent student information. Requirements for the position include: Bilingual in Spanish Familiarity with Microsoft Office Suite (Word, Excel etc.) Attention to detail This is a great opportunity for new graduates who want to get some experience in the non-profit management sector. Lots of leeway for new ideas and out of the box thinking! Could develop into paid position for the right person. Start time is ASAP.", "title": "Spanish Speaking, Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1924612%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2018-12-31", "description": "Non-Profit Management/Video Internship for Award-Winning Non-Profit Theater and Educational institution in NYC! This is an intensive Leadership Training Program in non-profit business management. Interns receive hands-on training as a management assistant. Students and professionals skilled in video will assist in videography, video production and editing at our award-winning theater arts and community service organization. We seek intern candidates who are leaders, passionate about making an impact in the community, and possess skills in video production and editing. Are you a professional, detail-oriented person who is positive and curious, with a desire to learn and engage in a process? If yes, then this opportunity is a great fit for you! Interns' will work under the direction of a project manager on a combination of logging, editing, and production of on-going video projects that depend on the intern's skill level. We seek applicants with training and experience logging footage, editing in Adobe Premiere, http streaming, digital shooting, lighting, sound, videography, web design and development. Interns consistently report they gain tremendously from filming and reviewing footage of ATW classes and workshops and have benefited as if they had actually taken creative classes themselves. The Actors Theatre Workshop is an award-winning non-profit theater, educational institution and community center in NYC founded by award-winning actor, director, writer and producer, Thurman E. Scott, an acclaimed master teacher of acting and creative process with over 30 years of professional experience. Stella Adler declared, \\\"Thurman E. Scott is the inheritor of the Stanislavsky legacy and of my legacy. His work advances acting technique for the next generation.\\\" Internships are available for 4 to 18 months in duration and are 20 - 40 hrs per week. This is a non-paid internship program. Application instructions: Go to http://www.actorstheatreworkshop.com/get-involved/internship-program/ to fill out an online application for this position!", "title": "Video Internship for Non-Profit NYC Theater/Education Center!", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2695382%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Actors Theatre Workshop"}], "10002": [{"end": "2017-12-16", "description": "Operations Coordinator The Operations Associate helps ensure that the Vietnam Heritage Center&rsquo;s Vietnamese School runs smoothly by assisting with school-wide logistics, including registration support, class scheduling, and communications throughout the semester. While this position does not require volunteers to attend classes, VHC would be pleased to offer you free tuition for one semester in return for your help. QUALIFICATIONS Must have advanced fluency in English. Familiarity with Vietnamese preferred but not required. Volunteers should be organized and detail-oriented with regular access to email and the Internet. Must be familiar with or willing to learn how to use online platforms such as SquareSpace, G Suite, and MailChimp. REQUIRED COMMITMENT Must be available for at least 1 semester of classes (12 weeks) for 1-2 hours per week. Most work can be done remotely at home, but there may be instances where volunteers may have to come to the Vietnamese School to assist with in-class logistics.", "title": "Volunteer Operations Coordinator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768776%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "VIETNAM HERITAGE CENTER INC"}, {"end": "2017-12-16", "description": "Vietnamese Teaching Assistant Teaching Assistants at the Vietnam Heritage Center&rsquo;s Vietnamese School help teachers with class logistics such as attendance, homework, and proper note-taking. They also support students by answering questions and giving feedback during class. This is a unique opportunity to help others and engage with a diverse group of students while further honing your own Vietnamese teaching skills in class. QUALIFICATIONS Must have advanced fluency in English and fluency in Vietnamese is preferred, along with reliable transportation to school on a weekly basis. Prior experience with teaching preferred but not required. REQUIRED COMMITMENT Must be able to assist with classes 2 hours/week for 12 weeks in the spring or fall. Additional time may be required to support teachers with logistics and lesson plans.", "title": "Volunteer Teaching Assistant", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768771%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "VIETNAM HERITAGE CENTER INC"}, {"end": "2017-12-16", "description": "Teacher Teachers at the Vietnam Heritage Center&rsquo;s Vietnamese School lead Vietnamese classes at all levels, helping students develop skills in reading, writing, listening, and speaking. They also educate students on Vietnamese culture and customs. As a teacher, you&rsquo;ll have the opportunity to help others, share your knowledge, and engage with a diverse group of students and individuals. QUALIFICATIONS Must have advanced fluency in English and Vietnamese and reliable means of transportation to school on a weekly basis. Prior experience with teaching preferred but not required. REQUIRED COMMITMENT Must be able to teach 2 hours/week for 12 weeks in the spring or fall. Additional time will also be required to develop lesson plans for students.", "title": "Volunteer Teacher", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768764%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "VIETNAM HERITAGE CENTER INC"}, {"end": "2018-05-15", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS140 Nathan Straus, Manhattan)", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2449371%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}, {"end": "2018-06-16", "description": "Cabrini Immigrant Services of NYC, Inc. (CIS-NYC) is currently looking for passionate and experienced volunteer ESL teachers for the 2017-18 academic year. If you love teaching, have patience and a sense of humor, come join our wonderful cadre of teachers and adult learners. Classes meet twice a week for 2 hours starting the week of Sept. 11. Days and times are flexible. Cabrini Immigrant Services of NYC, Inc. (CIS-NYC) is a multi-service community and faith-based non-profit that provides a broad range of culturally and linguistically appropriate services to immigrants, refugees, asylees, and their families. CIS-NYC meets the unique needs of diverse immigrant populations through supportive services and concrete assistance which encourage economic independence and social empowerment, foster individual growth and development, and promote self-determination for immigrant families, children and youth.", "title": "VOLUNTEER ESL TEACHER", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2769007%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "CABRINI IMMIGRANT SERVICES OF NEW YORK CITY INC"}, {"end": "2018-04-30", "description": "Reading Empowers was formed with the mission of improving literacy among young children. Our goal is to instill an interest in reading, at a young age, and our hope is that this will develop into a lifelong love and passion. This upcoming school semester (Fall 2017), we will be hosting Saturday morning reading sessions at P.S. 1 and P.S. 124, both in Lower Manhattan. These sessions are twice a month, generally, every other Saturday from 10:00AM - 12:30PM. Each session is about two hours. Volunteers and students are broken up into groups, with each group consisting of 2-3 volunteers and 6-10 students. The sessions consist of reading, writing, and an arts and crafts activity with the students. We are looking for volunteers to join us on our mission! We will be reading to students in 1st, 2nd, and 3rd Grade. P.S. 1 and P.S. 124 are both located in Chinatown at 8 Henry Street and 40 Division Street, repsectively, in LES Manhattan. Below are the dates for the Fall 2017 and Spring 2018 dates are not finalized yet but will share the dates once available. Reading Empowers is a non-profit organization in the state of New York and recognized as a tax-exempt 501(c)(3) organization by the IRS. Please feel free to visit our website http://www.readingempowers.org/ Requirements Volunteers must be 18 or older New volunteers must pass the background check with our vendor, Go Pass. There is a $60 background check fee that will be reimbursed to you after you volunteer with us for 60% of all the sessions in one full school year ~ 8-9 sessions We are looking for consistent commitment for this school year, which is roughly two Saturdays per month To get involved please fill out our online application at: www.readingempowers.org/application", "title": "Read to 1st, 2nd or 3rd Graders in a public school in Lower Manhattan!", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1596852%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Empowers"}, {"end": "2017-12-25", "description": "Global Potential (GP) is a non-profit organization founded in 2007. We provides urban youth from low-income communities with the skills and perspective that enable them to effect positive change in their lives, communities, and the global community, through engagement in leadership training, social entrepreneurship, international cultural exchange and service learning. GP vision is that as youth develop, communities develop. This position is responsible for coordinating providing support to youth participants on their projects by ensuring that deadlines are met. This position will also be responsible for managing Facebook, Linkedin, Instagram, youtube channel and media festival submissions, cultivating partnerships with other youth media organizations, and help to identify funding opportunities. Responsibilities/ QUALIFICATIONS (Who we are looking for) Helping to facilitate media workshops to our youth participants Documenting GP workshops and activities Working in collaboration with other media program staff, including media curator and video editors. Managing and developing social media like: Facebook, Linkedin, Instagram, GP's youtube channel Cultivating our relationships with current and potential media partners, such as Adobe, Tribeca Institute, Reel Works, Manhattan Neighborhood Network, and others Skills in Adobe, Final Cut a plus", "title": "Social Media Coordinator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2721834%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}, {"end": "2017-09-01", "description": "We are seeking a highly motivated, focused, outgoing individual to coordinate our fundraising efforts. The Fundraising Coordinator will be integral in sustaining this growth, making a significant contribution to the organization and the youth we serve. As the coordinator of fundraising events you will play an integral role in ensuring Global Potential's short and long-term fundraising goals. This is an opportunity for a motivated self-starter interested in helping to implement our fundraising strategy over the course of the next year. You will be spearheading fundraising efforts and delegating tasks to other staff while receiving support and guidance from the Director of Operations. Responsibilities include: Facilitating fundraising campaigns including donor appeals Assisting in the production of fundraising and promotional materials Managing organization&rsquo;s member and donor database Opportunities include: Providing creative fundraising ideas Attending events in the community to engage new members and donors Becoming familiar with the inner workings of a non-profit organization This is an unpaid internship. Qualifications (Who we are looking for): Self-motivated, detail-oriented, enthusiastic personality Ability to work independently and creatively, as well as part of a team Solid writing, communication, organizational and time management skills Strong computer skills (PC or MAC): Microsoft Office, Internet Knowledge of Salesforce a plus Spanish Language a plus Education: College or Master level Other work requirements: Passionate about underserved youth and commitment to GP mission, interest in working with nonprofits or in international development.", "title": "Fundraising Coordinator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2685805%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}, {"end": "2018-05-15", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS 188 The Island School, Manhattan)", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2449380%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}, {"end": "2017-08-31", "description": "Global Potential (GP) transforms youth from underserved communities through education, service learning and cultural exchange into globally competitive leaders of positive change in their lives and communities. GP is an 18-month transformative out-of-school time and summer program based in New York City. The GP program includes 14.5 months of workshops locally and 1.5 months of international service learning and cultural exchange in the Dominican Republic, Haiti, and Nicaragua. Global Potential seeks energetic facilitators to help us conduct preparatory workshops and evaluations with youth and community members Facilitate participatory dialogue between GP partner communities, GP youth councils, local leaders (international), partner high schools (local), NGOs (IDDI, CEDESO, Peace Corps, World Vision, Municipal Government), GP youth, and the GP staff team to ensure empowerment of the community and equal and respectful power dynamic Attend staff meetings, conferences, external meetings, professional development trainings, conference calls, webinars, and networking events as appropriate Provide and receive feedback to/from supervisors locally and internationally, report back to supervisors on a weekly basis on all tasks Job type: Volunteer Job location: Nicaragua, the Dominican Republic, Haiti Volunteer Fees: All expenses covered by Global Potential (including flight and accomodations & meals) Job length: 4 Months Start date - End date: May 1-August 31, 2017 Commitment hours: 10-15 hours per week in May and June; full time+ from July 1st to August 18th (approximate dates) with 2 days/1 night off (contingent upon coordination with your team and community); 10-15 hours per week after trip to deliver all paperwork. Position reports to: Chief Program Officer or International Program Director and Field Staff Director Specific responsibilities: Guide workshops, youth development, evaluation, and needs and impact assessments Work closely with GP youth participants to provide support for youths&rsquo; personal development through weekly individual and group advisory/evaluation meetings Work together as team members and role models with GP youth participants and GP&rsquo;s Youth Councils on infrastructure and social development projects in GP partner communities Work closely with GP Youth Councils in administering evaluation and needs and impact assessments, organizing community service events, workshops, and conducting site visits Collaborate in the planning and implementation of the GP Youth Leadership Conference Other Work Requirements: Adhere to GP&rsquo;s rules and procedures, including time and duty commitments; commitment to learning new technologies and social media platforms; and maintenance of GP&rsquo;s cloud-based office spaces. Be open-minded, adaptable, flexible, culturally sensitive, professional, respectful, tolerant, and work to build solidarity with the communities we serve. Ensure a SAFE and EDUCATIONAL experience for staff, youth, and community members. Be an integral part of the team and the daily life of the youth participants. Skills and Knowledge Requirements: Creation and management of groups, teaching and/or facilitating group discussions. Experience working with youth and communities that are historically marginalized. Ability to be both a leader and a compatriot, an inspiration and a guide to youth participants. Experience living in challenging conditions and rural areas internationally. Adept interpersonal skills; strength in developing and maintaining relationships with youth, families, community members, GP staff, and partnering agencies. Self-motivated and capable of working independently as well as with a team. Bi-lingual (Spanish or Haitian Creole) speakers with experience working and living in developing countries are especially encouraged to apply. We are especially interested in individuals who would like to remain involved after the summer. Education/Field: Graduate degree or in process preferred. College degree required (unless significant equivalent experience can be demonstrated) Appropriate fields include: Social Work, Education, International Development, Counseling Psychology, Anthropology, Media, Arts, Social Entrepreneurship, Political Science, Health/Fitness/Outdoors. Certification in First Aid/CPR preferred What we can offer you: An opportunity to be exposed to the workings of a nonprofit grassroots enterprise with a vast network of innovative professionals. Exposure and access to the NGO and international development community. Training in an organization that is fast-paced, innovative, collaborative and creative. Impact: Youth and Volunteers who participate in GP demonstrate increased: Skills in advocacy, activism, fundraising, and social entrepreneurship. Self-esteem, confidence, and sense of purpose. Belief that challenges lead to opportunities. Academic completion rates. Unprecedented professional experience in youth and international development. Interested candidates should immediately send cover letter and resume to hr@global-potential.org. Indicate \\\"International Youth Development Facilitator\\\" in the subject line.", "title": "Summer Abroad: Youth Development Facilitator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2665011%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}], "10003": [{"end": "2017-09-13", "description": "More Art a NYC based public arts non-profit is looking for volunteers to help us premiere an exciting new film series \\\"NYSFERATU\\\" in public parks and community venues throughout Manhattan, Brooklyn, and Queens. Learn more about the project here: https://www.nysferatu.org/ Volunteers should be interested in engaging with event guests and encouraging them to learn more about and get involved with our public art projects. Those with a passion for visual art, film, and social media are highly encouraged to connect with us. Volunteering is an awesome way to get involved with More Art&rsquo;s art projects that take place in public spaces across NYC. Bilingual volunteers welcome! We are currently looking for volunteers for the following events locations and dates: AUGUST 14 Pier 63 at Hudson River Park, Manhattan AUGUST 17 Queens Museum Flushing Meadows-Corona Park SEPTEMBER 7 Brooklyn Bridge Park, Brooklyn SEPTEMBER 9 Sunset Park, Brooklyn SEPTEMBER 14 Central Park at Mineral Springs, Manhattan SEPTEMBER 19 Italian Cultural Institute Interested candidates should send a brief letter of interest and a resume to: info@moreart.org. Please indicate at which location(s) you are interested in volunteering.", "title": "Volunteers for Public Film Screenings", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2747991%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "More Art, Inc."}, {"end": "2018-04-20", "description": "GO Project Chinese Translator (Weekday Volunteer) GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO School is a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Chinese (both Cantonese and Mandarin) in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Weekday Complete written translation of documents for the GO Project. Support with family outreach as needed. Provide interpretation for our families via phone or in office meetings, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. 2017-2018 Schedule This position would require a commitment of 8 weekday hours (either 1 full day or two half days) between Tuesday to Friday. You would report to our main office 50 Cooper Square 3 rd Floor, New York, NY 10003. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak Chinese (both Cantonese and Mandarin preferred) Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Weekday Chinese Translator Needed!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2752419%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO Schoolis a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Chinese (both Mandarin and Cantonese) in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Chinese speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak both Mandarin and Cantonese is preferred. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Chinese Translators Needed!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770798%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO Schoolis a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Chinese (both Mandarin and Cantonese) in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Chinese speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak both Mandarin and Cantonese is preferred. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Chinese Translators Needed!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770786%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project Spanish Translator (Saturday Volunteer) GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO Schoolis a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Spanish in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Spanish speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak Spanish. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Spanish Translator Needed!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770770%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project Spanish Translator (Saturday Volunteer) GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO Schoolis a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Spanish in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Spanish speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak Spanish. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Spanish Translator Needed!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770741%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Tutoring: How YOU Can Help During the GO School Saturday program, a professional teacher models a lesson, activity or project to a classroom of students. Volunteer tutors continue to work with small groups of (2) to (4) students on the lesson providing individualized attention which allows the students to thrive. Tutor Responsibilities Tutor small group of students in grades 1 st-8 th who are in need of academic intervention under Head Teacher&rsquo;s guidance Punctual and consistent attendance; no more than 3 absences permitted per session. (Session 1: Oct-Dec, Session 2: Jan-April) Actively and enthusiastically participate - supporting instruction and engagement Help prepare, record and put away classroom materials Ongoing communication with Head Teacher regarding children&rsquo;s progress &/or concerns, and with the Director of Community Engagement regarding overall volunteer experience. Time Commitment Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 14 Saturdays 9am - 12:45 pm Attend mandatory orientation and training prior to start of session. *You can choose to be a Committed Volunteer to come each Saturday with 3 allowed absences per session, or a Floater Volunteer to come on the Saturdays that you are available. GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations You can choose to tutor our students at one of the following 6 locations: Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications College students, professionals, retirees, and high school students in good academic standing. Commitment to and belief in all children&rsquo;s ability to succeed and thrive Professional work habits Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Help a Child Love to Learn: Volunteer Tutor with GO Project!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770731%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project Spanish Translator (Saturday Volunteer) GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO School is a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Spanish in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Spanish speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak Spanish. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Spanish Translator Needed!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2752348%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO School is a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Chinese (both Mandarin and Cantonese) in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Chinese speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak both Mandarin and Cantonese is preferred. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Chinese Translators Needed!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2752211%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Tutoring: How YOU Can Help During the GO School Saturday program, a professional teacher models a lesson, activity or project to a classroom of students. Volunteer tutors continue to work with small groups of (2) to (4) students on the lesson providing individualized attention which allows the students to thrive. Tutor Responsibilities Tutor small group of students in grades 1 st-8 th who are in need of academic intervention under Head Teacher&rsquo;s guidance Punctual and consistent attendance; no more than 3 absences permitted per session. (Session 1: Oct-Dec, Session 2: Jan-April) Actively and enthusiastically participate - supporting instruction and engagement Help prepare, record and put away classroom materials Ongoing communication with Head Teacher regarding children&rsquo;s progress &/or concerns, and with the Director of Community Engagement regarding overall volunteer experience. Time Commitment Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 14 Saturdays 9am - 12:45 pm Attend mandatory orientation and training prior to start of session. High School students, those receiving credit or fulfilling a requirement must attend the training sessions offered. (All other volunteers are encouraged to attend.) GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations You can choose to tutor our students at one of the following 6 locations: Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications College students, professionals, retirees, and high school students in good academic standing. Commitment to and belief in all children&rsquo;s ability to succeed and thrive Professional work habits Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Volunteer Opportunities\\\" tab, \\\"Get Involved\\\". If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org .", "title": "Help a Child Love to Learn on Saturdays!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2747973%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-11-21", "description": "Every Tuesday, starting in Mid-June and ending in Mid-November, a local CSA will have edible produce that it is looking to donate. RoHo Compost is looking for a volunteer to help us transport this produce to a local shelter or food bank. Someone with a car is preferred.", "title": "Feed the Hungry by Rescuing Food!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2701083%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "ROHO COMPOST COMPANY"}, {"end": "2018-04-01", "description": "Mount Sinai Beth Israel, located in Manhattan&rsquo;s Lower East Side- Gramercy Park- neighborhood, seeks volunteers with an interest in counseling, public health, social work, or pastoral care. In order to ensure that we provide high quality care, Mount Sinai Beth Israel has created a Chi Cart program for staff. Volunteers visit clinical and administrative floors in the hospital and provide a space for our employees to spiritually and physically recharge. Volunteers will be given resources to serve tea, snacks, and aromatherapy as a way to help staff take a break. Volunteers will have the opportunity to go behind the scenes of the hospital, participate in reporting data from each visit, and gain experience in conducting informal group counseling sessions. Volunteers must be comfortable with introducing themselves to the floor and encouraging staff members to take a short break with them. In addition to being warm and welcoming, volunteers should be comfortable with hospital systems and vernacular. Qualifications: Students: Mature, caring students. Ideal for students interested in pursuing social work or counseling. Must have completed 2 college level courses in a relevant field. Must be 18+. Community Members: Mature, caring, and compassionate people who would like to engage in supporting the well-being of professionals at a local hospital. Must have 1-2 years of experience working in a relevant setting.", "title": "Chi Cart Program", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2628669%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Mount Sinai Beth Israel"}, {"end": "2017-09-30", "description": "We are currently looking for Volunteer Office Assistants to work in the afternoon and/or the evening. Volunteer Office Assistants serve 4-6 hours per week for a prestigious downtown NYC community theater that produces 25-30 new plays and 3 free community events each year. Volunteer Office Assistants will answer phones, take reservations, file papers and occasionally assist Executive Director Crystal Field by writing letters or researching on the internet. Opportunities available specifically on weekdays in the Morning/Afternoons from 10am to 4pm, or in the evenings from 4pm to 10pm, or on weekends from 12pm to 8pm. Volunteers will receive FREE tickets to all TNC productions.", "title": "Administrative Assistance", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2022544%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Theater for the New City"}], "10044": [{"end": "2017-09-30", "description": "We need friendly, energetic volunteers ready to donate their time on event day to a great cause. Volunteer shifts are typically 3-4 hours in length, and you can sign up to volunteer with family or friends. Volunteers help with responsibilities like: Set-up and Breakdown Registration Refreshments Course Marshaling Start/Finish Line Water Stops Each year, thousands of patients need a marrow transplant but have no donor match in their families. They depend on Be The Match to help them find an unrelated marrow donor and receive treatment. The cure for blood cancers like leukemia, lymphoma, and 70 other life-threatening diseases is in the hands of ordinary people - your hands. Be The Match Walk+Run raises funds to help patients with uninsured treatment costs, support continued marrow transplant research to improve outcomes, and add more potential volunteer marrow donors to Be The Match Registry, giving more patients hope for a cure. You'll receive the training you need to feel comfortable in your volunteer role, a t-shirt, and the appreciation of everyone who works to help marrow transplant patients. Please sign up to be an event day volunteer and encourage your family and friends to join you! Please contact Kelly Clark (bethematchwr.newyork@nmdp.org) for information on how to register as a volunteer.", "title": "Be The Match Walk+Run New York", "zipcode": "10044", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1701339%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Be The Match"}, {"end": "2017-10-07", "description": "Did you know that colorectal cancer is the 2nd leading cause of cancer death in the US, yet it is one of the most preventable forms of cancer? By volunteering for our 5k, the Undy Run/Walk you can help change that! We have found that by getting people talking about this disease, we can save lives. Date:Saturday, October 7 Location: Firefighter's Field, Roosevelt Island, NYC HOW WE NEED YOUR HELP THE DAY OF THE EVENT: -Early Shift- Set up expo area Registration and runner check in Food & Beverage Tent Kids Fun Zone -Later Shift- Water stations Course cheering Course marshaling Clean Up Event Photographer Please note we are also happy to validate or confirm any hours needed for school or community service. About The Colon Cancer Alliance: The Colon Cancer Alliance is a community that provides hope and support to patients and their families, while saving lives through prevention, research, and patient support services. www.ccalliance.org TO SIGN UP AS A VOLUNTEER, CONTACT: Joanna Anastasio, Special Events Coordinator janastasio@ccalliance.org 202.207.0267", "title": "Help Us Kick Colon Cancer's Butt-Volunteer for the NYC Undy Run/Walk!!", "zipcode": "10044", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2434865%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Colon Cancer Alliance"}], "10013": [{"end": "2017-10-11", "description": "If you are located in the Tri-State area, this is a great opportunity for you! Help fight blindness by volunteering at our annual wine, spirits and craft beer tasting event, the New York Taste for Sight. We are seeking out volunteers to assist with event registration and check-in, refreshment distribution, some event setup, maintenance and breakdown, as well as guiding the visually impaired who require assistance. Be sure to like us on Facebook! https://www.facebook.com/FoundationFightingBlindnessNewYork/?hc_ref=SEARCH&fref=nf Volunteers are vital to the success of our organization, so we thank you for your time and dedication!", "title": "Help find a Cure! Volunteer at the New York Taste for Sight!", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2609688%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Foundation Fighting Blindness"}, {"end": "2017-12-16", "description": "For many new immigrants, learning English is a first step to full participation in American society. Help them take that first step by becoming a volunteer teacher in English or Citizenship classes. English classes help students improve their communication skills. Citizenship classes help students prepare for the U.S. citizenship test. Volunteers work in teams to plan lessons and teach the class. This fun and rewarding experience gives you a chance to make a difference in the lives of others. Individuals with an interest in education careers are encouraged to apply. Requirements Must have good communication skills and a strong desire to help and work with new immigrants Prior teaching experience is preferred. Bilingual skills are a plus. We prefer volunteers who can commit to teaching at least two semesters Prospective volunteers must complete application and be interviewed. Volunteer Schedule: 9:30 am-11:30am (Tues or Thurs) 10:30 am-12:30 pm (Tues or Thurs) 1pm to 4pm (Saturday) 6:30pm to 8:30 pm(Mon, Tues or Wed) Summer 2017 - July 10, 2017 to August 19, 2017 Fall 2017 - September 19, 2017 to December 16, 2017 Spring 2018 - March 4, 2018 to June 7, 2018 Prospective volunteers must complete application and will be interviewed. Please contact us at cpanyc@cpanyc.org for an application OR apply on-line here: http://bit.ly/volunteerteacherapp For more information: http://bit.ly/VolunteerToTeachEnglishorCitizenshipClass", "title": "Teach English or Citizenship Class in Chinatown", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D906407%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chinese Progressive Association"}, {"end": "2017-10-21", "description": "Since 2001, the Multiple Myeloma Research Foundation&rsquo;s family-friendly 5K walk/run program has raised both awareness and funds to support urgent multiple myeloma research. Today, the series is held annually in thirteen cities and participation offers hope, camaraderie and knowledge sharing within our myeloma community and beyond. We&rsquo;ll be at Hudson River Park, Pier 97 on Saturday, October 21st, and need your help in making this year&rsquo;s event a great day for our patients as well as their friends and family members! Volunteers can assist in a variety of ways, serving as part of the Welcome Team, Course Team, Event Team or Flex Team. Volunteers will also receive a free t-shirt on the day of the race! Groups welcome! To register, please click the link below: https://walkrun.themmrf.org/new-york-city/Account/Register Contact volunteers@themmrf.org with questions or for more information.", "title": "MMRF Team for Cure 5K Walk/Run New York City", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2722346%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Multiple Myeloma Research Foundation"}, {"end": "2018-07-16", "description": "We are currently looking for volunteers who are passionate about helping homeless abuse survivors improve financial literacy. This is a support role, working with a team to create materials and content for our classes. Research & Material Development Support Conducting research in preparation for classes and programs. Assist Cacilitators and Team Lead in designing activities and handouts for classes. Assistance in material purchases or print-outs for sessions. Qualifications: Ability and willingness to work in a team environment. Keen, creative eye for design and user experience. Timely and detail oriented. Receptive to receiving and giving feedback. Proficiency with PowerPoint and/or other design software tools to create handouts. Weekly Commitment: 2 hours Please send emails to: general@shine-foundation.org to apply", "title": "Research & Material Development-Help Homeless Abuse Survivors Improve Financial Literacy (NYC)", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715826%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Shine Foundation"}, {"end": "2018-07-16", "description": "Team Lead: We are currently looking for individuals passionate about making a difference to join Shine as team leads to help bridge the gap between Shine and our clients and partner sites. Responsibilities: Team leads will serve as main point of contact between site contact, team and Shine Board Work with facilitators and to create program and lesson plans Coordinate all team members - virtual and in-person facilitators, support, graphic designer and marketing specialist. Approve lesson plans and handouts. Provide regular progress updates on the program to site contact and Shine Board Ensure proper data collection for monitoring and evaluation. Qualifications: Experience managing multifunctional teams. 5+ years of prior project management experience. Highly organized and detailed oriented. Ability to make decisions and move processes forward. Timeframe: One-year Weekly commitment: 8 to 10 hours To apply: Send resumes to: general@shine-foundation.org", "title": "Team Lead: opportunity to help homeless abuse survivors improve financial literacy", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2714714%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Shine Foundation"}], "10128": [{"end": "2018-06-26", "description": "Learning Through Art Volunteer Solomon R. Guggenheim Museum The Solomon R. Guggenheim Museum is seeking volunteers to support teaching artists in New York City public school classrooms where the Learning Through Art (LTA) program is implemented. LTA Volunteers should be enthusiastic about arts education/integration and able to make a commitment to assist a teaching artist one day each week for the duration of the 20-week residency. LTA places teaching artists in New York City public school classrooms, where they collaborate with teachers to create process-oriented art projects that examine ideas and themes related to the school curriculum. In these 20-week residencies, teaching artists introduce art techniques and concepts and encourage students to view, analyze, and discuss works of art. Founded in 1937, the Solomon R. Guggenheim Foundation is dedicated to promoting the understanding and appreciation of art, architecture, and other manifestations of visual culture, primarily of the modern and contemporary periods. The Guggenheim realizes this mission through exceptional exhibitions, education programs, research initiatives, and publications. The Guggenheim strives to engage and educate an increasingly diverse international audience through its unique network of museums and partnerships. With nearly three million annual visitors worldwide, the Guggenheim and its network is one of the most visited cultural institutions in the world. Responsibilities of a LTA Volunteer include: Distribute all art materials to students as directed by teaching artist. Help to maintain an organized classroom throughout each session and manage clean-up and storage of materials. Photograph (when advised by teaching artist) students at work in the classroom. Photograph one individual work for each student in February/March to be included in the catalog and exhibition slide show. Assisting the teaching artist in hanging in-school exhibitions and other displays of student artwork throughout the year As advised by teaching artist, work with students one-on-one and in small groups as needed. Helping with LTA events as needed, including family days at the Guggenheim Museum This is a volunteer position. Volunteers receive invitations to Guggenheim programs, free admission to museums across the country, discounts at the Guggenheim restaurants and store and the opportunity to learn about art education, museum education and modern and contemporary art. If you have any questions, please feel free to email learningthroughart@guggenheim.org. Volunteer commitment is once weekly from approximately mid-October through early May. TO APPLY: Please complete the LTA volunteer application found at www.guggenheim.org/lta. Email with a cover letter and résumé to learningthroughart@guggenheim.org or mail to Learning Through Art, 1071 Fifth Avenue, New York, NY 10128.", "title": "Learning Through Art Volunteer", "zipcode": "10128", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2401132%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Solomon R Guggenheim Museum, Learning Through Art"}], "10028": [{"end": "2018-06-25", "description": "Enthusiastic volunteers are needed to introduce school children to art and museums. We will train you to give guided tours at the Brooklyn Museum of Art and Metropolitan Museum of Art, and to go into the classroom to prepare the students for their visit. Tours take place Monday through Friday, during the school year, between the hours of 10am and 1pm. ArtWorks volunteers are in 20 schools throughout the five boroughs and our classroom teachers love us!", "title": "\"Introduce Children to Art and Museums\"", "zipcode": "10028", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1753226%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "ArtWorks NYC"}], "10029": [{"end": "2018-05-31", "description": "DREAM, an award-winning youth development program, is seeking dedicated volunteers to serve as College Success Mentors for our Alumni Program, known as the Legends Program. Designed to assist first-year students in their transition to college, volunteer College Success Mentors will provide support and resources intended to increase academic success, build character, and improve student engagement with their university. What You&rsquo;ll Do Deliver support and guidance as students work to form communities, get involved on campus, and access campus resources. Communicate student&rsquo;s progress with DREAM staff. Serve as a role model and build positive relationships with mentee. What We&rsquo;re Looking For Strong understanding of the challenges low-income students face as they transition to college life; Possess enthusiasm, empathy, and patience; Ability to make a year-long commitment; Previous experience working with young adults; Bachelor&rsquo;s Degree. Benefits Gain invaluable experience and opportunities for professional development at an award winning youth development program; Receive an optional professional reference upon completion of your service term; Join an incredible community of passionate staff and volunteers. Hours Hours will vary. Volunteer mentors commit to communicating with their mentee once a week, meeting in person once a month, and participating in a program at DREAM once a semester. Commitment One year. DREAM provides equal opportunity for all volunteers.", "title": "College Success Mentor", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2734646%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Harlem RBI"}, {"end": "2017-12-01", "description": "The Carter Burden Network, a nonprofit leader in aging services in New York City, is looking for a bright, energetic Social Media and Marketing volunteer to join our Volunteer Services team this fall. The Social Media and Marketing volunteer will assist with CBN&rsquo;s social media strategy, from routine daily and weekly postings to participating in the conception and execution of campaigns. This is a hands-on position, offering the opportunity to actively improve the way in which CBN communicates its message to the public. The ideal candidate will contribute creatively to new and ongoing projects. This is an unpaid position that is great for someone who is interested in learning the ins and outs of the nonprofit sector while building skills and adding valuable work experience to their resume. Responsibilities: * Occasionally attend events taking place at various CBN locations * Document senior and volunteer engagement and activities via digital photography * Create engaging, elevated copy and content for all CBN social media channels: Instagram, Facebook, Twitter * Build out CBN&rsquo;s first month-to-month social media calendar * Document and track social influencer engagement with CBN&rsquo;s social media * Research the social media practices of comparable social services non-profits to glean content ideas and best practices Qualifications: * Undergraduate students welcome * Fluent in social media (Facebook, Twitter, Instagram) and scheduling tools * Proficient in photography * Excellent communication, organizational, and time-management skills * Strong interest in writing and multimedia * Detail-oriented (have an eagle eye for typos!) * Able to review data and pull out key insights * Collaborative, but must be capable of working independently * Fluent in Spanish a plus * Interest in working in the nonprofit sector or aging services a plus Please provide examples of published writing and/or social media projects Additional Information * 15-20 hours a week, 3 days a week (days are flexible). This is not a remote position. * 2-3 months minimum starting in September/October 2017 * Our office is located East Harlem To apply, please email your resume and cover letter to Arianna at defelicea@carterburdennetwork.org", "title": "Social Media and Marketing Intern", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2758201%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Carter Burden Network"}, {"end": "2018-05-15", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS 38 Roberto Clemente, NYC)", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2766391%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}, {"end": "2017-10-21", "description": "Our Fall Fair is an annual schoo fundraising and community event. This is an opportunity for the neighborhood community and the school community come together and share opportunities. It is also our biggest fundraising event of the year which allows us to raise money needed for school supllies, send our 4th and 5th graders to camping trips, provide aditional resources so we can have music and arts programs.", "title": "Fall Fair 2017", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2746187%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Central Park East Ii"}, {"end": "2017-12-08", "description": "DREAM, an award winning youth development program, is seeking volunteer tutors to provide academic support to our middle school after-school students in East Harlem and the South Bronx. Tutors work with youth individually and in small groups to help improve student success in class, increase subject-specific retention, and contribute to overall academic enrichment and development. What You&rsquo;ll Do Support academic enrichment activities, including homework help and tutoring; Provide individualized and team-wide support all after-school program activities and initiatives; Serve as a role model and build positive relationships with youth; What We&rsquo;re Looking For Strong command of one or more of the following academic subjects: English, Math, Science, and/or Social Studies Previous experience working with youth; Possess creativity, enthusiasm, initative, flexibility, and patience; Solid oral communication skills; Ability to make a consistent, weekly commitment; Bachelor&rsquo;s Degree (a plus); 1-2 years previous tutoring experience (a major plus). Benefits Gain invaluable experience and opportunities for professional development at an award winning youth development program; Receive an optional professional reference upon completion of your service term; Join an incredible community of passionate staff and volunteers. Minimum Commitment: 1-2 hours per week for 3 months. When: Monday - Thursday 4pm-5pm, 4pm-6pm, or 5:30pm-6:30pm (time depends on tutor availability and program site assignment) DREAM provides equal opportunity for all volunteers.", "title": "Volunteer Tutor", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2739347%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Harlem RBI"}, {"end": "2017-11-04", "description": "Dear Manhattan and Queens folks, On behalf of the Mount Sinai Sexual Assault and Violence Intervention (SAVI) Program, I wanted to invite you to join us in eradicating sexual and intimate partner violence from our communities. New York City needs you! By joining our roster of volunteer Emergency Department (ED) Advocates it is possible to have an impact. An ED Advocate is trained to provide support and advocacy for survivors in emergency departments, so they don&rsquo;t have to face the difficult decisions, emotions and follow-up procedures alone. SAVI ED Advocates helped more than 500 survivors in New York City Emergency Departments last year- that&rsquo;s almost 2 survivors a day! We hope you or someone you know may be interested in becoming a Volunteer Emergency Department Advocate. Those interested should call (212) 423-2151 or email savi@mssm.edu for the next steps. In your email please include your telephone number and the general best day(s) and time(s) to reach you at that number. Interviews will be held from July - October and those accepted into the program will begin training in mid-October. More information is also available at our website: please visit www.mssm.edu/savi . Thank you so much for your help and we hope to hear from you! Your friends at The Mount Sinai SAVI Team", "title": "Help Survivors of Sexual and Intimate Partner Violence - Manhattan and Queens Residents Needed!", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2703099%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Mount Sinai SAVI Program"}, {"end": "2017-12-31", "description": "The Emergency Department Ambassador (EDA) provides comfort and conversations to patinets and families in the Emergency Room. They assist in distributing lunch trays to patients that do not have food restrictions, make certain patients have a pillow, a blanket and other things that can improve their comfort in the emergency room. The goal of the EDA is to provide a friendly and helpful presence, and to be of assistance to the emergency room staff. The Ambassador can also escort family members to the cafeteria or other areas of the hospital, assist with phone charging, and even make certain the patient knows their nurses name. The EDA provides non-medical information. If you are kind and compassionate and feel comfortable assisting in the Emegency Room we could teach you to be an EDA. This position is available Monday - Friday from 12 noon to 3PM. We ask Ambassadors to serve at least one session per week.", "title": "Hospital Emergency Room Ambassador", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1588223%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Mount Sinai Medical Center"}], "10027": [{"end": "2017-08-29", "description": "Helpers to pass out flyers in Marcus Garvey Park on the weekend of August 26, 27 and to help with festival set up and street management on August 28, 29.", "title": "New York Jazz Film Festival Helpers", "zipcode": "10027", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2504490%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "AMERICAN YOUTH SYMPHONY"}, {"end": "2017-08-30", "description": "International House is hosting their first ever Sakura Park Festival, a Morningside Heights Community Celebration. Volunteer Information: Volunteers will share community information, assist with event setup/breakdown, and direct participants. Volunteers will be split into two time slots. 12PM - 4PM & 4PM - 8PM. 12PM volunteers may be required to meet at our office (only a few blocks from the event). 4PM volunteers may meet us at Sakura Park during the festival. Please specify the time slot you are interested in. There will be FREE FOOD available for volunteers. Description of event: Groove to main stage performances by Underground System Afrobeat and join the street food revolution by sampling some of NYC&rsquo;s most popular food trucks. Let your inner K-Pop dancer out, create an authentic Vietnamese woodcut painting, play games, and enjoy the spirit of community in the beautiful Sakura Park. Entrance to the festival is free and it is family-friendly. For more information, visit the eventbrite page: https://www.eventbrite.com/e/sakura-park-festival-tickets-36027957591", "title": "Community Outreach at Sakura Park Festival", "zipcode": "10027", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2758821%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Morningside Area Alliance"}], "10024": [{"end": "2017-09-01", "description": "Goddard Riverside Community Center's Phelps House is looking for a few people to help with their barbeque September 1, 2017. Phelp's House. Phelps House provides 167 units of affordable housing for older adults and people with mobility impairments. Designed as an independent living residence with one- and two-bedroom apartments, it also offers a range of supportive services for its longtime tenants who have aged into their 70s, 80s, and 90s. Example of duties include: Escorting members to their chair Making the plate for the homebound and delivering it to their apartment Host-going around and identifying ongoing needs of the seniors (drinks, condiments etc) Please email Brianne Kilpatrick at BKilpatrick@goddard.org for more information.", "title": "Volunteers Needed for September 1st BBQ!", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2448038%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Goddard Riverside Community Center"}, {"end": "2017-09-10", "description": "More than 10,000 walkers and runners will take part in our annual non-competitive 5k Race for the Cure (supporting breast cancer treatment and research) in Central Park. Volunteers are essential to the day&rsquo;s success - to welcome the participants, at registration, along the course route and at the finish line. Volunteers must be able to be on your feet for a few hours. A willingness to get loud and be excited a big plus. Specific assignments along the race course will be provided prior to race day. We also want race participants! If you want to volunteer to field a team or join a team - welcome! The Race for the Cure Registration info is here: http://www.komennyc.org/site/TR/Race/RFTC?pg=entry&fr_id=1681", "title": "Susan G. Komen Greater NYC Race for the Cure 2017", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2399737%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Susan G. Komen Greater NYC"}, {"end": "2017-09-17", "description": "DOROT'S ROSH HASHANAH PACKAGE DELIVERY -- SUNDAY, SEPTEMBER 17TH Brighten the day of a Senior! Deliver a holiday package and spend time visiting with an older person for about an hour. Join Us and start a new tradition for you, your family, your friends! Great opportunity for Individual volunteers, Community Groups, Students, Corporations and Religious Groups Volunteer Sites: West Side DOROT 171 West 85th Street off Amsterdam Avenue East Side Temple Israel of the City of New York 112 East 75th Street between Park and Lexington Aves Westchester Young Israel of Scarsdale 1313 Weaver Street Scarsdale, NY To register and for more information, please go to: www.dorotusa.org/rosh ***PLEASE NOTE*** Valid Photo ID required to participate.", "title": "Deliver a package and visit with a senior", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1754331%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}, {"end": "2018-01-17", "description": "Please join us for a special intergenerational reading adventure for 2nd and 3rd graders and older adults. We are searching for youth who need extra encouragement to reach for a book and spend time discussing books. We will nurture your child&rsquo;s natural love of reading and chatting through a variety of fun and creative intergenerational activities. The group will read aloud a few books over the course of 14 sessions and discuss the major themes of the books respecting other&rsquo;s differences and the value of kindness. Great food and art activities will follow. 2017 Dates: September 13 (orientation for youth,) September 27 October 4, 18, 25 November 1, 8, 15, 29 December 6, 13, 20 Jan 3, 10, 17 3rd and 4th graders can register online at: http://www.dorotusa.org/site/PageServer?pagename=book. Only 12 spaces are available for youth. Parents need a pre-phone interview. For more information, please contact Shai Rosenfeld at srosenfeld@dorotusa.org.", "title": "Intergenerational Reading Adventure for 3rd and 4th Grade Students", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2544814%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}, {"end": "2017-12-18", "description": "Intergenerational Chess at DOROT Share your love of the game and bring a smile to a senior. \\\"One of the best things about playing chess with Mr. B is how excited we are to see each other.\\\" -Zach, age 13 Fall/Winter: Sept. - Dec. from 4:00-5:30pm Students and DOROT Seniors will get to know each other and play chess together. Refreshments will be served. Free. Requirements: for 6th - 12th grade students must commit to all sessions understand the game of chess understand the different chess pieces and how to move them Intergenerational Chess at DOROT is sponsored by the Targoff family and friends", "title": "Intergenerational Chess - Youth Needed to Play Chess with Seniors", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2544723%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}], "10025": [{"end": "2018-06-02", "description": "Top Honors is a non-profit educational organization that provides free math tutoring to NYC 5th, 6th, 7th, and 8th-graders. Tutoring takes place on Saturdays and Wednesday evenings at a school on the Upper West Side. New volunteer orientation and training sessions take place on a rolling basis. To receive an invitation, please submit an application here. Frequently asked questions about the TH volunteer experience can be found on our website. All tutoring sessions take place on the Upper West Side in Manhattan on the following days and times: Session 1: Saturdays from 10 a.m. to 12 p.m. Session 2: Saturdays from 1 p.m. to 3 p.m. Session 3: Wednesdays from 6:30 p.m. to 8 p.m. Volunteers may be professionals, advanced high school, college, or graduate students (community service credit is available). Applicants should be available on Saturdays for two hours starting at 10 a.m. or 1:00 p.m. or on Wednesdays from 6:30 - 8 pm, like math, and enjoy working with students in the middle school age group (10-14 years). No prior experience is necessary. A note on volunteer commitment: Tutors attend 2-3 Saturdays from October and May, which includes holidays and school breaks. Attending 22 out of 27 scheduled sessions will meet this requirement. To apply, submit an online application at www.tophonors.org/volunteer. Upon receipt, Top Honors will contact the candidate directly.", "title": "Do you love MATH? Volunteer MATH Tutors needed!", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D590253%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Top Honors, Inc."}, {"end": "2017-09-01", "description": "The New Jewiish Home, Manhattan Division has a wide variety of opportunities for high school and college students to volunteer with over the summer vacation. Opportunities vary and we will try our best to meet your interest Opportunities include but not limited to: Recreation Assistant (Bingo, Games, Exercise, Arts & Crafts, Nail Spa) Pharamacy (selective, limited spots) Library Assistant (upkeep of shelving, assisting book selections, assisting computer users) Clerical/Office Assistant Please apply online at the following link: https://www.volgistics.com/ex/portal.dll/ap?AP=229551104 Please mention Volunteer Match & Summer Volunteering in your application If you have any questions - Please contact Jessica at JSinovoi@jewishhome.org", "title": "Summer Volunteer at The New Jewish Home (HS & College students)", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D855373%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The New Jewish Home, Manhattan Division"}], "10023": [{"end": "2019-10-31", "description": "Volunteer opportunity - ACS Making Strides Against Breast Cancer/ Central Park Volunteers Needed! Are you looking to get more involved with your local community? Do you enjoy working with and meeting new people? Are you passionate about helping others and finishing the fight against cancer? If this sounds like you, the American Cancer Society needs you! The Making Strides Against Breast Cancer Walk of Central Park is one of the largest breast cancer awareness events in the nation. The money raised through the event helps save many lives by funding groundbreaking breast cancer research, providing free comprehensive information and support, and helping people take steps to reduce their risk of the disease or find it early when it&rsquo;s most treatable. As the largest voluntary health organization in the country, we count on volunteers and volunteer driven organizations, agencies and companies to help make this event run smoothly and efficiently. The walk is on October 15th, 2017 located in Central Park and we need your help! Our volunteers help with important event details such as check in, water stations, information, and more. You&rsquo;re there to help make the event truly special and to join, encourage, and support those in the fight against breast cancer! With just a few hours, you can help make a difference in countless lives and create a world with more birthdays! If interested, please contact our Event Manager Denise Solorzano, at Denise.Solorzano@cancer.org or by phone at 212-237-3813.", "title": "Making Strides Against Breast Cancer-- Central Park Volunteer", "zipcode": "10023", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2084729%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "American Cancer Society"}], "10021": [{"end": "2017-12-29", "description": "Lenox Hill Neighborhood House, widely recognized as one of New York's premiere human services providers, is a 123 year old settlement house that provides an extensive array of effective and integrated services on the East Side of Manhattan. We are seeking volunteers to assist older adults with improving their technology skills during our Computer Practice Lab. Volunters are needed to facilitate the practice lab from 3:00-4:30 weekly on either Monday or Friday for a minimum of four months starting on either September 8 or September 11.", "title": "Assist Older Adults in a Computer Lab", "zipcode": "10021", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2749898%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Lenox Hill Neighborhood House"}, {"end": "2017-12-16", "description": "Sparkidz is a recreational program for children with special needs. We operate every Saturday on the UES from 10am-4pm and are currently looking for devoted and outstanding volunteers. You can learn more about us at www.sparkidz.org", "title": "Volunteer with Sparkidz Saturdays", "zipcode": "10021", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2765866%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "SparKidz"}], "10010": [{"end": "2017-10-15", "description": "Looking to immerse yourself in architecture, design, and New York City history? Want to share your love for New York City with others? Open House New York invites you to join our team of more than 1,000 volunteers who help make Open House New York Weekend one of New York's most exciting events. Volunteering gets you... * The opportunity to meet others who share your interest in architecture, design, history, and New York City's built environment * Expedited access for you and a friend at all OHNY Weekend sites that do not require Advance Reservations * A limited-edition OHNY volunteer t-shirt and OHNY volunteer button, which identifies you as an official OHNY volunteer Learn more and register today! https://ohny.formstack.com/forms/2017_ohnywknd_volunteer", "title": "Volunteer for the 2017 Open House New York Weekend!", "zipcode": "10010", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2765328%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "openhousenewyork"}], "10017": [{"end": "2017-10-20", "description": "Position Description: Asylum Access, an innovative nonprofit dedicated to realizing refugee rights in the Africa, Asia and Latin America through legal services, policy advocacy and public education, seeks a Refugee Work Rights Event Coordination Intern to support the production of an event in New York City to occur during the United Nations General Assembly in late September, 2017. This position will start ASAP with mission-critical ground support, providing local 'eyes and ears&rsquo; in NYC and logistical support for the event planning team (based in our Oakland, CA headquarters). The event will take place in or near the UN and will launch a new website tracking national Refugee Work Rights (RWR) policies worldwide, with a focus on the refugee crisis in the Middle East. The event will provide a platform for Asylum Access and allied organizations to advocate for refugees to have access to safe, lawful employment. Essential Job Responsibilities Duties may include but not limited to Location support, e.g. scouting and securing venue Event logistics planning and execution Intel gathering through participation in relevant local allied meetings Coordination with other NYC based allies and volunteer supporters Communicate with potential partners about Asylum Access&rsquo;s Refugee Work Rights programs. Work under the supervision of Associate Director of Advocacy and Communications Required Qualifications Self starter, self-directed; able to work remotely Event planning experience Attention to detail; organizational skills E xcellent verbal communication and listening skills; strong writing skills in English Availability during some business hours and some evenings Familiarity with emerging discourse in refugee rights Preferred Qualifications: Familiarity with UN and/or NYC-based international NGOs Interest in international human rights and/or refugee rights and/or related topics Ability to work with diverse individuals and groups. Candidate should be culturally sensitive Basic working knowledge of Gmail, Google Drive, Ms Office and related tools (Docs, Sheets, etc.)", "title": "Refugee Work Rights Event Coordination Intern", "zipcode": "10017", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2751929%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "ASYLUM ACCESS"}], "10016": [{"end": "2018-08-18", "description": "Volunteers needed to deliver food in all boroughs. Car not necessary. If you cannot do it on a specific date we can still use your help with food delivery during thae week. Interested persons should call 718-606-9712.", "title": "Deliver Food", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2318462%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2018-06-19", "description": "READING BUDDY PLUS connects a younger child with the same adult volunteer every other Tuesday from October- June. Every time they visit the Reading Center, children share a story one-on-one with the same buddy. This continuity offers a child the same opportunity to improve their reading skills and open up their imagination, but more importantly it gives them the chance to deepen the bonds and their sense of trust with one person. As their friendships with the children evolve, volunteers can better help the children in this program to see their world in a more positive light. And, in talking about the stories they share, the children can learn to use their imaginations to make a difference in their own lives. http://pajamaprogram.org/ Requirements and Commitments: ALL volunteers must pass a background check and fill out a volunteer application to be able to participate in Reading Buddy Plus. All personal information will be kept confidential. This program runs every other Tuesday from 12 P.M. - 1 P.M. from October- June. Volunteers MUST commit to the ENTIRE school year. If interested, please email Chrissie Martinez at chrissie@pajamaprogram.org to receive further information.", "title": "Share the Joy of Reading with a Child", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2763448%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Pajama Program"}], "10032": [{"end": "2017-11-30", "description": "Opportunity: The Wa-Shokuiku Project is a new initiative from TABLE FOR TWO USA* which provides practical application to the universal principles found in washoku, or Japanese cuisine, through free afterschool educational programming for elementary school students . Through guided lessons and activities, students will learn about well-known foods such as sushi, which many already recognize as Japanese, as well as other home-style dishes such as miso soup and onigiri (riceballs) which can be easily prepared. Through these interactive programs, we hope to instill a deeper understanding of Japanese food and culture while equipping them with lifelong practical knowledge and skills about one of the world&rsquo;s healthiest diets. Our Cooking Instructors and Volunteers will implement and teach the Wa-Shokuiku Curriculum in schools across New York City, Washington D.C., and Boston. Instructing children about Japanese cuisine (washoku) and food education concepts, the cooking instructors will help to introduce children to cuisine and culture which many are learning about for the first time. Instructor Responsibilities: As needed, teach elementary or middle school-age participants the basics of food and kitchen safety, food preparation, and making healthy choices when cooking, according to the highlighted objectives of each lesson. Curriculum is provided by the Wa-Shokuiku Project. Supervise children participants, ensuring proper hygiene, meal creation, and clean up. Facilitate class discussions of concepts of Japanese cuisine and food education, allowing participants to brainstorm how they might put new knowledge and food education concepts into action, discuss barriers to adopting new concepts, and share ideas with their peers. Coordinate with other key Wa-Shokuiku staff to gather information, data, and resources on the success of our programs to identify areas of improvement. Skills/Experience Required: Interest and comfort in working with children from diverse backgrounds. Familiarity and knowledge of Japanese food and culture. Comfortable speaking in front of children in English. Ability to travel to class location. Willingness to be trained on Wa-Shokuiku curriculum, to work as a team with volunteers, and to adhere to program policies and team decisions. Evaluate the student&rsquo;s ability to comprehend, perform and retain practical techniques, report assessment in regular meetings/communications with staff. Time Commitment and Compensation: At least 3 hour for training and orientation. Approximately 4-5 hours per week for lesson preparation, travel time, class time, set-up and clean-up during program period duration.(Classes will on average last 45 minutes to 90 minutes) Must commit to all seven weeks of the course or share the commitment with a colleague. The instructor position is a paid position. Discussion of compensation will be discussed in interview. About the Wa-Shokuiku Project: * TABLE FOR TWO USA (TFT) is a 501(C)(3) organization that that addresses the opposite issues of hunger and obesity through a unique \\\"meal-sharing\\\" program. TFT partners with corporations, restaurants, schools and other food establishments to serve healthy, low- calorie, TFT-branded meals. For each one of these healthy meals served, a small portion of the cost is donated to provide one school meal for a child in need. In this way, TFT has served healthy meals to both sides of the \\\"table\\\" and helped to right the global food imbalance. TFT started in Japan and now operates in 14 countries. As one of the most well-known NPOs in Japan which is noted for the longevity of its people, TFT promotes Japanese healthy eating culture as well to tackle the critical health issues. Learn more at: http://usa.tablefor2.org", "title": "Japanese Food Education Class Instructor", "zipcode": "10032", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2661845%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "TABLE FOR TWO USA"}, {"end": "2017-12-22", "description": "The New York State Psychiatric Institute, part of the New York State Office of Mental Health and affiliated with Columbia University Medical Center, has an opportunity for individuals to deepen Drupal 8 web site administration / configuration skills as the Institute updates and migrates Internet and Intranet sites to this platform. Experience with website configuration in Linux recommended. Familiarity with Drupal preferred. The candidate would have the opportunity to select and integrate modules in a several multi-site / multi-host environments.", "title": "Drupal website system manager", "zipcode": "10032", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2751966%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "NYS Psychiatric Institute"}], "10019": [{"end": "2017-10-21", "description": "The National MS Society is looking for packet support volunteers to help the day before Bike MS: New York City! Packet support volunteers will be needed on Saturday, October 21 at Pier 92/94 in Manhattan. Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Packet Support/Pick Up Team Date: Saturday, October 21, 2017 Location: Pier 92/94 - Manhattan Time: 10:00am-2:00pm Description: Volunteers will assist with the packet support/pick up process the day before Bike MS: NYC. Volunteers will pull rider packets and keep the packet system organized. This is a supportive admin volunteer role that is perfect for organized individuals. Volunteers will work along with NMSS staff. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Packet Support Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770982%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-21", "description": "The National MS Society is looking for volunteers to help with pre-event set up for Bike MS: New York City! Pre-event set up volunteers will be needed on Saturday, October 21 at Pier 92/94 in Manhattan. Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Pre-Event Set Up Team Date: Saturday, October 21, 2017 Location: Pier 92/94 - Manhattan Time: 10:00am-2:00pm Description: Volunteers will assist with the setup of tables, chairs, materials and signage. You must be able to lift boxes, stand and walk for long periods of time. No seated positions available If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Pre-Event Set Up Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770965%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to help with our upcoming event - Bike MS New York City! Bike MS New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 300 volunteers are needed to make this event a success! Groups and individuals of all ages and abilities are invited to volunteer. We are always looking for youth clubs, corporate and service-oriented community groups to lend a hand before, during, and after our events. There is only one requirement: a desire to end MS now! If you are interested in volunteering, please review the positions below and register online here: www.bikeMSnyc.org Bike MS New York City - Volunteer Positions Pre-Event Support Team Date: Saturday, October 21, 2017 Description: Volunteers will assist with the setup of tables, chairs, materials and signage. You must be able to lift boxes, stand and walk for long periods of time. No seated positions available. Packet Pick Up Team Date: Saturday, October 21, 2017 Time: 10:00am-2:00pm Description: Volunteers will assist with packet pick up the day before Bike MS: NYC. Volunteers will pull rider packets and keep the system organized. Volunteers will work along with NMSS staff. Bike Parking Team Date: Sunday, October 22, 2017 Time: 5:00am-11:00am (Shift 1) / 8:30am-1:30pm (Shift 2) / 1:00pm-6:00pm (Shift 3) Description: Volunteers will provide support to the bike parking area and make sure that cyclists park their bikes in the correct location in the pier. Customer Service Team Date: Sunday, October 22, 2017 Time: 5:00am-9:00am Description: Volunteers will be pulling rider packets and helping the NMSS staff with general customer service. Event Day Support Team Date: Sunday, October 22, 2017 Time: Multiple Shifts Available Description: Volunteers will provide support to various participant areas including, but not limited to: Bag Check, Top Fundraiser Lounge and more! Food & Beverage Team Date: Sunday, October 22, 2017 Times/Shifts: General Food & Beverage - 8:00am-12:00pm (Shift 1) / 11:30am-3:00pm (Shift 2) / 2:30pm-6:00pm (Shift 3) Lunch Line Manager - 9:30am-2:30pm (Shift 1) / 2:00pm-6:00pm (Shift 2) Beer Garden - 9:30am-2:30pm (Shift 1) / 2:00pm-6:00pm (Shift 2) - VOLUNTEERS MUST BE 21+ Food Trucks - 5:00am-9:30am Description: Volunteers will provide support to our different Food & Beverage area which include general food & beverage, managing the lunch line, helping at the breakfast food trucks and managing the line at the beer garden Medal Distribution Team Date: Sunday, October 22, 2017 Time: 8:30am-1:00pm (Shift 1) / 12:30pm-5:30pm (Shift 2) Description: Volunteers will cheer on the cyclists as they cross the finish line and hand out Bike MS medals! Photography Team Date: Sunday, October 22, 2017 Time: 5:30am-8:00am Description: Volunteers will take photos of participants and sponsors at the event Rest Stop Support Team Date: Sunday, October 22, 2017 Times: Multiple Shifts Available Description: Volunteers will be assigned to one of the rest stops along the route to distribute water and cheer on walkers. Rest Stop Locations □ Inwood Hill Park, NY □ Weehawken, NJ □ Alpine, NJ □ Closter, NJ □ Englewood, NJ □ Congers, NY □ Garnerville, NY Site Set Up Team Date: Sunday, October 22, 2017 Time: 5:00am-9:00am Description: Volunteers will help with site set up the morning of the event. Heavy lifting is involved - no seated positions. Site Breakdown Team Date: Sunday, October 22, 2017 Time: 2:30pm-6:00pm Description: Volunteers will help take down signs, break down tables and pack up event items. Heavy lifting is involved - no seated positions. Spirit Team Date: Sunday, October 22, 2017 Time: Multiple Shifts Available Description: Volunteers will cheer for the participants as they cross the finish line. Volunteers are asked to bring lots of enthusiasm, spirit and cheer! T-Shirt Distribution Team Date: Sunday, October 22, 2017 Time: 8:00am-12:00pm (Shift 1) / 11:30am-3:00pm (Shift 2) / 2:30pm-6:00pm (Shift 3) Description: Volunteers will hand out t-shirts to cyclists who finish Bike MS: New York City. Volunteers should be friendly and personable! Volunteer Check-in: Date: Sunday, October 22, 2017 Time: 4:45am-2:30pm Description: Volunteers will check-in volunteers and direct them to assigned locations. Specialty Volunteer Assignments: Caboose Assistant Team Date: Sunday, October 22, 2017 Shifts: 30 Mile Route / 50 Mile Route / 100 Mile Route Description: Volunteer will ride in vehicle with support & gear (SAG) team member as they follow the last rider on each route. Volunteer must be 21+ Route Closure Assistant Team Date: Sunday, October 22, 2017 Time: Multiple Shifts Available Description: Volunteer will provide support to the support & gear (SAG) team. Volunteer must be 21+ Sweep Team Date: Sunday, October 22, 2017 Time: Multiple Shifts Available Description: Volunteer will ride in vehicle with support & gear (SAG) team member as they pick up riders along the route. Volunteers must be 21+ Motorcycle Safety Volunteers Motorcycle Safety Volunteer Team Date: Sunday, October 22, 2017 Description: Volunteers will work with staff and law enforcement to guarantee safety for our riders. Motorcycle safety volunteers must have their own motorcycle, helmet, valid motorcycle license and insurance. Bike Safety Marshal Volunteers Bike Safety Marshal Team Date: Sunday, October 22, 2017 Description: Volunteers must have their own bicycle and have knowledge of bicycle safety/maintenance. You will be assigned to a team who will be positioned along a specific section of the route. You and your team will ride to the specific geographic area before Bike MS begin. You must remain at your post until the tail of Bike MS passes. Please note that assignments may be changed at any time, including during Bike MS. ***Exact locations and times will be assigned closer to the ride *** If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Volunteer for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715133%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for support with Volunteer Check-In at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Volunteer Check-In Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 4:45am-2:30pm Description: Volunteers will check-in volunteers and direct them to assigned locations If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Volunteer Check-In Support Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770955%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for event support volunteers to help with Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Event Day Support Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Shifts: Multiple Shifts Available Description: Volunteers will provide support to various participant areas including but not limited to: Bag Check, Top Fundraiser Lounge and more! If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Event Support Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770945%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for a NY Public Notary volunteer to help out in the customer service tent at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Customer Service Team - NY Public Notary Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 5:00am-9:00am Description: The NY Public Notary volunteer will be on site in the customer service tent to notarize registration forms for any minors that sign up the day of the event. This volunteer will also help to pull rider packets and assist the NMSS staff with general customer service. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "NY Public Notary Volunteer Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768316%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to help with customer service at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Customer Service Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 5:00am-9:00am Description: Volunteers will be pulling rider packets and helping the NMSS staff with general customer service. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Customer Service Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768304%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to fulfill sweep team positions at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride though the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Sweep Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Description: Volunteers will ride in a vehicle with support & gear (SAG) team member as they pick up riders along the route. Volunteers must be 21+ If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Sweep Team Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768288%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to fulfill route closure assistant positions at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride though the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Route Closure Assistant Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Description: Volunteers will provide support to the support & gear (SAG) team. Volunteers must be 21+ If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Route Closure Assistant Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768269%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for site set up volunteers to help with Bike MS: New York City! Bike MS New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages and abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success! If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Site Set Up Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 5:00am-9:00am Description: Volunteers will help with site set up the morning of the event. Heavy lifting is involved - no seated positions available. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Site Set Up Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768180%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to fulfill caboose assistant positions at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride though the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Caboose Assistant Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Route: 30 Mile Route, 50 Mile Route and 100 Mile Route Description: Volunteer will ride in a vehicle with a support & gear (SAG) team member as they follow the last rider on each route. Volunteers must be 21+ If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Caboose Assistant Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768174%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for Bike Safety Marshal Volunteers to help support Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Bike Safety Marshal Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Route: ***Bike Safety Marshals will select the route they would like support*** Manhattan North - 30 Mile Manhattan South - 30 Mile New Jersey North - 50/100 Mile New Jersey South - 50/100 Mile Manhattan North - 50/100 Mile Description: Volunteers must have their own bicycle and have knowledge of bicycle safety/maintenance. You will be assigned to a team who will be positioned along a specific section of the route. You and your team will ride the specific geographic area before Bike MS begins. You must remain at your post until the tail of Bike MS passes. Please not that assignments may be changed at any time, including during Bike MS. ** Exact locations and times will be assigned closer to the ride** There will be a mandatory training before the event for all Bike Safety Marshal volunteers. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Bike Safety Marshals Needed at Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768135%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for Motorcycle Safety volunteers for Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Motorcycle Safety Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan or Local Rest Stop Location Description: Volunteers will work with staff and law enforcement to guarantee safety for our riders. Motorcycle safety volunteers must have their own motorcycle, helmet, valid motorcycle license and insurance. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Motorcycle Safety Volunteers Needed at Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2768095%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for photography volunteers to take pictures at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as Volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 an 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Photography Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 5:30am-8:00am Description: Volunteers will take photos of participants and sponsors at the event. Volunteers must provide their own camera and provide us with digital copies of the photos taken at the event. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Photography Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2767729%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to help with food & beverage support at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Food & Beverage Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: General Food & Beverage - 8:00am-12:00pm (Shift 1) General Food & Beverage - 11:30am-3:00pm (Shift 2) General Food & Beverage - 2:30pm-6:00pm (Shift 3) Lunch Line Manager - 9:30am-2:30pm (Shift 1) Lunch Line Manager - 2:00pm-6:00pm (Shift 2) Beer Garden - 9:30am-2:30pm (Shift 1) - VOLUNTEERS MUST BE 21+ Beer Garden - 2:00pm-6:00pm (Shift 2) - VOLUNTEERS MUST BE 21+ Breakfast Food Trucks - 5:00am-9:30am Description: Volunteers will provide support to our different food & beverage areas which include general food & beverage, managing the lunch line, helping at the breakfast food trucks and managing the line at the beer garden (volunteers must be 21+ to volunteer for this role) If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Food & Beverage Volunteers Needed at Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2767720%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to help cheer on our cyclists and give out medals at the Bike MS: New York City finish line! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Medal Distribution Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 8:30am-1:00pm (Shift 1) 12:30pm-5:30pm (Shift 2) Description: Volunteers will cheer on the cyclists as they cross the finish line and hand out Bike MS medals! If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Cheer & Give Out Medals at Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2767709%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to help with t-shirt distribution at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org T-Shirt Distribution Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 8:00am-12:00pm (Shift 1) 11:30am-3:00pm (Shift 2) 2:30pm-6:00pm (Shift 3) Description: Volunteers will hand out t-shirts to cyclists who finish Bike MS: New York City. Volunteers should be friendly and personable! If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "T-Shirt Distribution Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2767685%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to help with traffic and information support at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Traffic & Info Team Date: Sunday, October 22, 2017 Location: Pier 92/924 - Manhattan Time: 5:00am-9:00am (Shift 1) 8:30am-2:30pm (Shift 2) Description: Volunteers will provide directional support to important event location like the pier entrance/exit, team area, bathrooms etc. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Traffic & Info Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2767675%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to help with bike parking at Bike MS: New York City! Bike MS: New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages & abilities to join us as a volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allows cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success. If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Bike Parking Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 5:00am-11:00am (Shift 1) 8:30am-1:30pm (Shift 2) 1:00pm-6:00pm (Shift 3) Description: Volunteers will provide support to the bike parking are and make sure that cyclists park their bikes in the correct location in the pier. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 215-453-3258", "title": "Bike Parking Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2766546%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for site breakdown volunteers to help with Bike MS: New York City! Bike MS New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages and abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 500 volunteers are needed to make this event a success! If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Site Breakdown Team Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Time: 2:30pm-6:00pm Description: Volunteers will help with site breakdown at the end of the event. Volunteers will help take down signs, break down tables and pack up event items. Heavy lifting is involved - no seated positions available. If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Site Breakdown Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2722191%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2017-10-22", "description": "The National MS Society is looking for spirit and cheer volunteers to help with Bike MS: New York City! Bike MS New York City will be held on Sunday, October 22 at Pier 92/94 in Manhattan. We welcome groups and individuals of all ages and abilities to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 300 volunteers are needed to make this event a success! If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Spirit & Cheer Team: Date: Sunday, October 22, 2017 Location: Pier 92/94 - Manhattan Description: Volunteers will cheer for the participants as they cross the finish line. Volunteers are asked to bring lots of enthusiasm, spirit and cheer! If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Spirit & Cheer Volunteers Needed for Bike MS: NYC!", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2721898%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}, {"end": "2018-01-31", "description": "We match isolated and lonely seniors with volunteers in the community who make weekly visits in the senior&rsquo;s home. The Friendly Visiting program is an opportunity to form rewarding relationships and ongoing companionship for both seniors and volunteers. Seniors and their visitor can converse and enjoy the company, take part in activities like going to cafes and museums, share stories, learn new skills, and a variety of other things based on the desires of the companions. You will be matched with a senior who has a similar personality and interests and you can decide together how to spend your time. Visits can easily fit into your schedule because matches are made based on your availability. We ask for a minimum commitment of 6 months or 1 year. Your time as a friendly visitor is invaluable, and you gain a new friend!", "title": "Just One Hour per week!  Provide Companionship To Homebound & Isolated Senior", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2560975%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Encore Community Services"}, {"end": "2020-12-31", "description": "The National Chorale is a premier NYC choral organization, founded 49 years ago, made up of an Ensemble of professional singers and soloists. Our annual concert series is presented in David Geffen Hall at Lincoln Center. We also present choral performances in other NYC venues as well as at other local, national and international festivals and music events and conferences. We also have a K-12 music training program where we provide professional music teachers in local NYC public schools. Our Executive Director is underwater with her workload, some of which we would like to offload to Administrative / Clerical Assistants. Work ranges from researching items on the Internet, to answering phones, to preparing reports, to scheduling events and people, to occasionally running an errand, typing - letters and reports and input to our database, attending meetings, communicating with our audience members, Board Members, concert personnel, funders, sponsors and K-12 NYC school administrators and teachers. Folks who have worked in the corporate environment with experienced office skills would be ideal. Office is in midtown Manhattan (Broadway & West 51st Street. Friendly office environment. Prefer a minimum of 20 hours per week, but we will work with you to design a schedule that is comfortable for you. We really need your help and like most nonprofit organizations, cannot afford to hire the support staff we require. BTW, one of the perks for our volunteers is that they are provided with two tickets to every Lincoln Center concert, and more if needed! Come join us and know that you will be making a real impact with a deserving nonprofit organization!", "title": "Administrative / Clerical Help", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2583139%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National Chorale"}], "10018": [{"end": "2018-05-05", "description": "America Needs You fights for economic mobility for ambitious, first generation college students. We do this by providing transformative mentorship and intensive career development. Our flagship Fellows Program is a two-year, intensive mentoring and professional training program where first-generation students (\\\"Fellows\\\") are paired with young professional volunteers. Our New York program workshops take place in Manhattan and Brooklyn. Career Coaches work with college students during Saturday sessions to build their professional skills and help them realize their career potential. ANY curriculum covers all kinds of professional development topics from resume preparation and interview etiquette to giving and receiving feedback and managing up. At workshops, Career Coaches typically participate in group or one-on-one work with Fellows; for example, writing and reviewing a cover letter or building a pros/cons list for deciding between two internships. Please complete the survey below to be contacted about volunteering at an upcoming workshop: https://newyorkneedsyou.wufoo.com/forms/rn5685a0sqkdux/", "title": "Volunteer to mentor ambitious first-generation college students!", "zipcode": "10018", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2595310%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "America Needs You"}, {"end": "2018-05-12", "description": "The Step Up program is a six month goal focused mentoring/ coaching program fro high school students. The goal of the program is to enhance self-confidence and self- esteem which then leads to positive change in the lives of the students. In order to be a mentor you must be 24 or older. For further information please contact Alexandria at Alex@nyunlockingfutures.org / 212-791-4927 ext #263.", "title": "Male or Female Mentors for our \"Step Up\" program!", "zipcode": "10018", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2285434%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Unlocking Futures, Inc."}, {"end": "2017-10-29", "description": "Global Green NY is looking for volunteers to help with our food donation work this summer. Volunteer opportunities are for food donation pick-ups in Midtown Manhattan on weekday nights (during typical resutrant closing time), where food will then be transported to food banks and shelters for those in need. http://www.globalgreen.org/getinvolved/ Ideally volunteers: For food rescue volunteers, the only qualifications are that they are punctual, reliable and able to carry 20+ lbs of food.", "title": "New York GGUSA Volunteer", "zipcode": "10018", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2371092%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Green USA"}, {"end": "2017-09-13", "description": "We are a 501 c 3 non profit organization dedicated to inspiring and nourishing children with cancer through the arts! We are seeking awesome, outgoing, and determined volunteers to help us out on September 13th! We need volunteers to reach out to individuals via phone and see if they are in a position to donate services to the organization. This is a 1 day opportunity and will be for a few hours. This is a cold calling opportunity so eager and driven individuals are needed! For more information and to find out how you can volunteer in other departments with other fantastic opportunities please apply to those listings via our main page! We look forward to hearing from you and thank you for your support!", "title": "Volunteers Needed!", "zipcode": "10018", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2763673%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "10038": [{"end": "2017-09-11", "description": "Sign your corporate group up for a volunteer event to rescue food for the hungry! During these events, your corporate group will travel to one or more of our food business partners that are ready to donate their excess food. The group then rescues this food and takes it to a nearby homeless shelter or soup kitchen. More details will be provided after contacted.", "title": "Corporate Group Volunteer Activity: Fight Food Waste and Feed the Hungry this holiday season!", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2767983%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Rescuing Leftover Cuisine Inc"}, {"end": "2017-09-11", "description": "Sign your corporate group up for a volunteer event to rescue food for the hungry! During these events, your corporate group will travel to one or more of our food business partners that are ready to donate their excess food. The group then rescues this food and takes it to a nearby homeless shelter or soup kitchen. More details will be provided after contacted.", "title": "Corporate Group Volunteer Activity: Fight Food Waste and Feed the Hungry on 9/11", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2767974%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Rescuing Leftover Cuisine Inc"}, {"end": "2017-09-12", "description": "Interested in volunteering with Habitat for Humanity, but want to learn more? Would you like to meet our staff and other volunteers before dedicating your time? Then come to a Volunteer Orientation! We&rsquo;ll cover what you can expect as a volunteer - from working in the office to building on one of our sites - what projects we&rsquo;re currently working on, and much more. ***NOTE: It is not required to attend an orientation before signing up to volunteer with the organization. Spots are limited! Follow these steps to RSVP: 1) Create a new account on volunteerhub or sign in with your previously creating log in: http://habitatnyc.volunteerhub.com/ 2) After logging in, scroll down to September 12th or select \\\"Volunteer Orientation\\\" from the homepage 3) Select \\\"Volunteer Orientation\\\" and click the green \\\"Sign Up\\\" button 4) You will receive a confirmation email with instructions If you are signed up but are unable to attend, please notify us by 3pm the day before via telephone or e-mail ( volunteer@habitatnyc.org or 212-991-4000 ext 335).", "title": "Habitat for Humanity NYC- Volunteer Orientation", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2611487%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Habitat for Humanity New York City"}, {"end": "2018-05-15", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS 126 Jacob August Riis, Manhattan)", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2449367%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}, {"end": "2018-06-23", "description": "Drawing And Truth (DAT) is a Mentoring Program for Middle School and High School aged youth (13-18 year-olds) who have experienced or witnessed trauma. It runs throughout the school year from Mid-October to the end of June on Saturdays, typically from 12pm - 4pm. DAT is unlike typical Mentoring programs where Mentor & Mentee are assigned as pairs. Instead, DAT works as a social group where participants do fun and educational activities together including drawing/painting, crafts, ice skating, bike riding, etc. Mentors select and plan the activities based on the interests of the youth and the resources that are available in New York City! Being a DAT Mentor is one of the most fun and rewarding volunteer positions at Womankind because it is structured as a full year position with the chance to return cycle after cycle. Volunteers who are selected to be a DAT Mentor develop lasting connections with the youth and with fellow Mentors! For a full description of the group and expectations & requirements for the mentor role, please contact Kathy Tran at ktran@iamwk.org.", "title": "Make a Difference in a Teenager's Life - Become a Drawing and Truth Mentor!", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2152062%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Womankind, Rising Above Violence"}, {"end": "2018-06-29", "description": "The Refugee Resettlement Office of Catholic Charities Community Services provides assistance to refugees and asylees from diverse backgrounds, offering a variety of case management, employment, and educational services that help clients settle into their new community. To further help us with this goal the AmeriCorps VISTA member will be responsible for engaging volunteers, interns and parish/community/corporate volunteers to work with staff and support the programs. To read the full description, visit: http://www.catholiccharitiesnyvolunteer.org/NEW!", "title": "AmeriCorps VISTA – Coordinator of Volunteers for New Americans", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715219%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Catholic Charities, Archdiocese of New York"}, {"end": "2017-12-31", "description": "We are looking for volunteers with dance experience to help run a weekly movement-based creative workshop for students with intellectual disabilities in Fort Hamilton, Brooklyn, Wednesdays from 11-12. This opportunity takes place over 12 weeks, for a small group of middle and high school students. The workshop will culminate with an informal showing. We are also looking for volunteer yoga instructors in all boroughs.", "title": "Looking for Dance Teachers and Yoga Instructors", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2556600%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "AHRC NYC"}], "10118": [{"end": "2017-12-31", "description": "Do good for your community while using your professional expertise. Work with talented peers on a rewarding non-profit cause related program. The Rare Genomics Institute is making a difference. RG is a nonprofit organization that helps families in need of genome research. The Human Resources Generalist will provide HR support related to staff trainings, webinars, special staff events, and culture building. Position Responsibilities: Trainings: Develop, plan, and manage training programs and services Coordinate staff professional development program Develop new training initiatives and implement skills enhancement programs Events: Plan staff outings and events and manage the planning,communications, execution and follow-up strategies for each event Foster team-wide culture through all-staff gatherings Create events that broaden staff engagement Recommends employee relations practices necessary to establish a positive employer-employee relationship and promote a high level of employee morale and motivation Qualifications: Bachelor's degree with a concentration in Human Resources or other related field of study is preferred. Three to five years of experience required. Strong administrative skills with excellent organization and attention to detail Possesses strong interpersonal skills Other duties as assigned by the Human Resources staff", "title": "Human Resources (Culture Building /Employee Engagement)", "zipcode": "10118", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2204431%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Rare Genomics Institute"}], "10035": [{"end": "2018-05-15", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS 7 Samuel Stern, Manhattan)", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2449360%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}, {"end": "2018-05-21", "description": "Reading Partners is currently recruiting volunteers for fall 2017! Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning. The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner this fall- make a lifelong impact on a child (NYC)", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2716378%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}, {"end": "2018-06-16", "description": "We are currently accepting applications for Volunteer Dance Teachers for our Fall 2017 Program at Groove With Me, Inc. Groove With Me is a free dance school for girls in East Harlem. It engages girls during the idle out-of-school hours when 90% of youth violence occurs; and seeks to decrease teen pregnancy, truancy, crime, violence, prostitution, substance abuse and gang related activity. East Harlem has the highest unmet need for after school programming of any neighborhood in NYC. By volunteering you provide much needed out-of-school time safety - and arts programming. Classes are held after school between the hours of 4:00pm-8:00pm Monday through Friday and Saturdays 11:00am-3:00pm. If you are interested in this opportunity, or for further information please give me a call at 212-987-5910 or reach me via email at beatriz@groovewithme.org Beatriz Coronel, MA Program Director Groove With Me, Inc. 186 E 123rd St NY, NY 10035 Phone: 212-987-5910 Fax: 212-987-5080 www.groovewithme.org", "title": "Volunteer Dance Teachers Needed for our Fall 2017 Program at Groove With Me, Inc.", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2678136%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Groove With Me, Inc."}], "10034": [{"end": "2017-10-22", "description": "The National MS Society is looking for volunteers to help with Bike MS: New York City&rsquo;s Rest Stop location at Inwood Hill Park! Bike MS New York City will be held on Sunday, October 22 - Rest Stop volunteers are needed from 6:45am-11:00am at Inwood Hill Park. We welcome groups and individuals of all ages and abilities from Inwood, Washington Heights and the Bronx to join us as volunteers! Bike MS: New York City is a unique experience - the 30 mile route around Manhattan is completely traffic free. The 50 and 100 mile rides allow cyclists to ride through the Holland Tunnel traffic free. More than 300 volunteers are needed to make this event a success! If you are interested in volunteering, please review the position below and register online here: www.bikeMSnyc.org Rest Stop Support Team: Date: Sunday, October 22, 2017 Time: 6:45am-11:00am Location: Inwood Hill Park Description: Volunteers will be assigned to the Inwood rest stop which is along the Bike MS: New York City route. Volunteers will distribute water, snacks and cheer on walkers! If you have any questions, please contact: Amber Young - Manager, Volunteer Engagement at Amber.Young@nmss.org or 212-453-3258", "title": "Rest Stop Volunteers Needed at Inwood Hill Park for Bike MS: NYC!", "zipcode": "10034", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715322%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National MS Society - New York City"}], "10011": [{"end": "2017-12-01", "description": "Looking for a Production Coordination for CFF 5th year anniversary Production Skills: Multitasker, Fast-learner, Curious Tasks: Scheduling, Crew organizer, Volunteer Lead Must be available until 1 month after the Festival! Work with a fun festival crew! This position is not PAID.", "title": "Chelsea Film Festival 5th Edition: Production Coordinator Needed", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2764232%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Film Festival"}, {"end": "2017-10-25", "description": "YOU could be selected to be an important part of a fabulous event Shatter Stigma at The Gallery at the Dream Downtown Hotel in NYC. This event by SARDAA is a fundraising event to help support SARDAA programs and anti stigma initiatives to improve lives affected by schizophrenia-related brain disorders. Cocktail reception, ors d'oeuvres, live entertainment and more. We require dedicated, focused, energetic people to volunteer their time to help with set up, help with auction items, assisting guests with bids, event clean up.", "title": "Event Volunteer", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2625994%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "SARDAA"}, {"end": "2017-11-30", "description": "The Social Media Community Manager will be in charge of all Chelsea Film Festival social media assets (facebook, twitter, instagram, youtube) and newsletter, developping possible partnerships, assisting Executive Director and Communications Team in scheduling meetings for social media campaigns. Must be social media savvy and flexible. This position is not paid.", "title": "Chelsea Film Festival looking for Social Media Community Manager", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2746634%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Film Festival"}, {"end": "2018-02-18", "description": "GRANT WRITER The Grant Writer is primarily responsible for developing and writing grant proposals to foundations and other grant-making organizations, and will persuasively communicate CSP's mission and programs to potential funders. Reporting to the Executive Director, the Grant Writer will assemble and submit grant requests, establish and maintain personal contact and relationships with foundation contacts, conduct prospect research, and maintain a calendar of submissions and other deadlines. To get a response please send RESUME.", "title": "Grant Writer", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D643540%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2018-02-18", "description": "Computer/It - Tech Support - All aspects of tech support for the organization including maintenance, troubleshoot, specially ANTI-VIRUS, and optimal functioning of the system. Must have experience with Microsoft and Windows systems. To get a response please send RESUME .", "title": "Computer support", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D601216%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2018-02-18", "description": "Education Program Coordinator - Chelsea Sculpture Park. New York , New York. Basic Requirements: BA or MA in related discipline required (Art Education) Post college professional work experience required Demonstrated experience with art education or other informal art programming and curriculum design Demonstrated knowledge of Microsoft computer programs and excellent presentation skills Job Responsibilities: Coordinate and develop of new partner-institution/organization relationships and curriculum Provide leadership and direction towards the design and implementation of art educational programming and curriculum in compliance with national and state learning objectives, accreditation guidelines, and innovative art methodologies Establish and grow professional relationships with constituents, peers, associations and partner schools To Apply: Please submit your resume with cover letter and references to the contact information listed below. Set against the backdrop of the Hudson River, Chelsea Sculpture Park will offer fine art for the public to experience, up close and outdoors. The park's mission is to provide an aesthetic oasis in the Chelsea Cove section of Hudson River Park located between 22nd and 26th Streets, just steps away from the world-class Chelsea Art District. We are looking for a Education Program Coordinator to assist the founder and executive-director of Chelsea Sculpture Park develop and implement an educational program foccusing on the exhibitions of the sculpture park.", "title": "Educational Program - Coordinator", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D481515%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2018-02-18", "description": "Chelsea Sculpture Park New York, New York Are you considering a future in arts administration, nonprofit management, fundraising, arts education or a related field? This is a great opportunity to gain experience working at a brand new nonprofit arts organization that is dedicated to building a sculpture park on the banks of the Hudson River Park. Gain invaluable insights and learn fundraising strategies as part of a dynamic Development team. Assist with prospect research, special events, direct mail, and our donor database, as well as pursue special projects. Internship credit may be arranged through your academic program. The ideal candidate will be organized and detail-oriented, and have good computer skills. Those with prospect research experience and graduate students in arts administration and arts education are especially welcome. The hours for this position are flexible within the work week. A modest stipend is available. To Apply: Please be sure to include current contact information so that we may arrange an interview. To get a response please send RESUME .", "title": "Development Intern", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D297980%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}], "10036": [{"end": "2017-12-14", "description": "CentroNYC, a non-profit organization serving the immigrant community in New York City, seeks volunteer ESL teachers for its term beginning September 18, 2017. Classroom experience welcome but not required. New volunteers will partner or be mentored by experienced teachers. Time commitment: one night per week teaching plus the time required for lesson preparation (usually every other week.) Classes meet Mondays, Wednesdays, and Thursdays from 6:15-9:00 p.m. in midtown Manhattan. Classes begin Monday, September 18, 2017, and there will be a pre-semester staff meeting on Monday evening, September 11. Please respond by email to info@CentroNYC.org AND cbarker789@gmail.com.", "title": "Volunteer Adult ESL Teacher", "zipcode": "10036", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2566379%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Centro NYC"}, {"end": "2017-10-01", "description": "Join Shatterproof as we Rise Up Against Addiction! Shatterproof, a national nonprofit organization dedicated to ending the devastation addiction causes families, is in need of volunteers at our Rise Up Against Addiction 5K in New York City!! If you've been touched by addiction, then you know how devastating this disease really is. Together, we can make a difference! We have lots of different positions to choose from and this event is sure to be a fun experience for all involved!", "title": "Rise Up Against Addiction 5K NYC", "zipcode": "10036", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2699936%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Shatterproof"}, {"end": "2017-10-14", "description": "The Lupus Research Alliance is hosting the 14th Annual New York City Walk with Us to Cure Lupus on Saturday, October 14th at the Intrepid Sea, Air & Space Museum. Volunteers are the key to success and we are looking for energetic indivdiuals! Whether you want to walk, aren't able to walk, or just want to help, there's something for you. Some examples of volunteer opportunities are food & beverage distrubition to the participants, registration/check-in and cheering on our Walkers. Walk Day volunteers will receive a Volunteer T-Shirt and the gratitude of the Lupus Research Alliance staff. We hope to see you there! Visit our official website at www.lupuswalknyc.org or call (646) 884-6030 for more information.", "title": "2017 New York City Walk with Us to Cure Lupus", "zipcode": "10036", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2708800%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Lupus Research Alliance"}], "10031": [{"end": "2017-12-22", "description": "The City Tutors (CT), the volunteer tutoring program at the Colin Powell School, is looking for two writing embedded tutors to provide academic support for an Introduction to Sociology (Soc 105) jumbo course. (Course likely will have 100+ students.) Classes meet twice a week, but tutors only need to attend one of those days weekly. Much of the tutoring support will be done virtually. Tutors will coordinate with each other, and work closely with the instructor. Tutors will be supported through the process by the City Tutors staff. We will either support the Mondays and Wednesdays course from 2 - 3:15 pm, or the Tuesdays and Thursdays from 9:30 - 10:45 am. Let us know which course date works for you. Our course support will be determined based on tutor time availability. This is a great opportunity especially for students who are majoring (or have already earned a degree) in sociology, or who are social science majors/minors. All majors are welcome to apply. Tutors will get to enhance their understanding of writing composition and gain professional experience and references that they can leverage for future opportunities. As a tutor, you would identify students struggling, provide feedback to the instructor regarding students' concerns and difficulties that can lead to changes in future lessons, conduct virtual study groups, and allow students to submit parts of their writing for review before final drafts are submitted. All tutors are also expected to complete a four session comprehensive, professional training regimen over the course of the semester. 6 hours of live training, plus another hour and a half for orientation. This is a commitment of 7.5 hours of in person training, and 4 hours of supplemental training for a total of 11.5 hours of training over the course of the Fall semester. Training days will be determined based on your schedule and that of the Tutor Training Coordinators. CT's embedded tutoring program has been successful in helping students gain access to support that they otherwise would not have received, given their limited time spent on campus. Having a tutor in the class early in the semester will allow us to employ strategies to reduce withdrawals and student failure rates. Your work with us would help the students&rsquo; overall subject area performance, and help us improve this educational support model, reaching more students and departments with comprehensive academic support. To apply, you must: Have received an A- or A in the introduction to the subject course you are applying to tutor Have a GPA at or above 3.2, or have completed a degree program Submit monthly reports, keep a log sheet of any tutoring appointments done outside of class, and regularly communicate with the tutor training coordinator. City Tutors receive professional development assistance, including: Day and evening support with resume, cover letter, and personal statement development Assistance with identifying and applying to jobs, internships, scholarships Access to City Tutors' mentorship program through which you will be connected to industry professionals in areas you are interested in", "title": "Embedded Tutoring Support for an Introduction to Sociology Course at CCNY", "zipcode": "10031", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2766726%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The City Tutors"}, {"end": "2018-05-15", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS 192 Jacob H. Schiff, Manhattan)", "zipcode": "10031", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2449385%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}, {"end": "2017-12-15", "description": "Academic tutors support the club during our daily Power Hour. Each age group meets in the library for at least an hour where they have an opportunity to do their homework, access academic support in the form of tutors and academic activities. What You&rsquo;ll Do Support academic enrichment activities, including homework help and tutoring; Provide individualized and team-wide support all after-school program activities and initiatives; Serve as a role model and build positive relationships with youth; What We&rsquo;re Looking For Strong command of one or more of the following academic subjects: English, Math, Science, and/or Social Studies Previous experience working with youth; Possess creativity, enthusiasm, initiative, flexibility, and patience; Solid oral communication skills; Ability to make a consistent, weekly commitment; Benefits Gain invaluable experience Receive an optional professional reference upon completion of your service term; Join an incredible community of passionate staff and volunteers. Minimum Commitment: 1-2 hours a week per semester. When: Monday - Friday Time: 3pm-6pm", "title": "Academic Tutor", "zipcode": "10031", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2766762%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Boys & Girls Club of Harlem"}, {"end": "2017-12-15", "description": "Google CS First Guru The Boys and Girls Club of Harlem is committed to providing access and opportunity for students throughout the area to reach their full potential. The Boys and Girls Club reaches students at 5 sites across Harlem. Our mission for the CS program is to introduce kids to STEM programs at a young age. This is designed to peak an interest so students will one day enter the career field of STEM. Volunteers are crucial to the advancement of these goals. We appreciate every volunteer who comes through our doors and provide you the best skills to succeed with the organization. CS first volunteer BGC Harlem is seeking a dedicated individual to teach a computer science program to students during the summer We will provide all training necessary to make sure you are confident with your skills before placing you in the classroom We understand you may have a very busy schedule, however, we would ask for 2 hours a day 1-2 days per week. Please fill out the attached form and email it to volunteer@harlembgc.org College and high school students looking for volunteer hours are strongly encouraged to apply. This opportunity operates at 3 sites within West and Central Harlem. The program runs Monday and Wednesday 3pm-4pm and 4pm-5pm. Tuesday, Wednesday, Thursday from 2:20pm-3:30pm Requirements: Volunteers must be older than 16 under the age of 18 requires parent permission. Passing a background check is required.", "title": "Google CS First Guru", "zipcode": "10031", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2749635%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Boys & Girls Club of Harlem"}], "10030": [{"end": "2018-05-15", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS 123, Manhattan)", "zipcode": "10030", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2449391%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}, {"end": "2018-05-15", "description": "Reading Partners needs volunteers like you to provide students in under-resourced elementary schools in your community with the proven, individualized reading support they need to read at grade level by fourth grade. Reading is the foundation for all future learning.The ability to read transforms lives and can empower children to reach their full potential. Research shows that when students can read at grade level by fourth grade, they have a greater opportunity to succeed in school and in life. With your help, we can equip students with the foundational skills they need to read at grade level. Each week, you will meet one-on-one with your student every week to help them develop strong literacy skills and discover a passion for reading. We'll provide a structured curriculum, in-person training, and ongoing support to help your student thrive. Rigorous research has proven that Reading Partners significantly increases reading proficiency. No teaching experience required and anyone over the age of 14 can volunteer. Flexible Monday to Thursday volunteer times between 9am and 5pm. Visit our website at www.readingpartners.org/volunteer to sign up and learn more.", "title": "Become a reading partner- make a lifelong impact on a child (PS 175 Henry Granet, Manhattan)", "zipcode": "10030", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2449375%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Partners"}], "10014": [{"end": "2017-09-16", "description": "Hudson River Park presents SUBMERGE- a FREE, day-long science extravaganza devoted to raising awareness about our coastal waters. Celebrate local marine science through hands-on science activities, catch-and-release fishing, science stage events, kayaking and more! Interactive demonstrations will bring marine science and engineering topics to life, inspiring audiences of all ages. Volunteer for SUBMERGE on SATURDAY, September 16th with a raindate on Sunday September 17th ! Volunteers are needed for morning shifts (10:00-2:00), afternoon shifts (1:30-5:30) or Full Day shifts as our All Star Volunteers (10:00-5:30) to work at the following Volunteer Stations: Welcome Tent River Ranger Kid Zone Plankton World Tent Science Stage Photo Area Event Day Outreach AND MORE! When: Saturday, September 16th 2017 (with a rain date on Sunday, September 17th!) Where: Hudson River Park&rsquo;s Pier 26 at North Moore Street, just passed the West Side Highway Volunteers will receive, lunch, a free T-Shirt, and a day of FUN! To sign up as a SUBMERGE Volunteer or for more information email ksiegel@fohrp.org or cal 347-515-2242", "title": "Hudson River Park’s SUBMERGE: NYC Marine Science Festival", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2129599%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Hudson River Park Trust"}, {"end": "2018-04-21", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO Schoolis a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Chinese (both Mandarin and Cantonese) in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Chinese speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak both Mandarin and Cantonese is preferred. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Chinese Translators Needed!", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770792%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project Spanish Translator (Saturday Volunteer) GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Programming: How YOU Can Help GO Schoolis a focused, seven-month Saturday program with a staff of certified teachers and skilled volunteer tutors. Students attend on Saturdays between October and April for a half-day of focused academic skill-building. Professional teachers lead lessons, support volunteer tutors, and communicate with parents to keep them informed about their child&rsquo;s progress. Volunteer tutors commit to a semester of volunteering in a classroom and mentor their students to provide consistent and individualized needed to succeed. Volunteer translators provide critical communication support between our GO families and our staff. Interpreters are responsible for translating English into Spanish in order for our program to communicate with our families regarding program updates and their child&rsquo;s academic & social-emotional progress/needs. Specific Translator duties will include: Saturdays Assist with parent meetings, workshops and orientations for Spanish speaking families. Provide interpretation for our families, including any cultural/linguistic references that may need to be explained. Maintain our families&rsquo; right to confidentiality. Collaborate with GO Staff, Volunteer Manager, Head Teachers and GO Families Staff to address and respond to our students&rsquo;/ families&rsquo; needs. Time Commitment The position would require a commitment to our GO School Saturday program. We can accommodate a semester schedule or a full year commitment. Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 13 Saturdays 9am - 12:45 pm GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications: Excellent verbal and written communication skills. Interest in strength-based collaborative work, education and social services. Ability to speak Spanish. Prior experience in simultaneous and consecutive interpretation is a plus. Personal Attributes: The ideal candidate is exceptionally intelligent, warm, engaging and energetic. He or she also: Sees the possibilities as opposed to the obstacles and is creative and tenacious in solving problems. Enjoys working with others in a collaborative, creative environment. Has a strong work ethic and high standards for his/her own work and the work of others; is flexible and has a lively sense of humor. Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Saturday Spanish Translator Needed!", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2770749%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2018-04-21", "description": "GO Project: Who We Are and What We Do The GO Project shapes the futures of low-income New York City public school children by providing critical academic, social and emotional support starting in the early elementary years. GO provides year-round educational and family support services to children who are performing below grade level and equips them with the confidence and skills needed to succeed at school, at home and in life. GO School Tutoring: How YOU Can Help During the GO School Saturday program, a professional teacher models a lesson, activity or project to a classroom of students. Volunteer tutors continue to work with small groups of (2) to (4) students on the lesson providing individualized attention which allows the students to thrive. Tutor Responsibilities Tutor small group of students in grades 1 st-8 th who are in need of academic intervention under Head Teacher&rsquo;s guidance Punctual and consistent attendance; no more than 3 absences permitted per session. (Session 1: Oct-Dec, Session 2: Jan-April) Actively and enthusiastically participate - supporting instruction and engagement Help prepare, record and put away classroom materials Ongoing communication with Head Teacher regarding children&rsquo;s progress &/or concerns, and with the Director of Community Engagement regarding overall volunteer experience. Time Commitment Session I: October- December 2017, 9 Saturdays 9am - 12:45 pm Session II: January - April 2018, 14 Saturdays 9am - 12:45 pm Attend mandatory orientation and training prior to start of session. *You can choose to be a Committed Volunteer to come each Saturday with 3 allowed absences per session, or a Floater Volunteer to come on the Saturdays that you are available. GO School Fall Session Dates 2017 Oct 14, 21, 28 Nov 4, 11, 18 Dec 2, 9, 16 GO School Spring Session Dates 2018 Jan 6, 20, 27 Feb 3, 10, 24 March 3, 10, 17, 24 April 7, 14, 21 Locations You can choose to tutor our students at one of the following 6 locations: Manhattan Locations: Avenues-the World School (1st - 5th Grade): 259 10 th Avenue, between 25 th and 26 th Streets Grace Church School (1st - 5th Grade): 86 4 th Avenue, between 10 th and 11 th Streets Grace Church High School (6th - 8th Grade): 46 Cooper Square, at 6 th Street LREI (1st - 5th Grade): 272 6 th Avenue, at the corner of Bleecker Street St. Luke&rsquo;s (1st - 3rd Grade): 487 Hudson Street, at Hudson Street and Christopher Street Brooklyn Location: Berkeley Carroll (1 st - 2nd Grade): 701 Carroll Street, between 6 th & 7 th Ave Placement is based on a complimentary match between programmatic need and volunteer strengths. We will honor preferences when possible. Qualifications College students, professionals, retirees, and high school students in good academic standing. Commitment to and belief in all children&rsquo;s ability to succeed and thrive Professional work habits Benefits: How Can We Help YOU Personal gratification through enhancing the lives of young learners. Ongoing professional development and training opportunities. Leadership opportunities for sustained dedication and commitment. Being part of a vibrant and diverse volunteer community. How to Apply Application Form Cover Letter/Personal Statement explaining why you want to volunteer with the GO Project Resume (for volunteers 18 and older)/ High school transcript (for HS students) Personal reference Background check (for those 18 and older) If interested, please fill out the online form at: https://goo.gl/forms/iGs9YOzEUsNCujrk2 . The online application form can also be found on the GO Project website: goprojectnyc.org under \\\"Get Involved\\\" and \\\"Volunteer Opportunities.\\\" If you have any questions or would like more information about the available volunteer positions, please contact Emily Ong, Community Engagement Program Manager, at eong@goprojectnyc.org.", "title": "Help a Child Love to Learn: Volunteer Tutor with GO Project!", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2759090%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GO Project"}, {"end": "2017-08-31", "description": "The National Parks Conservation Association's (NPCA) Northeast office is seeking volunteers to join the NPCA staff in tabling in Christopher Park to increase awareness regarding Stonewall National Monument. This summer, volunteers will be tabling near the Stonewall Inn in Christopher Park to answer questions and provide more information to the public about the recently designated Stonewall National Monument in Greenwich Village, the first National Park Service (NPS) site dedicated to LGBT history and the site of the 1969 uprisings that sparked the modern LGBT civil rights movement. Through the end of August, we plan to reach hundreds of visitors at tables located around Stonewall from 3-6pm on weekdays and 12-6pm on weekends. Engage with the public and help us celebrate the upcoming one-year anniversary of Stonewall's National Monument designation! Responsibilities: Talk to passers-by and share the story of Stonewall Discuss the recent designation of the Stonewall National Monument, and provide answers to basic questions Get feedback from visitors about their ideas for the future of Stonewall National Monument Maintain sign-up list for people interested in getting on the park's mailing list Direct the public to a website where they can learn more Set up and break down tabling materials Requirements: Be friendly and outgoing, ready to engage the public Interest in LGBT rights Available for 2 or 3 hour shifts Enjoy being outside Ability to lift table and chairs", "title": "Stonewall National Monument Volunteers", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2691779%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National Parks Conservation Association"}, {"end": "2017-12-31", "description": "The National Audubon Society&rsquo;s volunteer program aims to inspire lifelong stewardship of our environment and communities, providing individuals the opportunity to develop skills needed for a successful career in conservation. Currently, volunteer opportunities are being offered in the area of Environmental Education.  Audubon invites you to become a volunteer with Audubon New York&rsquo;s premier environmental education program, For the Birds! ( FTB!) NYC.  For the Birds! is a place-based elementary education program that teaches environmental awareness and appreciation of nature through the study of birds. During multiple visits, students in grades two through six learn about their local, natural environment through indoor and outdoor lessons, field trips, and a conservation project designed to provide or enhance bird habitat in the local community.   For the Birds! volunteers will assist with the implementation of the FTB! program in New York City schools and camps throughout all five boroughs.  S/he will teach this program to multiple classes / summer camps in New York City and will also assist the FTB! Program Director with administrative duties related to the delivery and expansion of the program.  This includes, but is not limited to: curriculum development and revision, materials preparation and inventory, school set up, follow up and wrap up, and other administrative duties as needed. Volunteers will work closely with the FTB! Program Director to inspire a new generation of conservationists through the study of birds.   Interns will gain experience s in both formal and non-formal environmental education and learn valuable and transferable skills such as project management, curriculum development, volunteer management, and community engagement. ", "title": "Audubon NY's For the Birds! Education Program", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2452716%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Audubon New York"}, {"end": "2017-11-18", "description": "JOIN HUDSON RIVER PARK&rsquo;S HRPGreenTeam Gain meaningful experience working with like-minded individuals looking to beautify and maintain Hudson River Park&rsquo;s picturesque waterside landscape! This volunteer program is an exciting opportunity for community members to nurture their inner green thumb alongside their neighbors while improving public green space. Members of the HRPGreenTeam will work with our seasoned horticulture staff and participate in landscape enhancement activities including planting, weeding, pruning, mulching, trimming of ornamental grasses, addition of soil amendments, cleaning of vegetation beds, and other general gardening tasks. When: One Saturday of every month from March-October; 10AM-1PM March 25th April 15th May6th June 3rd June 17th July 15th July 29th August 12th August 26th September 9th October 21st November 18th What we provide: Safety and horticulture training, tools and equipment, Hudson River Park Volunteer T-Shirt, water, snacks, FUN! Can&rsquo;t commit to all of our events? No problem! RSVP to any or all of the Green Team volunteer days. Locations and activities will vary each month, and volunteers will get to experience the Park from a whole new perspective throughout the seasons. Space is limited, so RSVP today to volunteer@fohrp.org or call for more information (347-515-2242)", "title": "HRP GreenTeam at Hudson River Park!", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2080469%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Hudson River Park Trust"}]}