{"07103": [{"end": "2020-06-30", "description": "Volunteer and make a measurable difference in the lives of many by helping sort, organize and package items for distribution to families. This volunteer opportunity is dedicated to battling hunger and poverty in our community. Tasks may vary such as distributing food goods to Newark residents. Assist with signing in recipients before receipt of food goods, by verifying identification and receiving signatures. Volunteer Guidelines: COVID-19 Protective Equipment: Masks, Gloves, and Sanitizer will be provided Avoid touching your eyes, nose, and mouth with unwashed hands. Clean and wash your hands before, during, and after volunteering for a minimum of 20 seconds. If soap and water are not readily available, use a hand sanitizer that contains at least 60% alcohol. Need-To-Know Volunteers will receive a brief orientation upon arrival Volunteers should wear clothes they are comfortable working in Being flexible is a plus as tasks may change based on necessity Ability to lift and move potentially heavy boxes is a plus", "title": "Food Distribution in Newark", "zipcode": "07103", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3281284%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jersey Cares"}], "07960": [{"end": "2020-07-27", "description": "Becoming a peer support group facilitator at Good Grief is a unique, engaging, and transformative volunteer experience. Facilitators at Good Grief help to create a safe and empathic environment for grieving children and families after the death of a loved one by helping foster resiliency and develop healthy coping skills that will serve them for the rest of their lives. Good Grief is respected as a national leader in delivering childhood bereavement services. Since its founding in 2004, the mission of Good Grief has been to provide free and unlimited support to grieving children, teens, young adults, and their families after the death of a parent or sibling.", "title": "Become a Peer Support Group Facilitator at Good Grief: Morristown", "zipcode": "07960", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2876207%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Good Grief"}, {"end": "2020-06-30", "description": "Jersey Cares is partnering with the New Jersey Office on Aging to close the gap on a critical need during the COVID19 crisis. Volunteers are needed for grocery shopping and delivery for seniors in Ocean County, who cannot/should not leave their house. Volunteers will be able to accept flexible assignments. COVID-19 precautions in place, all deliveries are performed using contact-less practices, including front door drop-off. Need to know: Volunteers must agree to background check Volunteers pre-pay for the groceries and are reimbursed (with proof of delivery) via online payment.", "title": "Shopping For Seniors In Morris County", "zipcode": "07960", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3286568%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jersey Cares"}], "07480": [{"end": "2020-08-12", "description": "Particularly needed Thursday evenings /nights. Thank you. We will run your license abstract. Please call Betsy at 862.200.5125.", "title": "Drive women to appointments and meetings", "zipcode": "07480", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2885019%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Strengthen Our Sisters"}], "07104": [{"end": "2020-06-27", "description": "The New Jersey PCOS Challenge 5K Run/Walk in Newark is part of the country's largest national campaign raising awareness and funds to help fight polycystic ovary syndrome (PCOS). PCOS affects up to 15% of women in the U.S. and hundreds of millions globally. It is one of the most critical, under-diagnosed, underfunded and neglected areas of health, which can lead to lifelong complications, infertility, type 2 diabetes, cardiovascular disease, cancer and other life-threatening conditions.. By supporting the PCOS Challenge 5K Run Walk, you will become a champion for one of the most important issues affecting women&rsquo;s health. Your support will make a huge difference in the lives of tens-of-thousands of women as proceeds from the PCOS Challenge race will go toward PCOS education and support programs, research, health screenings, grants, as well as increasing awareness and public support for those with the disorder. Photography and videography volunteers will help capture event shot such as: Registration Opening Ceremony Warm Up Large Group Photo Race Start Team Photos Finish Line Photos Medals Ceremony Hydration and light snacks are provided for volunteers on event day. Fundraising We also have a need for assistance with fundraising for the PCOS Challenge 5K Run/Walk. We have a number of helpful tools, resources, scripts and incentives for fundraisers on the pcos5k.org website that make fundraising easy and fun!", "title": "New Jersey PCOS Challenge 5K Run/Walk Photography/Videography Volunteer", "zipcode": "07104", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3265677%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "PCOS Challenge: The National Polycystic Ovary Syndrome Association"}, {"end": "2020-06-27", "description": "The New Jersey PCOS Challenge 5K Run/Walk in Newark is part of the country's largest national campaign raising awareness and funds to help fight polycystic ovary syndrome (PCOS). PCOS affects up to 15% of women in the U.S. and hundreds of millions globally. It is one of the most critical, under-diagnosed, underfunded and neglected areas of health, which can lead to lifelong complications, infertility, type 2 diabetes, cardiovascular disease, cancer and other life-threatening conditions.. By supporting the PCOS Challenge 5K Run Walk, you will become a champion for one of the most important issues affecting women&rsquo;s health. Your support will make a huge difference in the lives of tens-of-thousands of women as proceeds from the PCOS Challenge race will go toward PCOS education and support programs, research, health screenings, grants, as well as increasing awareness and public support for those with the disorder. The organization is seeking 15 volunteers to help with the event. Duties may include: Assisting with event setup and breakdown Directing participants to the registration and race start areas Checking in attendees Handing out race packs, bibs and T-shirts Timekeeping Handing out refreshments Assisting PCOS Challenge staff with day-of logistics and award ceremony Hydration and light snacks are provided for volunteers on event day. Fundraising We also have a need for assistance with fundraising for the PCOS Challenge 5K Run/Walk. We have a number of helpful tools, resources, scripts and incentives for fundraisers on the pcos5k.org website that make fundraising easy and fun!", "title": "New Jersey PCOS Challenge 5K Run/Walk General Volunteer", "zipcode": "07104", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3265675%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "PCOS Challenge: The National Polycystic Ovary Syndrome Association"}], "10002": [{"end": "2020-08-09", "description": "We are looking for some very special people who have the passion, time, and especially, the illustration skills needed to help us populate our proprietary reading materials child-friendly, colorful, happy, creative and otherwise wonderful drawings that potentially millions of children will see on their path to learning how to read. Have you ever wanted to do something AMAZING to change the world but didn't know where to start? Here is an opportunity to help underprivileged children, to help under-served children, to help ALL children displaced from school due to COVID-19, and even to help many adults who can't read. We are looking for three, very special people, who have the skills, expertise, experience, passion, and time to be part of something amazing that is about to fundamentally change the lives of millions of children. Right now, millions of children have no hope; but soon, they will have the opportunity to learn how to read, which, in turn, will open a window to education and to a world of potential for them that, not only, has never been opened before, but that has never even been seriously contemplated as a potential reality. What we are talking about is an adaptive learning, gamified smartphone app, called FUNetix, that can literally, teach a child how to read, in the comfort of their home, in an average of just 12 hours of total use time! We are the American Youth Literacy Foundation, and we have been teaching children how to read for nearly 12 years! We have been developing this app for about two years, and this year we will launch this incredible smartphone app in the App Store and on Google Play by Thanksgiving, 2020, to help save millions of children from a lifetime of illiteracy! Already, there are millions of children who are struggling to learn how to read. Already, there are millions more who have given up on reading and are destined to go through life either completely illiterate, or with semi-literate skills at best. And now with the displacement of tens of millions of children from school, for an indeterminate amount of time , the loss of reading capacity of the next generation presents a new, crisis moment in American education Â and a very real threat to the future success of millions of young students. We are partnered with an engineering team that was one of the five $1 million finalists in the XPrize for Global Learning competition (the winners of which were announced this past May), which was a worldwide competition for app \\\"design and development\\\" teams from around the world to design, build and deliver a tablet-based app to children in remote villages in Africa which could teach them how to read and do basic math (children of all ages, most of whom had never been to school before in their lives). The curriculum that our app is based on is a patented reading decoding system, and is so effective at teaching children how to read, that it usually only takes 4-6 hours for them to understand the basic learning tools, and another 4-6 hours for them to reach a 2nd grade reading level. Compare this to so many of our students who have been in the public school system for 6 years and still can't spell the word \\\"the.\\\" Compare this to millions of students who have dropped out of school, primarily because they can't read (more than 10 million per decade). More than 20 million children in grades 3-12 in America's public schools today can't read! Our organization is an 11 year old, nationwide, charitable 501 c 3 non-profit. We started out as a tutoring program and we still provide one-on-one tutoring. But our focus has always been on finding a scalable solution to the literacy crisis in America. With the rise of the smartphone and the amazing penetration of this powerful tool (currently estimated at 80%), even into the most impoverished communities, we feel that the answer we have been searching for IS in the form of an app. So for the past several years we have been working to convert our amazing reading curriculum, that teaches children how to read in an average of just 12 hours, into an app that teaches children how to read in about the same time. And this is where you come in. The App is comprised of approximately 2,000 unique screens, each of which is fully narrated. After the child learns the fundamentals of letters and sounds and how to blend sound symbols to form words and sentences (using a super-child-friendly, phonetic code called 21E), we transition them to English, where we utilize our patented diacritic decoding system to introduce them to the irregular letter patterns found in English spelling. From there, we continue to increase students' awareness of the various letter patterns and combinations, while simultaneously introducing them to more and more complex sentences, stories and interactive, fiction and non-fiction content. As students progress in their reading capability, we begin to introduce primers, books, stories, games, puzzles and other content that will be embedded within the learning modules AND that children will have access to in our \\\"Wonderful Content Library\\\" that is unlocked after they have finished the 12-hour structured curriculum. There's much more to tell. You can read more about our story and about us on our website at www.FUNetix.org and at www.YouthLit.org . We are looking for some very special people who have the passion, time, and especially, the illustration skills needed to help us populate our proprietary reading materials child-friendly, colorful, happy, creative and otherwise wonderful drawings that potentially millions of children will see on their path to learning how to read. If you wish to be considered for this opportunity to be one of volunteer children&rsquo;s book illustrators, please send us a sample of your artwork by replying to this listing. When you reply you will receive an auto-reply email containing an attached pdf. Follow the instructions on the pdf to illustrate ONLY ONE of the two story samples. (Each sample contains 2 screens, so you will be illustrating 2 screens from the same story.) Send your samples to info@FUNetix.org and we will respond to you if we choose your illustration. EVEN IF we don&rsquo;t choose you to illustrate one of the sample stories, we may still contact you to illustrate one of our many other stories or books. We are looking for intelligent, creative, enthusiastic, cheerful, optimistic individuals who can present a \\\"look and feel\\\" to children ages 5-9 that is happy, not scary; uplifting, not sad; bright and colorful, not dark or ominous; cute or whimsical, or otherwise conveying a positive outlook on the world. Thank you! We hope this opportunity finds you at the right place and the right time to make a difference and an impact, in an amazing way, for millions of children who are waiting for someone, or something, to lead them out of a life of impoverishment and into a future of unlimited possibility and potential through literacy. We look forward to seeing your work. All ages are welcome to contribute! Mr. R. Kali Woodward Founding, Executive Director", "title": "Manhattan: Artists / Children's Book Illustrators: Help Solve the Literacy Crisis", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3291131%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "American Youth Literacy Foundation"}], "10040": [{"end": "2020-06-07", "description": "2020: Eighteenth Annual Drums Along the Hudson A Native American and Multicultural Celebration Sunday, June 7th, 2020- Inwood Hill Park 11am to 6pm - Rain or Shine. FREE The 18th Annual DRUMS ALONG THE HUDSON(r): A Native American and Multicultural Celebration will take place on Sunday, June 7, 2020 in Upper Manhattan&rsquo;s Inwood Hill Park from 11:00 am until 6:00 pm, rain or shine. This event is free to the public and is presented by Lotus Music & Dance in collaboration with the New York City Department of Parks & Recreation, sponsored in part by the New York City Department of Cultural Affairs and the New York City Council Member Ydanis Rodriguez. The host for the event will be Sandra Bookman, weekend anchor for WABC-TV and host of \\\"Here and Now\\\". The afternoon host will be Patrick Riley Pop Culture Expert/Blogger. During the day, we take time to honor individuals and organizations for their contributions to environmental and humanitarian causes.", "title": "Drums Along the Hudson: A Native American & Multicultural Celebration", "zipcode": "10040", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3273261%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Lotus Music and Dance"}], "10029": [{"end": "2020-07-09", "description": "We need a volunteer to assist every other Thursday preparing food bags for children in our after-school program who are learning at home virtually. May also assist in preparing other items for these children, like donated art supplies or other items.", "title": "Urgent! Help Prepare food bags every other Thursday for children in our after-school program", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3284726%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "LSA Family Health Service"}], "10007": [{"end": "2020-06-28", "description": "The Scientist-in-Residence (SiR) program matches scientists with New York City public school teachers to create and implement year-long STEM projects with students. Through this program, you can inspire curiosity and excitement about STEM topics, and positively influence the career aspirations of students from underserved communities. You&rsquo;ll receive training and hands-on experience in teaching methods and strategies, and get the chance to develop your own mentorship skills! For more information and to apply, visit: www.nyas.org/sir Qualified Scientists are: Graduate students, postdocs, or professionals from STEM disciplines who are interested in improving their pedagogical and communication skills and expanding teaching experience Located within commuting distance of New York City and/or willing to travel within the five boroughs Available and committed to attend all orientation, training, and meetings Individuals with a passion for serving their communities and inspiring the next generation of scientists and thinkers Upon completion of the program, each scientist will be eligible for: One-year complimentary New York Academy of Sciences membership $500 stipend $100 travel reimbursement Important Dates for 2020: June 28: Applications due July 30: Scientist Orientation August 27 & 28: Summer Training September - April: In-Class Project Implementation (at least 10 school visits during school days 8am-3pm)", "title": "Inspire a love of science in students by joining Scientist-in-Residence", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3284592%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The New York Academy of Sciences"}], "11201": [{"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are looking for a highly talented and experienced writer to work on A Free Bird&rsquo;s 2020 Magazine featuring the stories of children with cancer and their journeys. This is a volunteer freelance position where you will be able to work from home. Responsibilities Write content for A Free Bird 2020 Magazine Work as part of a team with other writers, photographers, illustrators and marketing specialists Collaborate with leadership on ideas Qualifications Experience at a print or digital magazine preferred Attention to detail A strong command of the English Language Ability to communicate effectively", "title": "Magazine Writer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254868%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are looking for a highly talented and experienced Game Designer/Level Designer to work out of an art educational mobile game for the children to learn all kinds of arts. Responsibilities Develop Key art images for various games Develop environment and character illustrations from concepts and sketches to finished products. Qualifications Experience in building story-driven linear levels with dynamic/interactive/scripted features. Previous experience working as a level designer. Passion for games with excellent communication skills. Previously launched mobile game design experience is a big plus Preferably a rising Junior Skills Experience with either casual or children&rsquo;s games Knowledge and passion for Art History Experience with Unity a plus", "title": "Game Designer / Level Designer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254866%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are looking for a highly talented and experienced illustrator to work on an art educational video game for children. Responsibilities: Develop key art images for various games. Develop environment and character illustrations from concepts and sketches to the finished product. Qualifications: Passion for video games, art and storytelling. Working knowledge of Illustrator, Photoshop and After Effects Working knowledge of interface design a plus Preferably a rising Junior Skills: Exceptional traditional life drawing and painting skills. Knowledge of anatomy, perspective, composition, and use of color is essential. Exceptional sketching ability for developing illustration concepts.", "title": "Illustrator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254859%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Responsibilities: Works specifically to develop organizational awareness and increase channels of communication between faculty, donors, and interested individuals through social media platforms and management of web content. Will be managing 5-15 volunteers/interns within the Graphic Design system. Implementing new ideas, flyers, posters, social media content, brochures, etc. to keep updating event and news stories ideas for the organization. Overall Responsibilities: -Writing and editing content for digital media and various social media platforms. -Reporting on current events and programs at AFB. -Assist with the creation of pictures, videos, and/or audio files. -Updating digital content and the presentation and layout of information periodically or when necessary. -Create an archive of promotional images and materials for use. -Understand and relay organization&rsquo;s mission effectively. -Manage and maintain Graphic Design Team and System. -Effectively reaching daily, weekly, and monthly goals. -Must support and maintain mission goal and statement of organization. Competencies: -Interest and/or proficiency in digital media, particularly social media including but not limited to facebook, twitter, and instagram. -Background in marketing, communication, multimedia communication, journalism, PR and/or video production or related fields. -Ability to adapt to new and ever changing forms of digital media. -Excellent writing skills and ability to pay attention to detail with strong organizational skills. -Experience with Adobe, photography, video and audio production is preferred.", "title": "Multimedia Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254856%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Overall Responsibilities: Coordinates and implements key organizational wide marketing strategies and activities within the marketing department. The Marketing Coordinator will create corporate brand awareness, work closely with the PR department to coordinate events, media coverage, also relies on limited experience and sound judgement to plan, execute and accomplish objectives. This is a six month commitment. Responsibilities: -Attends all meetings of the Organization at least weekly. -Must support, respect and maintain mission of organization. -Build and maintain relationships with resources, referrals, and other companies. -Ability to set and prioritize daily, weekly, and monthly goals encouraging growth for the organization. -Effectively maintain and manage a marketing budget consistently referring to Marketing Plan or President of the organization. -Create, deliver, and optimize marketing materials. -Research media coverage and the industry&rsquo;s trend. -Developing continuous stories for the AFB -Producing additional marketing communications such as flyers, posters, stamps, exhibition-related projects. -Produce clear and concise written correspondence in the form of letters, emails, etc. - Assisting team members with day to day marketing tasks and coordinating marketing projects and activities as requested. Skills/Qualifications: -1-2 years of experience within a marketing setting. -A Bachelors degree or working towards a bachelor degree whether in Fundraising, Marketing, Strategy, etc. -Ability to work under pressure and multitask assignments given to other volunteers and interns. -Engage other volunteers/interns in work associated with AFB and continue to assist in any way possible.", "title": "Marketing Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254852%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Overall Responsibilities: Responsible for the Public Relations activities within the organization. Develop relations associated with press releases, and utilizing multi-media outlets to its fullest extent. Overseeing and meeting goals within the department to ensure growth is being met. Responsibilities: -Identifying stories within A Free bird organization and and creating awareness to the public and media. -Creating a relationship with media outlets, maintaining that relationship and also welcoming new relationship with other media outlets. -Develop strategies that help promote our organization always pertaining to our Mission statement. -Working directly with the President of the organization to ensure goals are being met, media outlets are being reached out to, and growth is continuing within the department. -Prepare or edit organizational publications for internal and external audiences. -Respond effectively to requests for information from the media or designate another appropriate spokesperson or information source. -Establish and maintain cooperative relationships with representatives of community, consumer, employee, and public interest groups. -Attends all meetings of the Organization at least weekly. -Must support and maintain mission goal and statement of organization. Skills/Qualifications: -Must have a college degree or working towards a bachelor's degree within their school. This include an English major, or Communications Major. -Excellent writing skills. -Management skills. -Communication Skills. -Team Player. -Proactive goal setter. -Understanding and basic knowledge of google docs, Microsoft Office, including word, powerpoint, excel, access. -Be able to know basic functions of social media including, but not limited to instagram, facebook, twitter, pinterest, vlogs, blogs, vine, etc.", "title": "PR Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254845%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "As a non profit for children with cancer we are asking for an Executive Director who has a lot of long term availability. We are hoping this person can do 10-15 hours per week and stay with the organization for minimum of 6 months. This role is really for someone who is between jobs, or would like a transition position. Job Duties include, but are not limited to: Oversee and Direct General Fundraising Activities and Grant Applications. Act as a source of everyday operations. Be able to supervise and direct non profit interns and volunteers. Be able to attend events we have for the children in our Programs Department as well as PR/Marketing, and Fundraising. Guide the vision and Direction of the organization as established by the Founder. Financial/Personnel Management Oversee events, meetings, get togethers, etc. We are looking for someone who has an advanced degree such as a Master's Degree and previous work with a non profit. Leadership and interpersonal skills are required. Understanding of Google Docs, Microsoft Office, & Quickbooks Strong Financial Management Skills Excellent written and verbal skills Comfortable interacting with diverse families, organizations, and other communities. Able to manage multiple projects simultaneously.", "title": "Executive Director", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3254832%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "This opportunity is for someone who is diligent with the computer and a fantastic researcher. As the KSK Manager (Kids Supporting Kids) Manager you will be Working with schools to raise money for AFB, while rewarding SCHOOL, Teachers and/or student(s) in return. -Creating Email Template letters. -Creating Call scripts for over the phone when calling schools. -Must be powerpoint efficient. -Researching different schools and companies who are available to do the KSK program. -Helping Graphic Designer create brochures and certificates for the children once program is completed. -Meeting with teachers, principal and assistant principal to discuss planning of KSK program. -Comfortable speaking in front of big audiences Our office hours are Tuesday - Thursday 10:30am - 6:00pm. You must be available at least one day out of Tuesday, Wednesday, Thursday to come into the office to work. The rest of the information and tasks can be done at home. Please forward a copy of your resume along with any relevant fundraising experience you have had in the past.", "title": "KSK Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3229926%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Collaborating with established artists by creating a mutually beneficial fundraising platform to educate and support children with cancer. This program features an amazing opportunity to support the children in each of our programs by partnering with well established artists in the community to host fundraising events with a portion of the proceeds going to benefit the children. Taking part in this program you will have the opportunity to improve the life of a child battling cancer and provide them access to the healing power of the arts! - Must be comfortable speaking with people and have fantastic communication skills via phone, in person, and email. - Be willing to put yourself out there and sometimes cold call companies/artists we have not worked with yet and have them understand the program and partner with AFB. - Prior experience in the arts such as working in a gallery is not required but will benefit you during this role. - Must be able to work with Google Drive, Microsoft Office, and be comfortable sending emails. - Be willing to work minimum 2 days a week in the office and partner with other department interns to complete tasks and projects - Must be willing to travel to our Storage Unit (Not far from our office) to grab art supplies if needed, keep track of inventory, and organize. - Organizing folders and emails and making sure all documents are current.", "title": "Program Manager - Artists Supporting Artists", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3192297%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. After a very incredible and successful year and in order to help as many kids as possible, we are seeking a Public Relations Coordinator/Manager (Intern) who can commit 5-10 hours per week for a minimum of 3 months. Position is un-paid but can apply for school internship credit. Responsibilities: Working with a small team, conceptualize and implement traditional and social media strategies and campaigns aimed at generating coverage of AFB's programs, key advocacy issues and marketing and celebrity-driven campaigns. In collaboration with our Social Media Director and Marketing Coordinator Produce blogs and other content for external publication. Edit commentaries produced by other AFB staff. Coach and supervise PR Intern Assistants. In collaboration with our Social Media Director and Marketing Coordinator Expand and nurture AFB's mainstream and social media network. In collaboration with our Social Media Director and Marketing Coordinator Build and manage our Twitter-sphere. In Collaboration with our Social Media Director and Marketing Coordinator Help manage the AFB's media database, build lists and track media coverage. Qualifications: Excellent writing and editing skills with ability to produce polished and compelling copy on tight deadlines Creativity in tapping and cultivating mainstream media and social networking communities Keen insight into the news business and understanding of what makes journalists tick Proven ability to identify and market good story ideas Prefer candidate with local or hyperlocal media relationships A positive, energetic and proactive multi-tasker who can work independently or very collaboratively, as part of a team Ability to work effectively, efficiently, diplomatically and calmly in a high-pressure environment on issues that are often complex and politically sensitive Strong listener, with a high degree of professionalism and flexibility, including the ability to prioritize and effectively manage assignments in a timely fashion", "title": "Public Relations Assistant", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191187%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Your passion and dedication will directly lead to more young people getting the arts opportunities they deserve. Overall Responsibilities: Assisting Fundraising Coordinator/VP of Fundraising with any job-related task for Fundraising assistant. Consisting of, but not limited to: scheduling appointments for Fundraising Coordinator, assisting in reaching out to donors, supporters for companies, researching information, creating documents, sending emails, setting up meetings with other department heads, reaching out to other departments for information. Responsibilities: Supports Candidate Fundraising Director in organizing meetings, staffing events and preparing materials Prepares donor meeting and event materials as necessary Plays lead role in scheduling for the department Make phone calls and send emails to lists of identified prospective donors, including keeping track of the call history. Help develop other lists of potential donors where the names are known but not contact information. Internet searching Keeping consistent relations with donors and future donors/sponsors. Assists in the development of Brochures, flyers, posters, etc. Must support and maintain mission goal and statement of organization. Meet at least once per week meet with Fundraising Coordinator. Competencies: Understanding of Google Docs Understanding of Microsoft Office, PowerPoint, Excel, Word, etc. Friendly phone personality, etiquette on being able to write emails. Highly organized. Experience with Internet Searching. Ability to multitask and help manage a few projects at once.", "title": "Fundraising Assistant", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191182%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Assist Billing Manager with any billing responsibilities. Help with the annual budget, keeping up with operational billing standards, providing analysis of each department, helping to identify and resolve billing problems, and tracking status of bills. Overall Responsibilities: Must support and maintain mission goal and statement of organization. Assist in drafting and the finalization of bills, sending to recipients. Reaching out to each department maintaining monthly statements and balances. Assist in preparing a monthly billing statement for the entire organization. Ensure billing and payment information are accurate and up to date. Assist in identifying and resolving invoice disputes and errors. Monitor status and dates of bills. Process and maintain invoices through spreadsheets and files. Working with each department for the yearly budget. Competencies : Has/working towards a degree in accounting, finance or related field. Experience with bookkeeping. Excellent organizational and communication skills. Competency with Google docs, QuickBooks, and Microsoft Office, particularly Excel and QuickBooks.", "title": "Billing Assistant Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191181%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Overall Responsibilities: Carry out any responsibilities the Administrative Department may have. Provide administrative support and ensure a smooth running of daily operations by arranging communication between all departments and all managers and the Executive Director. Responsibilities: Serve as liaison between the president and head of departments to ensure mutual understanding of tasks, goals, and agendas. Remains in constant contact with the head of departments. Updates calendars, agendas, and supporting documents on a daily basis. Organizing, storing, and managing files. Coordinate and participate in department meetings and follow up on action items. Must support and maintain the mission goal and statement of the organization. Competencies: Understanding of Microsoft Office and Google Drive, including Google + Administrative and/or bookkeeping experience. Ability to work as part of a team within a fast-paced environment. Excellent communication, both written and oral, skills. Ability to pay attention to detail.", "title": "Administration Assistant Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191178%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are seeking a Volunteer/Intern Multimedia who can commit 150 total hours over 3 months. We encourage undergraduate and graduate students seeking a for credit internship or fellowship to apply Responsibilities: Working in Photoshop to create layouts, CADS, and design web graphics, Working in Illustrator to create vector objects, print files, and marketing materials. Working in InDesign to create automatic catalogs and other materials. Working with Excel and outlook to update spreadsheets, schedule meetings, answer emails. Skill requirements: Very well trained in CS6 or earlier, especially Photoshop, Illustrator, and InDesign. Working knowledge of Excel, Outlook, Word, and PowerPoint. Knowledge and use of keyboard shortcuts and how to do tasks the fastest way. Knowledge of HTML programming is a plus, but not required. Position requirements: Detail oriented, organized, and a quick learner Follows instructions and completes projects in a timely matter. Work with minimal supervision, a proactive problem solver. Excellent references, grades, & portfolio (even a student portfolio) are required.", "title": "Multimedia Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3186731%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Assist Billing Manager with any billing responsibilities. Help with the annual budget, keeping up with operational billing standards, providing analysis of each department, helping to identify and resolve billing problems, and tracking status of bills. Overall Responsibilities: -Must support and maintain mission goal and statement of organization. -Assist in drafting and the finalization of bills, sending to recipients. -Reaching out to each department maintaining monthly statements and balances. -Assist in preparing a monthly billing statement for the entire organization. -Ensure billing and payment information are accurate and up to date. -Assist in identifying and resolving invoice disputes and errors. -Monitor status and dates of bills. -Process and maintain invoices through spreadsheets and files. -Working with each department for the yearly budget. Competencies: -Has/working towards a degree in accounting, finance or related field. -Experience with bookkeeping. -Excellent organizational and communication skills. -Competency with Google docs, Quickbooks, and Microsoft Office, particularly Excel and Quickbooks. Afreebird is open Tuesdays through Thursdays from 10:30 AM to 6:00 PM. Credit or experience internships require that you come in twice a week for 4 full hours each day. Volunteers do not have to be there for more than one full day.", "title": "Financial Accounting Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3117106%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. After a very incredible and successful year, we are seeking a highly skilled intern admin for the new year 2019. Your passion and dedication will directly lead to more young people getting the arts opportunities they deserve. Overall Responsibilities: Carry out any responsibilities the Administrative Department may have. Provide administrative support and ensure a smooth running of daily operations by arranging communication between all departments and all managers and the Executive Director. Responsibilities: * Serve as liaison between the president and head of departments to ensure mutual understanding of tasks, goals, and agendas. * Remains in constant contact with the head of departments. * Updates calendars, agendas, and supporting documents on a daily basis. * Organizing, storing, and managing files. * Coordinate and participate in department meetings and follow up on action items. * Must support and maintain mission goal and statement of organization. AFB is open Tuesdays through Thursdays from 10:30 AM to 6:00 PM.", "title": "Admin Assistant", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3024221%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Responsibilities: Assisting the Marketing Coordinator with any job responsibilities. Contacting potential donors/sponsors to help out the organization. Following organization protocol when it comes to emails/phone calls. Using templates within google drive to contact companies, also sharing folders with volunteers/interns. Researching/assisting with any job related tasks available to the assistant for review. Overall Responsibilities: -Emailing donors/sponsors. -Researching information. -Assisting Coordinator/Director with any job duties. -Ability to create templates/sharing potentially with other volunteers/interns and also outside vendors. -Keeping records of donors/sponsors. -Emailing other people with proper email etiquette. -Must support and maintain mission goal and statement of organization. Competencies: -Has/working towards in degree in Marketing or related field. -Excellent communication skills. -Understanding of Google docs and Microsoft Office. Please provide your Resume to volunteer@afreebird.org", "title": "Marketing Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3024214%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Responsibilities: Assisting the PR Coordinator or Director with any work towards the organization. Creating templates, emails, documents, etc for the Director/Coordinator. Reaching out on social media, posting pictures, hashtagging, tweeting, posting on Facebook etc. The ability to communicate properly and professionally with other volunteers/interns and prospective sponsors, donors. Overall Responsibilities: -Assisting Director/Coordinator with any emails, research, postings for social media. -Creating documents for the department potentially sharing this information with everyone. -Thinking of new and creative ideas for social media. -Reaching out whether on Facebook, Pinterest, Instagram, Twitter, to donors/sponsors etc. -Understanding email etiquette. -Must support and maintain mission goal and statement of organization. -Familiar with social media, magazine, brochures. -Working with Wordpress, C++, etc for social media. -Creating templates for the PR Department. Competencies: -Knowledge of all social media -Ability to learn and consistently change with the organization. -Computer based knowledge. -Knowledge of Google. -Knowledge of Microsoft Office.", "title": "PR Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3024212%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "Give arts is a program within A Free Bird where we are given and pass along free instruments to the children so that they can use it to practice their musical talent. We also donate equipment to hospitals. Overall Responsibilities This person must be able to feel comfortable reaching out to companies via email, phone, and in person. Must be willing to find musical instruments that companies would like to donate or give away to the organization to de distributed to the children. Person must be willing to travel and give instruments to children and take photos for our social media pages. Working closely with the Programs Department and with the coordination of events where the children will receive the instruments as well as coordinating times that the children will be available to meet with you and the programs department to drop off the instruments to the children. Qualifications: Be ready to work with moving companies. Be organized as you will be keeping track of the instruments we have available. Must be willing to travel to the storage unit, chid's home, and hospital Be available 10-12 hours per week. ] Must have own laptop/computer to work from and have a smartphone device Familiar with Google Docs Willing to work individually as well as in a team. Be comfortable with social media as you will be posting and reaching out to companies via social media outposts.", "title": "Program Manager - Give Arts", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2763673%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Fundraising Program which enables the public to provide direct sponsorship to the child. Reaching out to companies and individuals who are willing to sponsor a child that the organization has within the Programs Department. This person must feel comfortable with phone calls, speaking to people in person, and reaching out via email. You will report back to the VP of Fundraising, creating graphs and charts using the Google Docs. Must be comfortable with Social media and be able to post about the organization and what sponsor a child has to offer the community. Being in contact with the Programs Department on the children that are available and what company will be sponsoring which child. Have availability of 10-12 hours per week. Understanding of Google Docs, and Excel Spreadsheets Organized and professional Great Communication Skills Be fluent on all social media platforms. Willing to work individually as well as in a team environment. Report back to the VP of Fundraising with progress as well as the Founder of the organization. Have some availability on the weekend. Be comfortable on social media platforms", "title": "Sponsor a Child Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2698240%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. After a very incredible and successful year, we are seeking a highly skilled Programs Coordinator to support our children and can commit 15-20 hours per week for a minimum of 3 months. Responsibilities: The Volunteer will assist the Programs Director with any research, projects, reaching out to individuals in/outside of the organization. Creating templates, documents, spreadsheets, etc. for the programs department to run more efficiently. Understanding the role of the Programs Director, putting all information on the calendar for Director. Overall Responsibilities: -Writing Emails for Programs Director. -Must support and maintain mission goal and statement of organization. -Researching topics for Director. -Assisting with any work Programs Director may give assistant. -Creating files, potentially sharing information with other volunteers/interns. -Creating Calendar appointments. -Reaching out to schools, hospitals, children programs, etc. -Using the phone, computer, laptop, iPad etc. Competencies: Has experience with children between the ages 4 -18. Knowledge of Google Documents/apps. Must be working towards a bachelor degree in psychology, Programs, or have a minimum of 1 year of assistant related work. Highly organized. Great communication and self-motivated.", "title": "Children Programs Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2648066%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Oversees the grant application and reception process. monitoring grants to comply with program and financial guidelines, managing budget, and allocation of funds. Must be able to manage the Grants Team, Lead and assist them with any questions they may have. Overall Responsibilities: -Research and identify grant opportunities and apply to potential sources of funding. -Oversee application process to ensure all requirements have been met. -Develop a procedure and methodology to consistently and efficiently apply for grants. -Creating and updating a list of grant funders. -Scheduling meetings, workshops, seminars and/or activities for interested parties. -Communicate and collaborate with interested parties to secure funds for the purpose of improving programs and services. -Ensure process of receiving and using grants follow both funder and organization guidelines. -Manage budget periodically to optimize allocation of funds. -Must support and maintain mission goal and statement of organization. Competencies: -Background in PR, communications, and related fields. -Being professional, personable, and persuasive in order to achieve desired results. -Proficiency in math and ability to review technical information. -Excellent communication, organizational and writing skills. -Must be a team player and be able to supervise and guide others.", "title": "Grants Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2623223%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "This Program deals with businesses who are interested in joining with A Free Bird. Things such as product placement can occur with A Free Bird, getting a large portion of the proceeds for a certain time period. This requires a lot of patience and persistence from the individual who wants to be the Coordinator. Reaching out via email, phone, and speaking to companies and following up with companies that you did not receive an answer from. Thinking outside of the box, we are looking for someone who has the ability to come up with incentives for companies to collaborate with A Free Bird and how they will benefit from working with us. Following up with companies that you have reached out to and see if they are interested in the program. Coming up with ideas for companies to work with the AFB and help raise funds for our Programs Dept. Travel to companies location. Have available 10-12 hours per week to devote your time to the organization Be comfortable with Google Docs creating forms and excel spreadsheets to keep track of companies Organized and professional demeanor Great communication skills. Willing to work individually as well as in a team. Be comfortable on all social media platforms and use it to reach out to many more individuals.", "title": "Get Excited Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2567290%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. - Manipulate and edit film pieces in a way that is invisible to the viewer - Understanding production team&rsquo;s needs and specifications - Review shooting script and raw material to create a shot decision list based on scenes&rsquo; value and contribution to continuity - Trim footage segments and put together the sequence of the film - Input music, dialogues, graphics and effects - Create rough and final cuts - Ensure logical sequencing and smooth running - Continuously discover and implement new editing technologies and industry&rsquo;s best practices to maximize efficiency.", "title": "Video Editor", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2508571%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Overall Responsibilities: Responsible for picking up and delivering food to the volunteers at A Free Bird's office and transporting inventory to the required location. You will be reimbursed for gas spent traveling between any locations for the organization. Lunch will be around 1-2pm so must be available around these hours to be able to pick up the food. Food is for our Volunteers and Interns and of course you can have too! Delivery of art equipment and materials to the children of the organization either to their home or to the hospital. Upkeep of the office as well as organization of files/childrens arts materials, instruments, etc. This person will keep detailed information on the equipment we have and use google drive to create an excel spreadsheet of everything that we have as stated above. Skills/Qualifications: -Must have a drivers license and car. -Management skills. -Communication Skills. -Organized - Take inventory of pieces that we have available in office and in storage.", "title": "Operations Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2508541%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "The Get Excited Program acts as a liaison for businesses who are interested in partnering with A Free Bird. Main responsibilities include reaching out via email, phone, or in person and speaking to companies to create a meaningful connection between out organization and theirs. We are looking for someone who has the ability to come up with incentives for companies to collaborate with A Free Bird and communicate they will benefit from working with us. Qualifications Available 5-10 hours per week to devote your time to the organization Ability to work remotely Ability to travel locally on occasion. Basic experience with Google Docs and excel spreadsheets Great communication skills. Willingness to work individually as well as in a team. Experience in using social media platforms to reach out to individuals.", "title": "Program Manager - Get Excited", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2508521%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "We are a 501 (c) 3 non profit organization dedicated to inspiring and nourishing children with cancer through the therapeutic form of the arts. We are currently seeking an EXPERIENCED Event Coordinator to help us with our Annual Gala! We are currently working on our annual gala for our Organization where this is our huge Fundraising Gala event. We are currently looking for a fun, enthusiastic, and really engaging individual who has a passion for the arts, children being affected by cancer, and a willingness and drive to help us raise money and create an extraordinary event. Emailing, phone calls, reaching out to individuals to perform. Helping with finding a space, working with Fundraising Department for sponsors and donations for the event. Working with Programs to see which children are able to perform. Requires 10 hours per week as well as meeting once every week or every other week to come into the office for any questions and updates with the event! Please submit a resume to hr@afreebird.org", "title": "Event Coordinator Volunteer", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2340273%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Provide strategic consultation for AFB marketing and branding across print and digital media and collaborating with marketing department to develop a plan to maximize AFB awareness through marketing campaigns. Overall Responsibilities: -Identify and report on marketing targets and goals. -Working on AFB&rsquo;s auction site. -Meeting with marketing department weekly to discuss and provide feedback on past, current, and future marketing materials and campaigns, such as next steps and/or improvements. -Evaluate the success rate of marketing campaigns. -Analyze marketing situations and pass judgement on most optimal course of action and working with Marketing Materials Specialists to allocate marketing materials and resources. -Create briefing documents and build relationships, remain in contact, and negotiate with external parties. -Research and identify new market demands and growing trends and report them to marketing department. -Must support and maintain mission goal and statement of organization. Competencies: -Has/working towards a degree in Marketing, Business, Psychology, PR and related fields. -Excellent organizational and time management skills. -Excellent verbal and written communication skills. -Ability to think critically. -Knowledgeable about different forms of print and digital media and comfortable with conducting research. -Must be able to work and coordinate with others.", "title": "Marketing Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2338744%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "In Schools Children are impacted by peer pressure, stress, independence, and high expectations. They deal with these issues by developing relationships with others who are around them. We believe if children have access to a whole community like Kids Supporting Kids, it will help alleviate some of that stress as well as benefit long term through school work, community, and relationships with others. We offer this program as a means to raise awareness around pediatric cancer and its effects on the children and those around them. KSK educates children about the importance of giving back to the community and inform them of the implications of juvenile cancer by creating an arts based interactive curriculum. Overall Responsibilities: Must feel comfortable speaking and introducing the organization to schools and researching schools to reach out to. Telephone Communication and Email communication is key and necessary. Come up with ways to have the children interact with each other and find ways to help raise funds for the organization Reach out to news companies, newspapers, etc. about the events and try to provide press towards the events Qualifications Ability to work with Microsoft Office Be able to communicate via Telephone, Emails, and in person Have an upbeat personality and can-do attitude Support mission of the organization Prior experience with events or the like", "title": "Program Manager - Kids Supporting Kids", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2286311%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: The Intern/Volunteer will assist the Programs Director with any research, projects, reaching out to individuals in/outside of the organization. Creating templates, documents, spreadsheets, etc for the programs department to run more efficiently. Understanding the role of the Programs Director, putting all information on the calendar for Director. Overall Responsibilities: -Writing Emails for Programs Director. -Must support and maintain mission goal and statement of organization. -Researching topics for Director. -Assisting with any work Programs Director may give assistant. -Creating files, potentially sharing information with other volunteers/interns. -Creating Calendar appointments. -Reaching out to schools, hospitals, childrens programs, etc. -Using the phone, computer, laptop, ipad etc. Competencies: -Knowledge of Google Documents/apps. -Must be working towards a bachelors in psychology, Programs, or have a minimum of 1 year of assistant related work. -Highly organized. -Great communication and self motivated.", "title": "Programs Assistant", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2068411%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Overall Responsibilities: Responsible for the Public Relations activities within the organization. Develop relations associated with press releases, and utilizing multi-media outlets to its fullest extent. Overseeing and meeting goals within the department to ensure growth is being met. Responsibilities: -Identifying stories within A Free bird organization and and creating awareness to the public and media. -Creating a relationship with media outlets, maintaining that relationship and also welcoming new relationship with other media outlets. -Develop strategies that help promote our organization always pertaining to our Mission statement. -Working directly with the President of the organization to ensure goals are being met, media outlets are being reached out to, and growth is continuing within the department. -Prepare or edit organizational publications for internal and external audiences. -Respond effectively to requests for information from the media or designate another appropriate spokesperson or information source. -Establish and maintain cooperative relationships with representatives of community, consumer, employee, and public interest groups. -Attends all meetings of the Organization at least weekly. -Must support and maintain mission goal and statement of organization. Skills/Qualifications: -Must have a college degree or working towards a bachelor's degree within their school. This include an English major, or Communications Major. -Excellent writing skills. -Management skills. -Communication Skills. -Team Player. -Proactive goal setter. -Understanding and basic knowledge of google docs, Microsoft Office, including word, powerpoint, excel, access. -Be able to know basic functions of social media including, but not limited to instagram, facebook, twitter, pinterest, vlogs, blogs, vine, etc.", "title": "Public Relations Coordinator", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2046399%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Overall Responsibilities: The fundraising manager will raise money for the organization through the fundraising department. Using different methods and campaigns to raise money from organizations, individuals, grants, or receiving donations from those organizations, individuals, and grants to help the organization succeed and grow. The Fundraising Manager will report solely to the Executive Director of the organization. Responsibilities: -Creating a list of new/current donors or sponsors for the organization. -Sends emails, makes phone calls to prospective donors. -Accepts gifts from donors, and assures thank you letters and receipts are sent promptly and according to the organization policy. -Helps Plan and attend all functions of the Organization this includes special events for fundraising purposes. -Coordinates in a timely manner communications with current and prospective donors, either by email, phone, text, etc. -Prepares reports for Board of Directors and Executive Director as necessary. -Attends all meetings of the Organization at least weekly. -Works with other volunteers and interns to create and collect materials for the organization such as brochures, newsletters, special projects, annual reports, etc. this position is not limited to these materials however does include these materials within their job title. -Must complete all other assignments as required by the Executive Director. -Must support and maintain mission goal and statement of organization. -Attends all meetings of the Organization at least weekly. Skills/Qualifications: -Minimum Bachelors Degree preferably in marketing, fundraising, or a related field. -Ability to communicate effectively including having exceptional oral and writing skills. -Attention to detail is key, able to manage multiple projects at the same time, have strong math skills. -Ability to create documents, letters, brochures. -Knowledge of marketing, sales, fundraising practices and techniques that are current. -Understanding and basic knowledge of google docs, Microsoft Office, including word, powerpoint, excel, access.", "title": "Fundraising Manager", "zipcode": "11201", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2046385%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "07202": [{"end": "2020-06-30", "description": "International Rescue Committee is seeking volunteers to assist in unloading 800-1000 ready-to-heat meals from delivery trucks to ensure the smooth operation of community residents picking up meals for family members during their designated pick up time. Volunteers will also assist in breaking down tables and the repackaging of undistributed meals at the end of the day. Volunteer Guidelines: COVID-19 Avoid touching your eyes, nose, and mouth with unwashed hands. Clean and wash your hands before, during, and after volunteering for a minimum of 20 seconds. If soap and water are not readily available, use a hand sanitizer that contains at least 60% alcohol. Need to know: Onsite parking available Dress comfortably", "title": "Emergency Food Bag in Elizabeth", "zipcode": "07202", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3283209%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jersey Cares"}], "11203": [{"end": "2020-06-13", "description": "The Children's Sports & Fitness Expo is a full day of exercise, fitness and fun. During the event, children are engaged in a variety of sports and fitness activities such as fencing, tennis, golf, volleyball, soccer, gymnastics and much more. In addition, there are also health screenings and nutrition classes. Through this event, families are exposed to programs and services that are available to help improve their health, thereby reducing the risk of obesity in their lives. In addition, there is also an awards presentation along with live entertainment during the day.", "title": "15th Annual Children's Sports & Fitness Expo", "zipcode": "11203", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3241444%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Body Sculpt of New York, Inc."}], "07102": [{"end": "2020-06-30", "description": "Newark Emergency Family Services is looking for a bilingual volunteer that can assist with communicating with the Spanish speaking population every Thursday during their food distribution. Volunteer Guidelines: COVID-19 Avoid touching your eyes, nose, and mouth with unwashed hands. Clean and wash your hands before, during, and after volunteering for a minimum of 20 seconds. If soap and water are not readily available, use a hand sanitizer that contains at least 60% alcohol. Need to know: Onsite parking available Dress comfortably", "title": "Help with Translation in Newark", "zipcode": "07102", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3286265%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jersey Cares"}, {"end": "2020-06-30", "description": "Volunteers will assist in the unloading of food pallets and supplies as well as preparing 1100 bags of fresh produce. After the preparation of the bags of fresh produce, volunteers will help load the bags onto vans for delivery to Senior Buildings. Volunteer Guidelines: COVID-19 Protective Equipment: Masks, Gloves, and Sanitizer will be provided Avoid touching your eyes, nose, and mouth with unwashed hands. Clean and wash your hands before, during, and after volunteering for a minimum of 20 seconds. If soap and water are not readily available, use a hand sanitizer that contains at least 60% alcohol. Need to know: Free parking for Jersey Cares volunteers will be available in the parking lot, in the back of the building. Dress comfortably.", "title": "Mobile Market in Newark", "zipcode": "07102", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3281286%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jersey Cares"}], "11205": [{"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. The Program Manager for Volunteer Benefits will be working towards finding donated supplies towards the organization for our interns/volunteers. This person must have a can-do attitude, be self-motivated, and be able to communicate well with the HR Director. This person will research current and new companies to allow us to still be able to thank our volunteers, coming up with Volunteer of the month and receiving a gift for them, volunteer for the week. Working closely with Google docs to create excel spreadsheets, etc. The Program Manager for Volunteer Benefits should have: Excellent writing, interpersonal and organizational skills A great attention to detail and ability to maintain confidentiality Previous administrative or HR experience a plus work remotely Commit to 5-10 hours a week Passion for our mission", "title": "Program Manager - Volunteer Benefits", "zipcode": "11205", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2484723%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "11207": [{"end": "2020-06-09", "description": "Join us for a virtual Volunteer Tutor Information Session to learn about Brooklyn Public Library's Adult Learning Centers and the Volunteering as a tutor. We are moving forward with a virtual information session and virtual tutor training session. Please read the description below. If you want to attend the virtual information session on Tuesday, June 9th, please respond to this posting. A Zoom meeting link will be sent to you on June 8th. Work with Adult Literacy Students at one of the five Brooklyn Public Library Learning Centers. Help them reach their personal goals. Lead reading and writing activities for small groups of adult learners who read below the fifth grade level. Assist them in using technology. We provide a 20 hour Volunteer Tutor Training where you will learn the BPL&rsquo;s Literacy Program&rsquo;s philosophy, how to use the library&rsquo;s resources for instruction, and how to create effective lesson plans. Professional staff will encourage your development in this richly rewarding field. We are including training in tutoring virtually. Volunteers must have a high school diploma or equivalent and a love of reading and writing. Volunteers are asked for a one year commitment to tutoring either 2 - 2 hours sessions, or 1 - 3-hour session per week. To learn more about the Brooklyn Public Library Learning Centers, please visit the BPL website at http://www.bklynlibrary.org.", "title": "Virtual Literacy Volunteer Tutor Information Session", "zipcode": "11207", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3055724%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Learning Centers @ Brooklyn Public Library"}], "11228": [{"end": "2020-06-20", "description": "There are many volunteer opportunities that the American Cancer Society office has here in Brooklyn. You can volunteer to work the events in Brooklyn (weekends and late nights). These events include Relay For Life of Brooklyn (www.relayforlife.org/brooklynny) and Relay For Life of LIU Brooklyn (www.relayforlife.org/liubrooklynny). You can view the sites to see the details by going to each respective website. Please reach out to help volunteer at the events!", "title": "Relay For Life of Brooklyn", "zipcode": "11228", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3257687%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "American Cancer Society of Brooklyn and Staten Island"}], "10024": [{"end": "2020-08-14", "description": "2020 Summer College Internship Program at DOROT DOROT offers a 10 or 11-week summer internship program for college students interested in careers in non-profit management, community organizing, social work and working with older adults. Through a competitive process, we choose ten to twelve interns each summer. Only current Freshmen, Sophomores, and Juniors will be considered for our summer college internship positions. The internship program provides students with an understanding of the issue and impact of social isolation among older adults as well as DOROT&rsquo;s response. We give each intern substantive work and project management experience. While the work done by interns varies by department, we are committed to entrusting interns with significant responsibility and providing them with an opportunity to make a meaningful contribution. In addition to a departmental placement, summer interns also have a group experience. There is a comprehensive orientation to DOROT and our work with older adults, weekly group sessions with other interns and DOROT staff for learning and reflection and several group outings each summer. Program Details DOROT&rsquo;s Summer College Internship begins on Monday, June 1st. The program has two tracks: * 10-week placement concludes Thursday, August 6th. This is four days a week Monday-Thursday, 9/9:30am - 5/5:30pm. * 11-week placement concludes Friday, August 14th. This is five days a week Monday-Thursday, 9/9:30am - 5/5:30pm and Fridays 9am-4pm. The 10-week placements are unpaid; the 11-week placements have a $2,200 stipend. DOROT will provide a monthly MetroCard to all interns for travel within the NYC metro system. We do not provide housing or travel expenses for outside of NYC ex: NJ Path or LIRR. DOROT is able to offer college credit with approval from an intern&rsquo;s academic institution. We also understand that many schools provide stipends for students to participate in summer internships with nonprofit organizations. Deadlines and availability vary by institution and are awarded solely at the discretion of each individual school. DOROT is happy to provide information about our internship program to help internship candidates apply for such opportunities. Application Process Applications are reviewed and acceptances are awarded on a rolling basis. Applicants must complete DOROT&rsquo;s 2020 Summer Internship Application. In addition to submitting an application, candidates are asked to send their resumes to Sharon Stahl, Coordinator of College and Adult Volunteers, at sstahl@dorotusa.org with the subject heading \\\"2020 Summer Internship Application\\\". Individual Internship Descriptions Applicants are asked to rank their preference for their internship placement. We currently have openings in the following departments: Connect Through Tech Intern (10-week placement) The Connect Through Tech intern will learn how technology is used to create programs that support older adults in expanding and enriching their social connections as well as increase their access to resources that support their independence. This is especially important for those who find traveling from home to be challenging. The intern will assist with outreach efforts like conducting research, representing the department on phone and in person, assisting with marketing and maintaining the department&rsquo;s contact database. Constituent & Community Services Intern (10-week placement) The Constituent & Community Services Department arranges regular visits between volunteers and older adults. The intern in this department visits seniors weekly in their homes; serves as a companion for older adults who need support getting to essential appointments; and assists with office projects such as surveys (over the phone and in-home). There will be at least two intern placements in this department. One of the interns will report to the main DOROT office in Manhattan two days a week and to the Westchester office as the DOROT Westchester Intern (described below) the other two days a week. Development, Marketing and Communications Intern (10-week placement) The intern in this role will support the multiple strategies and goals of critical areas that focus on multiple fundraising streams, branding, collateral and digital communication. This position is ideal for those with diverse interests and skills. A strong sense of professionalism as well as genuine enthusiasm for DOROT&rsquo;s mission are important. DOROT Westchester Intern (10-week placement) DOROT&rsquo;s Westchester Office is located in White Plains and serves older adults throughout the count. The intern will work in Westchester two-days per week and at DOROT&rsquo;s Manhattan Office two days per week in another DOROT department (most likely Constituent and Community Services, described above). Responsibilities include surveying seniors to better understand their program interests and needs and assisting with data entry and home visiting in Westchester. DOROT cannot provide transportation in Westchester; it is recommended that applicants have access to a car. Homelessness Prevention Program Intern (10-week placement) DOROT&rsquo;s Homelessness Prevention Program (HPP), located on Manhattan&rsquo;s Upper West Side near DOROT headquarters, offers a transitional residence for homeless older adults and operates other support services for older adults at risk of homelessness. This intern will likely spend two days per week at DOROT&rsquo;s Homelessness Prevention Program located a few blocks from the DOROT headquarters and the other two days per week as a Program Evaluation and Impact Intern (described below). The HPP intern will respond to incoming calls and questions regarding prospective admission, provide technology tutoring and assistance to older adults in the program and assist with other office projects. Proficiency in Spanish is a plus. . Jewish Summer Teen Internship Program Intern, Manhattan and the Bronx (11-week placement, stipend position) DOROT offers four summer internship programs for high school students. This position supports two Jewish summer teen internship sessions: one at DOROT headquarters, which welcomes 21 high school students; the second at the Riverdale Y, which welcomes 16 students. The intern helps coordinate the daily scheduling, plans and organizes intergenerational programming, and assists with logistical needs. Intern at DOROT headquarters for the first seven weeks of the summer and in Riverdale for the last four weeks.. Jewish Summer Teen Internship Program Bilingual English/Russian Intern, Manhattan and Brooklyn (11-week placement, stipend position) DOROT offers four summer internship programs for high school students. This position supports two of DOROT&rsquo;s Jewish summer internship sessions: one at DOROT headquarters, which welcomes 21 high school students; the second at the Shorefront Y in Brighton Beach, which welcomes 15 students. The intern helps coordinate the daily scheduling, plans and organizes intergenerational programming, and assists with program logistics. Intern at DOROT headquarters for the first seven weeks of the summer and in Brighton Beach during the last four weeks. Kosher Meals at Home Intern (10-week placement) Kosher Meals at Home delivers nutritious meals to home-based elders who are not able to shop and prepare meals for themselves. The intern conducts phone outreach to offer a friendly hello on a regular basis, discuss meal choices, schedule deliveries, and check in on the older adult&rsquo;s condition. This intern also helps deliver meals and visits meal recipients. Lasting Impressions Intern (10-week placement) The Lasting Impressions Summer College Intern will have the opportunity to create Legacy Projects by working one on one with older adults to write or record their stories and memories. The intern will be part of our evolving and ongoing initiatives which in the past have included projects such as Stonewall OutLoud, an interview collection of the voices of elders who are part of the LGBTQIA community and Recipes to Remember, which catalogues recipes and the meaningful stories they hold for older adults. The intern will support onsite creative aging programming which includes visual art workshops, legacy work on paper, programs focused on Jewish Culture and Heritage, and more. The intern may also be a part of onsite programming to support older adults working on their advance care planning documentation. Onsite and Special Programs Intern (11-week position, stipend position) DOROT&rsquo;s Onsite & Special Programs Department offers discussion groups, wellness classes and special events such as concerts and author talks for older adult participants. These classes take place during the day, evenings and on Sunday and include hundreds of participants each week. The Onsite and Special Programs intern will assist staff in an administrative capacity, help promote upcoming events, and engage with our multifaceted senior population. The intern will also have the chance to create new programs and visit older adults at home. Program Impact & Evaluation Intern (10-week placement) The Program Impact & Evaluation Department conducts phone surveys of older adults who participate in DOROT&rsquo;s programs; and review and analyze online survey results. These evaluations help staff agency wide improve our offerings. This intern will split his or her time between the Program Impact and Evaluation Department and the Homelessness Prevention Program (described above). The intern will also have the opportunity to make home visits to older adults. Summer Teen Internship Program Intern, Manhattan (11-week placement, stipend position) DOROT offers four summer internship programs for high school students. This position supports two summer teen internship programs; each session welcomes 21 high school students at DOROT&rsquo;s headquarters. The intern helps coordinate the daily scheduling, conducts outreach to older adults to register their participation, and plans and organizes intergenerational programming and outings. Volunteer Services Department Intern (10-week placement) The Volunteer Services Department engages thousands of volunteers in a variety of roles to assist DOROT elders. Over the summer, there are several key areas of focus in the Volunteer Services Department, including: Assisting with DOROT&rsquo;s Cemetery Visit program where volunteers accompany older adults to visit the graves of a loved one. The intern helps with planning and implementation and may attend if needed. Providing support for DOROT&rsquo;s bimonthly Volunteer Orientation sessions Assisting with logistics for the Response Team Program which provides special visits to homebased older adults Assisting with preparations for our bimonthly Cooking with DOROT which provides meals for older adults at risk of homelessness Assisting with events for volunteers from companies Providing assistance and support for DOROT's Knit and Crochet Volunteers ***Check with your internship coordinator BEFORE accepting to determine how you might do this internship for credit.*** DOROT's Summer College Internship Program is funded by the Dorot Foundation and the Posner-Wallace Foundation among other donors.", "title": "Summer Internship in Social Services for College Students", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3170467%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}, {"end": "2020-06-28", "description": "The New York PCOS Challenge 5K Run/Walk in Manhattan is part of the country's largest national campaign raising awareness and funds to help fight polycystic ovary syndrome (PCOS). PCOS affects up to 15% of women in the U.S. and hundreds of millions globally. It is one of the most critical, under-diagnosed, underfunded and neglected areas of health, which can lead to lifelong complications, infertility, type 2 diabetes, cardiovascular disease, cancer and other life-threatening conditions.. By supporting the PCOS Challenge 5K Run Walk, you will become a champion for one of the most important issues affecting women&rsquo;s health. Your support will make a huge difference in the lives of tens-of-thousands of women as proceeds from the PCOS Challenge race will go toward PCOS education and support programs, research, health screenings, grants, as well as increasing awareness and public support for those with the disorder. The organization is seeking 15 volunteers to help with the event. Duties may include: Assisting with event setup and breakdown Directing participants to the registration and race start areas Checking in attendees Handing out race packs, bibs and T-shirts Timekeeping Handing out refreshments Assisting PCOS Challenge staff with day-of logistics and award ceremony Hydration and light snacks are provided for volunteers on event day. Fundraising We also have a need for assistance with fundraising for the PCOS Challenge 5K Run/Walk. We have a number of helpful tools, resources, scripts and incentives for fundraisers on the pcos5k.org website that make fundraising easy and fun!", "title": "New York PCOS Challenge 5K Run/Walk General Volunteer", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3266006%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "PCOS Challenge: The National Polycystic Ovary Syndrome Association"}, {"end": "2020-06-28", "description": "The New York PCOS Challenge 5K Run/Walk in Manhattan is part of the country's largest national campaign raising awareness and funds to help fight polycystic ovary syndrome (PCOS). PCOS affects up to 15% of women in the U.S. and hundreds of millions globally. It is one of the most critical, under-diagnosed, underfunded and neglected areas of health, which can lead to lifelong complications, infertility, type 2 diabetes, cardiovascular disease, cancer and other life-threatening conditions.. By supporting the PCOS Challenge 5K Run Walk, you will become a champion for one of the most important issues affecting women&rsquo;s health. Your support will make a huge difference in the lives of tens-of-thousands of women as proceeds from the PCOS Challenge race will go toward PCOS education and support programs, research, health screenings, grants, as well as increasing awareness and public support for those with the disorder. Photography and videography volunteers will help capture event shots such as: Registration Opening Ceremony Warm Up Large Group Photo Race Start Team Photos Finish Line Photos Medals Ceremony Hydration and light snacks are provided for volunteers on event day. Fundraising We also have a need for assistance with fundraising for the PCOS Challenge 5K Run/Walk. We have a number of helpful tools, resources, scripts and incentives for fundraisers on the pcos5k.org website that make fundraising easy and fun!", "title": "New York PCOS Challenge 5K Run/Walk Photography/Videography Volunteer", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3265682%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "PCOS Challenge: The National Polycystic Ovary Syndrome Association"}, {"end": "2020-08-13", "description": "Do you want to make a difference this summer in your community? Join a group of socially conscious teens for the DOROT Summer Teen Internship Program, where you'll earn over 100 community service hours while connecting with older adults. The DOROT Summer Teen Internship Program welcomes highly motivated and socially conscious rising 10th-12th graders who want to make a difference in the lives of older adults. Over the course of 4 weeks, interns work with peers, develop leadership skills and form meaningful connections through a variety of hands-on intergenerational experiences in the community and at program sites. Students earn over 100 hours of community service and develop hands-on leadership experience. In light of the ongoing COVID-19 pandemic and in an effort to ensure the health and safety of all of our participants, DOROT will be running our Summer Teen Internship Program remotely this summer. Join us by video and telephone platforms from the safety of your own home! 2020 Summer Teen Internship Program Dates: Summer Teen Internship - Manhattan Session I: 6/22 - 7/16 Summer Teen Intnernship - Manhattan Session II: 7/20 - 8/13 Summer Teen Internship - Riverdale: 7/20 - 8/13 Summer Teen Internship - Brighton Beach (bilingual Russian/English program): 7/20 - 8/13 Learn more and apply at www.dorotusa.org/summerteenapp Questions? Contact teens@dorotusa.org or (212) 769-2850.", "title": "DOROT Summer Teen Internship Program", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3262069%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}], "11549": [{"end": "2020-06-07", "description": "Girls on The Run Long Island is expanding to include numerous sites in Suffolk County and we need your help. No running experience needed! Head Coaches meet two times a week for 90 minutes each time for ten weeks. Assistant Coaches typically are needed one or two days a week. Please see our website to learn more about GOTRLI www.gotrlongisland.org", "title": "Coaches & Assistant Coaches needed across Nassau and Suffolk County", "zipcode": "11549", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3056056%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GIRLS ON THE RUN LONG ISLAND INC"}], "10001": [{"end": "2020-07-16", "description": "NYS-AIMH offers an exam for Endorsement applicants twice yearly. We are seeking a proctor for the October 2, 2020 exam. Requirements include: receive mailed materials, be on-site for specified hours, provide written instructions to applicants, monitor applicants during exam, support applicants in printing materials, collect materials and return materials in envelope. Volunteer must be someone who is not an Infant Mental Health Specialist and is not planning to sit for exam in the future.", "title": "NYS-AIMH Endorsement Exam Proctor", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3279344%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "New York State Association for Infant Mental Health"}, {"end": "2020-07-01", "description": "In an effort to ensure the continued health and safety of those homeless men and women we serve, we have started providing pre-packaged meal delivery. In order to keep up with our other food service obligations, we occasionally seek assistance in the packaging process. Please note, all volunteers must wash hands frequently throughout their shift, and wear gloves and masks at all times. This will take place at our 25th street kitchen, between 6th and 7th Avenues. Due to space and social distancing requirements, spots are limited. Available shifts are seven days per week as follows: 9am to 10:30am 1:30pm to 3:30pm If you are interested in lending a hand with this effort, please reach out for more details. Please note: Any/all potential volunteers must complete a New Volunteer Registration form, which can be found at the following link: http://www.brc.org/volunteer-registration . Once received, you will then be sent an invitation to participate in an orientation via Zoom.", "title": "Help Pre-package Meals for Those Less Fortunate - MANHATTAN", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3291738%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Bowery Residents' Committee, Inc."}, {"end": "2020-07-01", "description": "In an effort to ensure the continued health and safety of those homeless men and women we serve, we have started providing pre-packaged meal delivery. In order to keep up with our other food service obligations, we occasionally seek assistance in the packaging process. Please note, all volunteers must wash hands frequently throughout their shift, and wear gloves and masks at all times. This will take place at our 25th street kitchen, between 6th and 7th Avenues. Due to space and social distancing requirements, spots are limited. Available shifts are seven days per week as follows: 9am to 10:30am 1:30pm to 3:30pm If you are interested in lending a hand with this effort, please reach out for more details. Please note: Any/all potential volunteers must complete a New Volunteer Registration form, which can be found at the following link: http://www.brc.org/volunteer-registration . Once received, you will then be sent an invitation to participate in an orientation via Zoom.", "title": "Help Pre-package Meals for Those Less Fortunate - MANHATTAN", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3291737%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Bowery Residents' Committee, Inc."}], "07424": [{"end": "2020-06-13", "description": "This event is to raise awareness and much-needed resources to fund critical programs to improve the lives of all those affected by brain tumors. Hosted by the National Brain Tumor Society, the Northern NJ Brain Tumor Walk & Gray Mud Run offers individuals and teams a chance to honor and remember loved ones, connect with others interested in the brain tumor cause, and helps to educate the local population on the diverse needs of the brain tumor community. We need volunteers for many different jobs... From manning obstacles to running registration, and everything in between. So let's have a conversation so we can decide what would be the right fit for you! Looking forward to connecting! Suzanne", "title": "Northern NJ Brain Tumor Walk and Mud Run", "zipcode": "07424", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2950416%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "NATIONAL BRAIN TUMOR SOCIETY"}], "07501": [{"end": "2020-07-30", "description": "Now organizing a team to clean then photograph to catalogue the Knapp mural panels. https://www.youtube.com/watch?v=g6r8WpX04X8 Knapp mural is actually over 260 tiles. These tiles are in the museum's storage in temporary space is right off route 19 and 80 on Spruce street in Paterson; its also known as the Art Factory. The Bergen Museum's mural once hung on the Alexander's dept. store on route 4 and 17. It was created by Stefan Knapp and the museum needs volunteers to help clean the panels in preparation of a Knapp Mural Panel Exhibit. po volunteer in assisting in this cataloguing process please contact me. We'd like to have things in place so work can begin in May.", "title": "Clean & Photograph Stefan Knapp 260 Alexander Mural Panels", "zipcode": "07501", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2071510%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Bergen Museum of Art and Science"}], "08876": [{"end": "2020-06-30", "description": "Jersey Cares is partnering with the New Jersey Office on Aging to close the gap on a critical need during the COVID19 crisis. Volunteers are needed for grocery shopping and delivery for seniors in Ocean County, who cannot/should not leave their house. Volunteers will be able to accept flexible assignments. COVID-19 precautions in place, all deliveries are performed using contact-less practices, including front door drop-off. Need to know: Volunteers must agree to background check Volunteers pre-pay for the groceries and are reimbursed (with proof of delivery) via online payment.", "title": "Shopping For Seniors In Somerset County", "zipcode": "08876", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3286569%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jersey Cares"}], "07465": [{"end": "2020-07-16", "description": "#1 Most important: Please, fix flashing around the vent from the stove. It is a flat roof. It leaks into pails in the kitchen when it rains now! 2. Please, rehang some fallen gutter leaders. Thank you. Please call Betsy at 862.200.5125.", "title": "Roof Work on flat roof", "zipcode": "07465", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3280417%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Strengthen Our Sisters"}], "11762": [{"end": "2020-06-07", "description": "Girls on The Run Long Island is expanding across Long Island and we need your help. No running experience needed! Head Coaches meet two times a week for 90 minutes each time for ten weeks. Assistant Coaches typically are needed one or two days a week. Please see our website to learn more about GOTRLI www.gotrlongisland.org", "title": "Coaches/Assistant Coaches needed in Massapequa", "zipcode": "11762", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3154828%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GIRLS ON THE RUN LONG ISLAND INC"}], "06901": [{"end": "2020-06-14", "description": "The Conservation Training Partnerships program is for both high school students (grades 9 to 12) and adult volunteers. This program includes a 2-day workshop that introduces participants to innovative, user-friendly online mapping technology that can be utilized to study and address local conservation issues. At the workshop, teen and adult partnerships are formed to brainstorm and carry out conservation projects in the participants&rsquo; hometown. Visit https://nrca.uconn.edu/students-adults for more information and to apply.", "title": "Conservation Training Partnerships - Stamford", "zipcode": "06901", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3270337%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "UConn Natural Resources Conservation Academy"}], "08544": [{"end": "2020-08-09", "description": "We are looking for some very special people who have the passion, time, and especially, the illustration skills needed to help us populate our proprietary reading materials child-friendly, colorful, happy, creative and otherwise wonderful drawings that potentially millions of children will see on their path to learning how to read. Have you ever wanted to do something AMAZING to change the world but didn't know where to start? Here is an opportunity to help underprivileged children, to help under-served children, to help ALL children displaced from school due to COVID-19, and even to help many adults who can't read. We are looking for three, very special people, who have the skills, expertise, experience, passion, and time to be part of something amazing that is about to fundamentally change the lives of millions of children. Right now, millions of children have no hope; but soon, they will have the opportunity to learn how to read, which, in turn, will open a window to education and to a world of potential for them that, not only, has never been opened before, but that has never even been seriously contemplated as a potential reality. What we are talking about is an adaptive learning, gamified smartphone app, called FUNetix, that can literally, teach a child how to read, in the comfort of their home, in an average of just 12 hours of total use time! We are the American Youth Literacy Foundation, and we have been teaching children how to read for nearly 12 years! We have been developing this app for about two years, and this year we will launch this incredible smartphone app in the App Store and on Google Play by Thanksgiving, 2020, to help save millions of children from a lifetime of illiteracy! Already, there are millions of children who are struggling to learn how to read. Already, there are millions more who have given up on reading and are destined to go through life either completely illiterate, or with semi-literate skills at best. And now with the displacement of tens of millions of children from school, for an indeterminate amount of time , the loss of reading capacity of the next generation presents a new, crisis moment in American education Â and a very real threat to the future success of millions of young students. We are partnered with an engineering team that was one of the five $1 million finalists in the XPrize for Global Learning competition (the winners of which were announced this past May), which was a worldwide competition for app \\\"design and development\\\" teams from around the world to design, build and deliver a tablet-based app to children in remote villages in Africa which could teach them how to read and do basic math (children of all ages, most of whom had never been to school before in their lives). The curriculum that our app is based on is a patented reading decoding system, and is so effective at teaching children how to read, that it usually only takes 4-6 hours for them to understand the basic learning tools, and another 4-6 hours for them to reach a 2nd grade reading level. Compare this to so many of our students who have been in the public school system for 6 years and still can't spell the word \\\"the.\\\" Compare this to millions of students who have dropped out of school, primarily because they can't read (more than 10 million per decade). More than 20 million children in grades 3-12 in America's public schools today can't read! Our organization is an 11 year old, nationwide, charitable 501 c 3 non-profit. We started out as a tutoring program and we still provide one-on-one tutoring. But our focus has always been on finding a scalable solution to the literacy crisis in America. With the rise of the smartphone and the amazing penetration of this powerful tool (currently estimated at 80%), even into the most impoverished communities, we feel that the answer we have been searching for IS in the form of an app. So for the past several years we have been working to convert our amazing reading curriculum, that teaches children how to read in an average of just 12 hours, into an app that teaches children how to read in about the same time. And this is where you come in. The App is comprised of approximately 2,000 unique screens, each of which is fully narrated. After the child learns the fundamentals of letters and sounds and how to blend sound symbols to form words and sentences (using a super-child-friendly, phonetic code called 21E), we transition them to English, where we utilize our patented diacritic decoding system to introduce them to the irregular letter patterns found in English spelling. From there, we continue to increase students' awareness of the various letter patterns and combinations, while simultaneously introducing them to more and more complex sentences, stories and interactive, fiction and non-fiction content. As students progress in their reading capability, we begin to introduce primers, books, stories, games, puzzles and other content that will be embedded within the learning modules AND that children will have access to in our \\\"Wonderful Content Library\\\" that is unlocked after they have finished the 12-hour structured curriculum. There's much more to tell. You can read more about our story and about us on our website at www.FUNetix.org and at www.YouthLit.org . We are looking for some very special people who have the passion, time, and especially, the illustration skills needed to help us populate our proprietary reading materials child-friendly, colorful, happy, creative and otherwise wonderful drawings that potentially millions of children will see on their path to learning how to read. If you wish to be considered for this opportunity to be one of volunteer children&rsquo;s book illustrators, please send us a sample of your artwork by replying to this listing. When you reply you will receive an auto-reply email containing an attached pdf. Follow the instructions on the pdf to illustrate ONLY ONE of the two story samples. (Each sample contains 2 screens, so you will be illustrating 2 screens from the same story.) Send your samples to info@FUNetix.org and we will respond to you if we choose your illustration. EVEN IF we don&rsquo;t choose you to illustrate one of the sample stories, we may still contact you to illustrate one of our many other stories or books. We are looking for intelligent, creative, enthusiastic, cheerful, optimistic individuals who can present a \\\"look and feel\\\" to children ages 5-9 that is happy, not scary; uplifting, not sad; bright and colorful, not dark or ominous; cute or whimsical, or otherwise conveying a positive outlook on the world. Thank you! We hope this opportunity finds you at the right place and the right time to make a difference and an impact, in an amazing way, for millions of children who are waiting for someone, or something, to lead them out of a life of impoverishment and into a future of unlimited possibility and potential through literacy. We look forward to seeing your work. All ages are welcome to contribute! Mr. R. Kali Woodward Founding, Executive Director", "title": "Princeton: Artists / Children's Book Illustrators: Help Solve the Literacy Crisis", "zipcode": "08544", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3291087%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "American Youth Literacy Foundation"}], "08540": [{"end": "2020-08-03", "description": "Becoming a peer support group facilitator at Good Grief is a unique, engaging, and transformative volunteer experience. Facilitators at Good Grief help to create a safe and empathic environment for grieving children and families after the death of a loved one by helping foster resiliency and develop healthy coping skills that will serve them for the rest of their lives. Good Grief is respected as a national leader in delivering childhood bereavement services. Since its founding in 2004, the mission of Good Grief has been to provide free and unlimited support to grieving children, teens, young adults, and their families after the death of a parent or sibling.", "title": "Become a Peer Support Group Facilitator at Good Grief: Princeton", "zipcode": "08540", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3286007%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Good Grief"}], "11212": [{"end": "2020-06-30", "description": "Several temporary volunteer opportunities exist for Certified Nursing Assistants, Licensed Patient Care Technicians and Licensed Practical Nurses to assist during this current Pandemic. Must be able to be medically cleared, and background checked. Various shifts exist at Brookdale Hospital Medical Center and Schulman and Schachne Institute for Nursing and Rehabilitation.", "title": "CLINICAL VOLUNTEER OPPORTUNITIES", "zipcode": "11212", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3284938%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "THE BROOKDALE UNIVERSITY HOSPITAL AND MEDICAL CENT"}], "11217": [{"end": "2020-08-09", "description": "The Human Resource Assistant position at A Free Bird provides support to the HR Director for all HR administrative processes. The role will be responsible with assisting with recruitment, onboarding, and researching information pertaining to the Human Resources Department. The Volunteer/Intern will maintain records and information for the business. The assistant will schedule appointments, have the ability to work independently and within a team environment; ability to efficiently organize materials and information, ability to easily adjust to changing conditions, maintain effective working relationships with employees an individuals. Responsibilities: -Creating spreadsheets & documents within google drive and Microsoft office. -Assisting with Calendar appointments -Scheduling and participating in interviews -Recruitment & Onboarding of new team members -Organizing and updating documents relating to HR - Creating a pool of volunteers and interns - Updating and posting of jobs online - Evaluating resumes as per job descriptions -Communicating with volunteers/interns and outside representatives as required Competencies: -Working towards/completed a qualification in Human Resources -Ability to maintain confidentiality at all times -Understanding of Google Drive -Understanding of Microsoft Office Suite - PowerPoint, Excel & Word -Highly organized and professional", "title": "HR Assistant", "zipcode": "11217", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2970099%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird, a 100% volunteer-based 501(c)(3) non-profit arts education organization, that strives to empower children with cancer by inspiring and nourishing their artistic passions is looking for a Post Production proficient in adobe premier, adobe after effects (not required), color correction, audio editing and audio mastering. Video Editing. For questions about the position please let us know, get in contact with us!", "title": "Post Production Volunteer", "zipcode": "11217", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2823411%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 6-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. We are seeking a Volunteer/Intern Graphic Designer who can commit 150 total hours over 3 months. We encourage undergraduate and graduate students seeking a for credit internship or fellowship to apply Responsibilities: Working in Photoshop to create layouts, CADS, and design web graphics, Working in Illustrator to create vector objects, print files, and marketing materials. Working in InDesign to create automatic catalogs and other materials. Working with Excel and outlook to update spreadsheets, schedule meetings, answer emails. Skill requirements: Very well trained in CS6 or earlier, especially Photoshop, Illustrator, and InDesign. Working knowledge of Excel, Outlook, Word, and PowerPoint. Knowledge and use of keyboard shortcuts and how to do tasks the fastest way. Knowledge of HTML programming is a plus, but not required. Position requirements: Detail oriented, organized, and a quick learner Follows instructions and completes projects in a timely matter. Work with minimal supervision, a proactive problem solver. Excellent references, grades, & portfolio (even a student portfolio) are required.", "title": "Volunteer Graphic Designer", "zipcode": "11217", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2046390%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "07305": [{"end": "2020-06-30", "description": "This Shelter is looking for Foster Care/Permanent Homes for Large Breed Adult Dogs. Once Application is completed and approved, \\\"Curb Side \\\" Pickup is available and supplies are provided.", "title": "Fostering/Adoption Shelter Pets - Hudson", "zipcode": "07305", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3281290%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jersey Cares"}], "10035": [{"end": "2020-06-07", "description": "Hellooooooooo New York Mia's Heartbeat is excited to begin it's fund-raising efforts in New York City at the 2020 Governor's Ball Music Festival. Volunteers will be functioning as Ticket Takers and Ushers during this Awesome outdoor experience at the Infamous Randall's Island Park. REQUIREMENTS: 18 years old or older State photo ID Pleasant and Positive Attitude Must pass CSC security clearance Orientation", "title": "Governor's Ball Music Festival in NYC: Volunteers Needed", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3271102%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Mia's Heartbeat"}], "11231": [{"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3) non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. After a very incredible and successful year, we are seeking a highly skilled Marketing Intern who can commit 5-10 hours per week for minimum of 3 months. Position is non-paid but can apply for school internship credit. Responsibilities: Assist with daily project management of digital and traditional marketing, working with Marketing Coordinator on strategy, analytics and logistics Coordinate the working document to track projects cross-departmentally Assist in Managing timelines for e-appeals, campaigns, cultivations and optimizations (such as donor pages, homepage and confirmations); Assist with Managing timelines for vetting of direct mail pieces for six different appeals monthly; Assist with coordinating the Integrated Marketing Calendar of all fundraising and cultivation activities; Liaison with the Programs, Graphic Design/Web, Fundraising and PR departments Draft marketing copy for brochures, posters, presentations and other organizational collateral; Coordinate with the Graphic Design and Web department with copy for creative projects; Performing other responsibilities as may be required. Qualifications: Excellent writing and editing skills with ability to produce polished and compelling copy on tight deadlines Creativity in tapping and cultivating mainstream media and social networking communities A positive, energetic and proactive multi-tasker who can work independently or very collaboratively, as part of a team Ability to work effectively, efficiently, diplomatically and calmly in a high-pressure environment on issues that are often complex and politically sensitive Strong listener, with a high degree of professionalism and flexibility, including the ability to prioritize and effectively manage assignments in a timely fashion", "title": "Marketing Assistant", "zipcode": "11231", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3191184%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}, {"end": "2020-08-09", "description": "A Free Bird is a 501(C)(3)non-profit organization based in New York City. Our focus is to provide children, ages 4-18 who are patients or survivors of juvenile cancer, the opportunity to explore their artistic passions and give them the strength to fight their disease. We believe that artistic expression is critical for healing! A Free Bird supports children affected by cancer in their exploration of art, music, acting, poetry, writing, singing and any other artistic passion they may have. Responsibilities: Assisting the Marketing Coordinator with any Job responsibilities. Contacting potential donors/sponsors to help out the organization. Following organization protocol when it comes to emails/phone calls. Using templates within google drive to contact companies, also sharing folders with volunteers/interns. Researching/assisting with any job related tasks available to the assistant for review. Overall Responsibilities: -Emailing donors/sponsors. -Researching information. -Assisting Coordinator/Director with any job duties. -Ability to create templates/sharing potentially with other volunteers/interns and also outside vendors. -Keeping records of donors/sponsors. -Emailing other people with proper email etiquette. -Must support and maintain mission goal and statement of organization. Competencies: -Has/working towards in degree in Marketing or related field. -Excellent communication skills. -Understanding of Google docs and Microsoft Office.", "title": "Marketing Assistant", "zipcode": "11231", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2105534%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "A Free Bird"}], "10011": [{"end": "2020-06-17", "description": "Care For the Homeless is holding its seventh annual Summer Solstice Success Celebration in June. Date is still tentative and to be announced but we are looking at June 17, 18, 23 or 24 th. The celebration will be held at the LGBT Center, 208 West 13 th Street, between 7 th and 8 th avenue. This event celebrates the heroic successes of some of our clients in overcoming the immense obstacles they face in obtaining and maintain housing, successfully managing health care challenges and in overcoming other challenging situations while unstably housed. We would like to recruit volunteer musicians and a singer to participate in the event. We ask for a commitment for the length of the program, which is from 5:00 p.m. to 6:30 p.m. The hope is to have upbeat celebratory music to entertain those in attendance and celebrate our awardees. There is a piano on site in case that is something a musician would want to use. The acoustics of the space are great. Please feel free to reach out with any questions. What we as of the musicians: To play happy, cheerful, upbeat music as people are entering and eating between about 5-5:30 p.m. A \\\"sing a-long\\\" song around 6 p.m. (or about halfway through the program), and an exit song We will provide you with more details as we get closer to the event. If you are interested in volunteering, please provide us with a sample of your music in any format you have available. We look forward to working with you!", "title": "Musician needed for 2020 Summer Solstice Celebration!", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3137110%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Care For the Homeless"}], "11235": [{"end": "2020-08-13", "description": "Are you a high school student who would like to have a meaningful summer? Do you speak Russian fluently? We want you to join us for DOROT's Summer Teen Internship in Brighton Beach! To learn more about this internship, please click here or contact Peri Smilow at psmilow@dorotusa.org.", "title": "DOROT's Summer Teen Internship in Brighton Beach", "zipcode": "11235", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3271985%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}], "07205": [{"end": "2020-06-30", "description": "Marketplace in Hillside is a project dedicated to battling hunger and poverty in our community. During this time volunteers would make a measureable difference in the lives of many by assisting to sort and organize emergency boxes for the community. Volunteer Guidelines: COVID-19 Protective Equipment: Masks, Gloves, and Sanitizer will be provided Avoid touching your eyes, nose, and mouth with unwashed hands. Clean and wash your hands before, during, and after volunteering for a minimum of 20 seconds. If soap and water are not readily available, use a hand sanitizer that contains at least 60% alcohol. Need to know: Onsite parking available Dress comfortably", "title": "Emergency Cargo in Hillside", "zipcode": "07205", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3281285%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jersey Cares"}], "11753": [{"end": "2020-07-22", "description": "United Cerebral Palsy of Long Island's Night In Monte Carlo is a fundraiser which benefits the programs and services provided by UCP-LI to individuals with disabilities. For every dollar raised, $.92 goes into those programs and services. Fundraisers such as Monte Carlo play a big part in our effort to create a Life Without Limit for people with disabilities. Our volunteers play a big part in the success of any event. The evening of the event, volunteers assignments are comprised of registration duties, raffle sales and raffle distribution at the end of the event. A week before the July 22nd event, we ask volunteers to attend a luncheon where we will go over the details and logistics of the evening to be followed with assignment distribution.", "title": "UCP-LI 2020 Night In Monte Carlo", "zipcode": "11753", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3251986%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "UNITED CEREBRAL PALSY ASSOCIATION OF LONG ISLAND INC"}], "10451": [{"end": "2020-08-14", "description": "Overview: South Bronx United Coaching Interns will assist with the SBU Soccer Scholars program, which combines soccer and education to keep youth active and learning during the summer months. Interns will have the opportunity to serve as soccer coaches during the program and may also have the option of serving as assistant teachers or coordinators during the mornings. When: June 24th - August 9th Monday-Thursday, 12:30pm-4:00pm Where: Mott Haven Campus Soccer Field 730 Concourse Village West, Bronx, NY 10451 Training: All interns will be trained, supervised, and mentored by our Education Director and Director of Coaching. All interns will have an opportunity to attend training and orientation prior to the beginning of Summer Scholars. Additional training and supervision will be provided by SBU&rsquo;s Executive Director, a career coach and educator. Benefits: This internship is UNPAID. Interns will have the opportunity to get first hand coaching experience and feedback from veteran coaches. Position in Detail: The intern will receive training from experienced coaches and be asked to help in the creation of coaching materials and daily practice regiments. Coaching interns will be expected to coach a team of players, lead them through soccer drills and games, and serve as coach/manager during the \\\"SBU World Cup.\\\" Coaches are expected to be caring adult mentors for student-athletes in the Summer Scholars program. Additionally, Coaching interns who are interested may have the option to get experience as assistant teachers or coordinators during the academic portion of the day (depending on their experience and interests). Coaching interns may also be asked to chaperone field trips on Fridays. Qualifications: Enthusiastic and caring with a background in soccer. Specific interest in coaching, social work, counseling, education, or youth empowerment is a plus. No prior coaching background necessary.", "title": "Summer Soccer Scholars: Coaching Internship", "zipcode": "10451", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2821944%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "South Bronx United, Inc."}], "11434": [{"end": "2020-07-03", "description": "Help single working parents by teaching their children at vacation bible school this summer. Parents have to go back out to work and many have no one to watch their children. Lets teach the kids literacy and understanding through bible stories, art, crafts, literacy, math and growing vegetables. Older adults, maybe retired who want to help are welcomed. Program starts tentatively June 1 and goes until July 3 2020.", "title": "Teachers, Mentors, Tutors Needed for Vacation Bible School", "zipcode": "11434", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D3291528%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Royal People Group, Inc"}]}