{"10004": [{"end": "2017-07-10", "description": "As our program participants prepare for theirinternship experiences they present a summary ofthe skills that they have gained as well as their strategies for success on their internship. Join us for a day of celebrating past successes, and looking forward to new opportunities.", "title": "Internship Readiness Presentations", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2536285%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Year Up New York"}, {"end": "2017-07-24", "description": "As program participants near the end of the program, they are asked to demonstrate their mastery of several \\\"soft skills.\\\" Volunteers act as a panel of judges grading dining etiquette knowledge, vocabulary usage, and elevator pitches.", "title": "Professional Skills Olympics", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2536278%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Year Up New York"}, {"end": "2017-07-29", "description": "Let's Get Ready provides low-income and underprivileged high school students with free SAT preparation, college admissions counseling and assistance, as well as other support services needed to gain acceptance to and graduate from college. We are looking for professionals from all fields that are willing to share their career experience with motivated students at Let's Get Ready's summer 2017 Career Day. The Career Day will be held on Saturday, July 29th in Manhattan from 12 pm - 3 pm, with the exact location TBD. This is a fun opportunity to mingle with other professionals while also helping to prepare smart, ambitious, college-bound students for success in the \\\"real world.\\\" Every year our students look forward to Let's Get Ready's summer Career Day event, and we are hoping that you will join us to help our underprivileged students. Please consider volunteering your time to help us make a difference in our students&rsquo; future. Volunteers are strongly encouraged to share this opportunity with friends and colleagues who they believe also have experiences and expertise consistent with the goals of the Career Days. Volunteers may range in work experience from temporary interns to full-time employees to retired professionals. If you are interested in volunteering at this summer's career days or have any further questions or concerns please RSVP below on the nonbinding google form and/or contact the coordinator for this event at sparikh@letsgetready.org or (646)-216-2316. Thank you so much for your consideration! Please register here: https://goo.gl/forms/90TAmQbrWro6EcuW2", "title": "Career Day 2017", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715606%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Let's Get Ready"}, {"end": "2017-07-30", "description": "The New York Poetry Festival showcases all of the different formats, aesthetics, and personalities of New York City reading series and collectives, in one place at one time. The festival intends to create branches between disparate poetry communities, and other artists and artisans, by bringing poetry out of the dark bars and universities and by placing it in the sun. The Poetry Society of New York will once again invite New Yorkers to come together for this two day festival to celebrate NYC&rsquo;s vibrant poetry community. The event will include over 60 poetry organizations and 250 poets on its three main stages, plus an open mic, vendor's village, and children's festival complete with writing games and it's own, miniature stage! This event takes place on July 29th and 30th from 11am to 6pm on Governors Island in New York City.", "title": "Help unite the New York Poetry scene! Volunteer for the 2017 New York City Poetry Festival!", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1395952%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Poetry Society of New York"}, {"end": "2017-08-18", "description": "Be part of the movement of college students helping high school students get into and graduate from college! As a College Access Coach, you will coach and mentor a small group of high school students by providing FREE SAT preparation and college admissions counseling to students who do not have access to college preparation support. The commitment includes: One evening per week from mid-June through mid-August (times vary from between 5:30-8:30pm) Locations throughout NYC in Manhattan, Brooklyn, Queens, and the Bronx Training session prior to start of program to prepare you to teach SAT material and College Choice curriculum You'll gain: Excellent hands-on education field and non-profit experience Training and professional development that will make your resume stand out Opportunity to impact students on a personal and systemic level! Questions? Contact ominick@letsgetready.org to learn more and apply!", "title": "Calling all college students who are passionate about education & mentorship!", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2549077%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Let's Get Ready"}, {"end": "2018-06-30", "description": "The Board of Engineers (BoE) is a passionate group of volunteers that supports Blue Engine&rsquo;s mission and work through program-related initiatives, and fundraising and awareness-building campaigns. Committed to facilitating in-classroom instruction that taps the infinite potential of all students, board members give of their time, expertise and resources to ensure the sustainability of Blue Engine&rsquo;s team teaching model. Each fiscal year (July 1 st - June 30 th), the board develops and executes a robust calendar of events/campaigns to reach goals established in partnership with Blue Engine staff. The BoE seeks energetic recruits to bring committee activities to life! The board employs three committees to support Blue Engine's work in classrooms: Program Initiatives Committee - plans a series of professional development and networking activites for Blue Engine teaching apprentices. Fundraising Committee - plans fund/friend-raising events to expand Blue Engine's supporter network and build greater brand awareness. Corporate Engagement Committee - develops relationships with potential corporate funders and conceptualizes engagement touch points for current funders. Committee members also work toward an individual fundraising goal of $1,300: the per student cost of Blue Engine's work in classrooms. To join the Board of Engineers, please click the \\\"I want to help\\\" button above or visit www.blueengine.org/boe-application to complete our online application. To learn more about this opportunity and Blue Engine, please email Morolake Odeleye, Blue Engine Development Manager, at morolake@blueengine.org.", "title": "Join the Board of Engineers! Help us unlock student potential.", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2644363%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Blue Engine"}, {"end": "2017-07-13", "description": "Year Up New York is seeking individuals to volunteer their time to tutor for the IT track participants of the professional skills training program at Year Up New York. Providing adequate academic support is essential in our mission of closing the opportunity divide. Read more about Year Up NY at http://www.yearup.org/about-us/our-locations/new-york/ or watch a recent mini-documentary about us at · http://fortune.com/2016/11/02/youth-unemployment-opportunity-divide-skills-gap-threatens-americas-economic-future/ . Key Responsibilities: Provide academic support in areas of IT track training to expand understanding (specific details below) Hold open tutoring sessions each week Provide one on one tutoring for Year Up training program participants Optional participation in participant events including, but not limited to- mock interviews, presentation critique, and resume review. IT Course/Track Description: In this course participants receive a thorough introduction t o software, hardware and networking. Participants learn and practice skills used in preparation for the daily activities required of professionals in a business and or helpdesk environment. These skills include diagnosing, troubleshooting and repairing software, hardware, and network components, installing and maintaining operating systems, applications, and working on deliverables independently and as part of a project team. The outcome of this course is to prepare participants with the business and technical skills necessary for internships and professional helpdesk, and junior network administration positions. Through a focus on the practice of hands on installations, diagnosis and repair, participants learn techniques that produce effective technicians. Qualifications: Candidate will ideally have expertise in the following subject matter: Hard Skills Computer diagnosis Computer repair Computer assembly/disassembly Computer imaging Network Design Network Setup Network Maintenance Time Commitment: Tutoring sessions are usually held for around an hour, on one or more of the following days/times: 11:30am-12:30pm during the scheduled lunch hour on Monday, Tuesday, or Thursday 2:10-3:30pm on Tuesdays during the participants&rsquo; Independent Study Time 3:45-4:45pm on either Monday, Tuesday, or Thursday Training/Support Provided: All volunteer tutors will meet instructors of the track they are tutoring for to discuss curriculum and will have the opportunity to attend training sessions if necessary. They would also meet with the volunteer supervisor to receive an orientation for the tutoring program where all necessary information will be given regarding schedules, information about participants on mandatory tutoring, as well as additional volunteering opportunities. Benefits: Being a volunteer at Year Up provides you with the rewarding experience of making a positive difference in the experience of our program participants. Volunteer Supervisor and Contact Information: Please insert your resume in the message body and include a brief note about why you are interested in volunteering as a tutor at Year Up. This will be reviewed by the volunteer leader within a week of your submission. Carissa Chunasamy cchunasamy@yearup.org (646) 346 - 8534 Academic Support Associate/Volunteer Supervisor", "title": "Help a Young Adult as an IT Tutor!", "zipcode": "10004", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2509787%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Year Up New York"}], "10005": [{"end": "2017-06-29", "description": "Event Date: June 29 The speaker is needed from 3:00pm - 4:00pm Workshop and Distribution Event in conjunction with our sponsor Morgan Stanley. Seeking a one-time volunteer DENTIST and DERMATOLOGIST for a short session during a workshop to educate Homeless Elementary School Children on how to take care their mouth/teeth and skin. The professionals submitting your services will be featured on the organisation's website (Dare2B) as a sponsor! You can contact us for more information at volunteers@dare2b.org", "title": "Workshop and Distribution Event - Dentist & Dermatologist Needed", "zipcode": "10005", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2707075%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DARE2B INC"}, {"end": "2018-02-08", "description": "Girl Vow, Inc is seeking volunteer women mentors who can conduct various gender-focused workshops or who are interested in mentoring a girl for an academic year. You must live in the NYC area. Please send an updated resume to the email address girlvow@gmail.com.", "title": "Mentor Girls in the Foster Care & Juvenile Justice Systems", "zipcode": "10005", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2091428%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Girl Vow, Inc."}], "10007": [{"end": "2017-07-31", "description": "This is a great opportunity to introduce healthy eating habits and the joys of cooking to groups of 25 girls grades 9-12. We need highly organized, self-motivated, and outgoing volunteers to help us prepare and deliver Cook Play Live&rsquo;s Buds multi-cultural and interactive curriculum. You will: Work as a team with a Lead Educator to prepare for and implement interactive cooking and healthy eating activities following a provided curriculum Set up food preparation and cooking equipment, supplies, and educational materials Share your knowledge about origins, culinary uses and/or health benefits of ingredients Maintain food safety, including cleaning and sanitation of all cooking equipment used in cooking activities Engage with and direct middle schoolers in various activities including meal preparation Our ideal volunteer has: Basic knife skills and ability to execute basic cooking techniques Experience or training in nutrition or cooking for large groups Dynamic personality and excellent presentation, interpersonal and communications skills Ability to stand and walk for extended periods, and carrying heavy and bulky items Knowledge of or enthusiasm about food and nutrition issues as part of multi-cultural healthy living is a plus! Volunteer sessions are: A) From 9:15 am to 11:45 am July 10, 11, 17, 18, 24, 31 or B) From 11:30 am to 1:30 pm on July 10, 11, 17, 18, 24, 31 Volunteering for all six dates makes the program particularly impactful and beneficial to the youths.", "title": "Get HS Girls Healthier: Volunteer with Cook Play Live's Nutrition and Culinary Program", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2678921%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Cook Play Live"}, {"end": "2017-07-31", "description": "This is a great opportunity to introduce healthy eating habits and the joys of cooking to 20 girls grades 6-8. We need highly organized, self-motivated, and outgoing volunteers to help us prepare and deliver Cook Play Live&rsquo;s Sprouts multi-cultural and interactive curriculum over 6 sessions on July 10, 11, 17, 18, 24, 31 from 1:00pm to 3:30pm. We ask that you be able to commit to multiple sessions, ideally all 6. You will: Work as a team with a Lead Educator to prepare for and implement interactive cooking and healthy eating activities following a provided curriculum Set up food preparation and cooking equipment, supplies, and educational materials Share your knowledge about origins, culinary uses and/or health benefits of ingredients Maintain food safety, including cleaning and sanitation of all cooking equipment used in cooking activities Engage with and direct middle schoolers in various activities including meal preparation Our ideal volunteer has: Basic knife skills and ability to execute basic cooking techniques Experience or training in nutrition or cooking for large groups Dynamic personality and excellent presentation, interpersonal and communications skills Ability to stand and walk for extended periods, and carrying heavy and bulky items Knowledge of or enthusiasm about food and nutrition issues as part of multi-cultural healthy living is a plus!", "title": "Inspire Girls to Eat Better: Volunteer with Cook Play Live's Nutrition and Culinary Program", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2678790%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Cook Play Live"}, {"end": "2017-12-15", "description": "Day One partners with New York City youth to end dating abuse and intimate partner violence through community education, counseling, legal advocacy and youth leadership development. We use an empowerment model that invests young people in maintaining safe relationships for themselves and their peers. Day One is seeking an undergraduate or graduate student, or a community member, to participate in a part-time, unpaid Development and Event volunteer opportunity from August until December 2017. The volunteer's primary responsibilities are: Assist in planning related to Day One events Organize sponsorship opportunities, auction solicitation and coordinating a database of guests and volunteers. Generate communications with donors (including an electronic newsletter, periodic written appeals and thank you letters), Manage educational material requests HOW TO APPLY Please submit a cover letter and resume to Namasha Schelling, Program and Communications Coordinator, by email to nschelling@dayoneny.org.", "title": "Development and Event Volunteer", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715713%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Day One"}, {"end": "2017-09-30", "description": "The National September 11 Memorial and Museum welcomes millions of visitors each year from around the world. 9/11 Memorial & Museum volunteers play a critical role in providing visitors with a meaningful experience. Summer Visitor Services volunteers help with operations at the Memorial & Museum during this busy time. They ensure visitors feel welcome by proactively greeting and answering questions. We are seeking Visitor Services volunteers who are friendly, outgoing, courteous, and comfortable with interacting with Memorial & Museum visitors. Duties include: -Welcome and interact with visitors -Inform visitors about the programs and exhibitions available inside the Museum -Assist visitors with directions -Direct visitor queues and pathways Summer Visitor Services volunteers work at least eight hours per week for 2-3 months. It is also requested that volunteers maintain the same shifts each week. The Memorial & Museum is open every day. Volunteer posts require the ability to stand for up to four hours at a time, inside the Museum and occasionally outdoors on the Memorial. You must be 16+ years old and successfully complete our application process. We provide all the training for volunteers to perform their duties effectively. Volunteering is a rewarding experience that enables individuals to develop interpersonal and teamwork skills. Join our exceptional team today. For more information and to apply, please visit: www.911memorial.org/volunteer", "title": "Summer Visitor Services volunteer", "zipcode": "10007", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2275908%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "NATIONAL SEPTEMBER 11 MEMORIAL & MUSEUM"}], "10001": [{"end": "2017-06-27", "description": "We are looking to have an amazing photographer capture our volunteer appreciation event on our rooftop with a view of the Empire State Building!!! Here is description: -arrive on time - capture event and especially host committee members (atmosphere shots preferred) - be nice -send photos without watermark or logo within 24 hours that can be downloaded. Your name will be on the photos which will be done by our graphic designer. What is required to apply: - must send a portfolio website - must explain why you want to capture this event and help Maya's Hope Please go to mayashope.org to learn more about the organization or visit www.facebook.com/mayashope. We will reach out to you if you're the right fit for the project! Thank you for applying!", "title": "Photographer needed for Volunteer Appreciation Event", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2609272%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Maya's Hope"}, {"end": "2017-07-15", "description": "We are looking for amazing and exceptional individuals to join our host committee for the Maya's Hope Lotus Ball on Friday, October 27, 2017 at 583 Park Avenue! Maya's Hope improves the quality of life of disadvantaged, orphaned and extremely impoverished children around the world. This will be the 6th Annual Gala for Maya's Hope and you can help us reach our goal of $300,000! We are looking for individuals from a wide array of backgrounds: law, medicine, entrepreneurs, real estate, finance and those who want to make a difference! Here's what is required: -Purchase your ticket upon joining ($350.00) - Attend and actively participate in a majority of Committee Meetings In person participation is assumed although a conference call option will be available for those with special circumstances or last minute scheduling issues. - Commit to raising a minimum of $3,500 for the Gala through sponsorships, ticket sales, and auction items with the goal of securing at least one sponsor, one live auction item (Auction item needs include exotic vacation destinations, airfare, unique experiences such as celebrity chef-hosted house parties, rounds of golf with local celebrities, exclusive tickets to sporting or arts event, etc.) - Solicit sponsorships from at least five companies - Solicit in-kind donations such as graphic design and photography services, discounted printing, - Hand address and personalize invitations to at least 15 individuals from your personal network for the Gala. -Be Ambassadors of Maya's Hope -Have integrity and show respect to all volunteers, members of the committee, board and humankind :) If you meet this criteria, please email maya@mayashope.org and you will meet with our gala chairs. If selected, you will be part of an extraordinary event which directly impacts the lives of the children we serve. Here is a video from our gala last year: https://www.youtube.com/watch? v=O_L5YKKcmn0 Here are photos from last year's Gala: https://www.facebook.com/pg/MayasHope/photos/?tab=album&album_id=1365612953457518 We understand that not everyone has the time and resources to meet these expectations, but still have a desire to help. To this end, there are other volunteer opportunities available for those individuals who are unable to commit to the full list of tasks outlined above.", "title": "Host to Join Host Committee for Maya's Hope Lotus Ball Ends July 15, 2017", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2633814%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Maya's Hope"}, {"end": "2017-08-16", "description": "Access Coach A Let&rsquo;s Get Ready Access Coach is a volunteer position for current undergraduate college students or recent graduates interested in supporting high school students from low-income households through SAT preparation and college admissions guidance, many of whom will be the first generation to attend college. Let&rsquo;s Get Ready Coaches are a part of a network of approximately 1,000 college students per year working together to help students build confidence to tackle the SAT and get to and through college. Coaches are expected to commit to: At least one night a week (3 hours) of direct tutoring and mentoring with a group of 5-7 high school students 1.5 hours a week to prepare for each week&rsquo;s lesson and to communicate with students about homework questions, attendance reminders, and other support.", "title": "Coach/Mentor High School Students", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2714243%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Let's Get Ready"}, {"end": "2017-08-01", "description": "The Economic Opportunities Program (EOP) at The Partnership for the Homeless is designed to help clients who are currently unemployed or underemployed find and maintain full-time, sustainable employment as a core part of the road to self-sufficiency. The program prepares clients to find employment, increase their knowledge of financial education concepts, and navigate their career with the help of EOP staff and its network of volunteers. Volunteers with human resources or management-level operations experience in the healthcare, retail, industrial, hospitality, construction, and information technology fields are needed to assist clients in the creation of professional job search documents, including: resumes, cover letters, thank you letters, and other related professional correspondence. Volunteers will be needed tentatively on August 1st and August 14 th from 10am-12pm.", "title": "Resume Writer", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2666375%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Partnership for the Homeless"}, {"end": "2017-09-01", "description": "Institute for Immigrant Concerns, a not-for-profit ESOL school for adult immigrants and refugees, started in 1997, is looking for ESOL instructors. Must have previous English teaching experience (whether domestic or abroad), certificate not essential but a plus. Our students are all motivated and studious adults. Our program is more intellectual than the usual as well, leaving more room form teachers to be creative and introduce own ideas into the curriculum. We have a substancial emphasis on cross-cultural awareness. This is the ideal position for retired teachers or teachers completing a certificate program.", "title": "ESOL Teachers for Adult Immigrants", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2003398%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-09-01", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in French. Experience with immigrants a plus. Duties will include: Intake amd registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organised lists of pertinent student information.", "title": "French Speaking Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1982724%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-09-01", "description": "ESOL School for immigrants and refugees, educating since 1997. is looking for a dynamic and efficient marketing assistant. This is the ideal position for professionals and students wanting to jumpstart their career in marketing. Duties will include: ? Assist with all marketing communications to the student network as required. ? Assist in developing, implementing and monitoring of a social network program. ? Assist in coordinating of the annual, regional, zone and marketing meetings. This includes bookings, invitations, and other duties as required. ? Assist in communicating campaign parameters and details to students ? Assist with the design of monthly flyers, business cards, yellow page ads, and miscellaneous design projects as required. ? Other duties as assigned This is a great opportunity for new graduates who want to get some experience in the non-profit management sector. Lots of leeway for new ideas and out of the box thinking!", "title": "Marketing Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1936547%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-09-01", "description": "ESOL school for immigrants and refugees, educating since 1997, is looking for a qualified and efficient administrator. The most important qualification is bilingual in Spanish. Experience with immigrants a plus. Duties will include: Intake and registration of new students. Assisting with document preparation and mailings. Answering phone calls from students regarding class times and scheduling. Making appointments for ESOL testing. Keeping organized lists of pertinent student information. Requirements for the position include: Bilingual in Spanish Familiarity with Microsoft Office Suite (Word, Excel etc.) Attention to detail This is a great opportunity for new graduates who want to get some experience in the non-profit management sector. Lots of leeway for new ideas and out of the box thinking! Could develop into paid position for the right person. Start time is ASAP.", "title": "Spanish Speaking, Program Assistant", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1924612%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-09-01", "description": "About the Institute The Institute for Immigrant Concerns (http://http://instituteforimmigrantconcerns.com/) is committed to equipping immigrant communities city-wide with English skills, computer training, job readiness, and referalls for social services. The Institute empowers immigrant families and communities in their quest for social and economic independence. To reach immigrants the Institute operates across New York City and frequently collaborates with other community groups. Our staff is as diverse as our clients and draws on talented individuals to create a powerful, sustainable impact in America's newest immigrants. Job Description The Bilingual Administrative Assistant is essential to maintaing an efficient office environment in support of Institute programs, staff, and volunteers. This position will be responsible for general office administration, organizing office resources, coordination of program activities, and program management support. This is an ideal position for those seeking administrative experience at a busy Manhattan non-profit. Though this internship is primarily administrative, it presents an opportunity to get an introduction to non-profit management. Requirements: Commitment to work 3 months minimum Bilingual oral and written skills, preferably Spanish but other languages welcome Excellent written and oral communication Knowledge of foreign language Proficiency in MS Office and Excel Ability to work independently and alongside a team of staff and volunteers with a passion for immigrant empowerment Ability to work in a multi-cultural environment This internship is unpaid, but college credit may be available.", "title": "Bilingual Adminsitrative Assistant(Russian)", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1854257%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-09-01", "description": "ABOUT THE INSTITUTE Launched in 1997, the mission of the Institute for Immigrant Concerns is to equip a citywide population of adult immigrants and refugees of all nationalities with ESOL skills, computer training, job readiness, and referrals for social services thus empowering them to succeed in their quest for social and economic independence. Since its inception the Institute has provided services to 8,000 immigrants, refugees and asylees from 112 countries. Institute students have included an economist from Guinea, a hotel housekeeper from Columbia, a yak herder from Tibet, a butcher from Peru, a sailor from Burma, and a Togolese journalist. The common ground for our students is their incredible motivation and the support they give to each other as they struggle to become self-sufficient. INTERNSHIP SUMMARY The Institute is seeking a well-organized, motivated college/graduate student or recent graduate who is eager to gain hands-on grant writing experience at a busy Manhattan non-profit. Intern will work directly with the Institute Director to draft and edit grant proposals, develop proposals for fundraising campaigns, research potential donors and sponsors, and assist with the development and implementation of special events. QUALIFICATIONS Current college/graduate student or recent graduate Strong writing and research skills Highly organized with attention to detail Excellent interpersonal communication skills as well as ability to work independently Proficient in MS Office Knowledge of foreign language(s) a plus Note: This internship is unpaid; school credit may be available depending on your institution. Interns are expected to work 15 hours a week. Position open until filled.", "title": "Fundraising and Development Intern", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1789209%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2017-09-01", "description": "Institute for Immigrant Concerns, a not-for-profit ESOL school for adult immigrants and refugees, started in 1997, is looking for ESOL instructors. Must have previous English teaching experience (whether domestic or abroad), certificate strongly preferred. Our students are all motivated and studious adults. Our program is more intellectual than the usual as well, leaving more room for the teachers to introduce their own ideas into the curriculum. The education director welcomes his teachers' opinions. We have a substantial emphasis on cross cultural awareness. This is the ideal position for retired teachers or students wanting to jumpstart their career in ESL teaching (we've had a fair bit of both in the past!). Many of our students came to this country to escape persecution or harm in their original country and are trying to get a foothold in the US through our jobs program. They want to become citizens. We are looking for ESL instructors who can teach Tuesdays and Thursdays from 6.00pm - 8.00pm. Please send a resume and cover letter to Donna Kelsh at dkelsh77@gmail.com and Mark Brik at mbrik13@gmail.com", "title": "Assist ESOL Teachers", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1720286%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Institute for Immigrant Concerns"}, {"end": "2018-12-31", "description": "Non-Profit Management/Video Internship for Award-Winning Non-Profit Theater and Educational institution in NYC! This is an intensive Leadership Training Program in non-profit business management. Interns receive hands-on training as a management assistant. Students and professionals skilled in video will assist in videography, video production and editing at our award-winning theater arts and community service organization. We seek intern candidates who are leaders, passionate about making an impact in the community, and possess skills in video production and editing. Are you a professional, detail-oriented person who is positive and curious, with a desire to learn and engage in a process? If yes, then this opportunity is a great fit for you! Interns' will work under the direction of a project manager on a combination of logging, editing, and production of on-going video projects that depend on the intern's skill level. We seek applicants with training and experience logging footage, editing in Adobe Premiere, http streaming, digital shooting, lighting, sound, videography, web design and development. Interns consistently report they gain tremendously from filming and reviewing footage of ATW classes and workshops and have benefited as if they had actually taken creative classes themselves. The Actors Theatre Workshop is an award-winning non-profit theater, educational institution and community center in NYC founded by award-winning actor, director, writer and producer, Thurman E. Scott, an acclaimed master teacher of acting and creative process with over 30 years of professional experience. Stella Adler declared, \\\"Thurman E. Scott is the inheritor of the Stanislavsky legacy and of my legacy. His work advances acting technique for the next generation.\\\" Internships are available for 4 to 18 months in duration and are 20 - 40 hrs per week. This is a non-paid internship program. Application instructions: Go to http://www.actorstheatreworkshop.com/get-involved/internship-program/ to fill out an online application for this position!", "title": "Video Internship for Non-Profit NYC Theater/Education Center!", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2695382%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Actors Theatre Workshop"}, {"end": "2017-08-25", "description": "We are seeking an excellent communicator, writer, and avid social media user as a Marketing and Communications intern to support public relations, marketing, blog and social media for GGP. Social Media and Web Responsibilities: Create content to grow the organization&rsquo;s footprint, including social media and blog posts Research current artisan partners and product, maintain sample closet Expand and maintain GGP&rsquo;s social networking and online presence to promote GGP products, fundraising efforts, and stories of women artisan partners around the world. Create compelling narratives about GGP&rsquo;s partners and work around the world. Research and update country and partner information currently on the website. Craft descriptive and appealing product descriptions for the website. PR and Events Responsibilities: Connect with influential media outlets and journalists to place stories about company news, relevant holidays, and collections Outreach to potential media partners with pitches, press releases and curated line sheets Actively pursue permanent links on like-minded sites, and assist with implementing social media strategy. Organize events designed to engage our target market. Develop and enact a strategy for digital communications with consumers and other key stakeholders to include artisan stories, product information, and resources. Personal Requirements: Excellent research, communication and writing skills Proficient in Microsoft Excel and PowerPoint Experience with social media, blogging and creating public relations campaigns Interest in and knowledge of fair trade and ethical business Able to commit to 2-3 days per week Specific Qualifications (a plus but not necessary): Experience in creating and implementing public relations campaigns, including familiarity with print and online media Proficiency with Photoshop, Shopify, SEO, Adwords Familiarity with e-mail marketing applications like vertical response Interest in fashion, design, or craft production Hours: 18-25 hours/week", "title": "Marketing and Communications Intern", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2684840%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Goods Partners"}, {"end": "2017-08-31", "description": "Thank you for your interest in Maya's Hope! Our mission is to improve the lives of orphaned, special needs, and disenfranchised children on a global scale. We our looking for an extraordinary event planner to join our Volunteer Team. We meet monthly to plan special events like Happy Hours or exclusive events in order to grow our NYC base as well as raise money for our cutie pies in need. If you have or want to gain more experience in event planning, project management, and fund raising, this is the perfect opportunity for you. Please send an email to maya@mayashope.org for more information. Include your resume, phone number, and a good time for a phone coversation about this opportunity. Thanks again! Maya's Hope Volunteer Team", "title": "Event Planner needed for upscale fun events for charity!", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2117071%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Maya's Hope"}, {"end": "2018-01-31", "description": "Make a Difference for Women and Girls! Intern or Volunteer with ChangingThePresent.org About ChangingThePresent.org The NY Times called ChangingThePresent.org \\\"an amazon.com of the nonprofit world.\\\" Our business-like approach channels funding to nonprofits so they can better fulfill their missions. We help them capture some of the $450 billion that Americans, alone, spend each year on birthday, wedding, and holiday presents. We do so by making the experience of donating in a friend&rsquo;s name feel like a rewarding alternative to buying and giving more \\\"stuff.\\\" Visitors can choose from among thousands of tangible gift opportunities (preserve an acre of the rainforest, fund an hour of cancer research, etc.) from hundreds of leading nonprofits, send personalized printed greeting cards, and share wish lists & registries. What You Will Gain from the Experience At ChangingThePresent.org, you will: Make a big impact in the world. You will help channel to nonprofits addressing your favorite causes some of the $450 billion Americans spend each year on presents. That will enable them to do their important work. Use your skills, experience, knowledge, creativity and talent. Assume responsibility and take a leadership role. Learn a tremendous amount. Have a great time working with wonderful people from around the world in a friendly and supportive environment. Enhance your resume with a record of achievement and community service. Earn a great recommendation letter to help advance your studies and career. Focus on Your Field of Study or Your Favorite Cause You can focus on your professional field of studies, including Human Resources (HR), graphics, marketing, social media, communications, finance, business, tech (computer science, information technology, etc.), supply chain management, or accounting. You can also focus on your favorite cause, including any of those listed below. Focus on Your Favorite Causes We address all causes, as well as ethnic, religious, city, and country categories. You can focus on your favorites. Here are some of them: African-American, Aging, Agriculture, Animals, Arts and Culture, Blindness & Vision, Books for Kids , Bullying, Cancer, Catholic, Children, China, Christian, Civil Society, Community Health, Computer Literacy, Conserve Sea And Marine Resources, Deafness, Diabetes, Disabilities, Disaster Relief, Domestic Abuse, Education (Art), Education (Early Childhood), Education (Higher), Education (K-12), Education (Music), Education (Special), Education (STEM), Education (Vocational), Environment, Financial Literacy, Gender Equality, Global Health, Global Warming, Health, Hispanic, HIV and AIDS, Housing, Human Rights, Human Trafficking and Slavery, Hunger, Inclusive Cities, Inclusive Societies, India, Jewish, Latino, LGBTQ, Legal Services, Mental Health, Microcredit, Multiple Sclerosis, Native Americans, New York, Peace, Poverty, Protect Environment And Biodiversity, Public Broadcast, Reduce Inequality, Refugees, Sexual Abuse, Stem Education, Strengthen Global Partnerships, Suicide Prevention, Sustainable Consumption And Production, Sustainable Development Goals, Sustainable Economy, Sustainable Energy, Sustainable Industrialization, Technology, Urgent Action On Climate Change, Veterans, Water, Women And Girls, Youth Sports, etc Our Impact Imagine the impact we can make together as more and more people show their love by sharing the experience of changing the world for the better. The Environment This is a great place to work. We have interns and volunteers from all over the United States and all around the world. The atmosphere is energetic, creative, and fun. We value brainstorming, initiative, sharing, and collaborating. Think of it is a laboratory, studio, seminar, or incubator. We are also casual. We are interested in your brains, creativity and heart, rather than your attire. Want to work in jeans, t-shirt and flip-flops? That&rsquo;s fine with us. Who, Where, When We are glad to hear from great high school, undergraduate, and graduate students, as well as professionals who want to make the greatest impact with their skills. Work at our office or remotely. We are conveniently located at 7th Avenue and 33 Street, across from Penn Station in Manhattan. Full-time or part-time, school-year or summer, day or evening, weekday or weekend. We are glad to have your help whenever and wherever you are available. Unpaid We provide a great experience, but this is an unpaid position. Learn More and Apply Now Are you ready for a great experience and eager to make a difference? Please see the slideshow at www.ChangingThePresent-Join.org. Then send a resume and short cover letter (which should say if you will be here or remote, and when you would want to join us) to: join [AT] ChangingThePresent [DOT] org.", "title": "Intern/Volunteer For Women's Rights", "zipcode": "10001", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2584975%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Changing The Present"}], "10002": [{"end": "2017-12-25", "description": "Global Potential (GP) is a non-profit organization founded in 2007. We provides urban youth from low-income communities with the skills and perspective that enable them to effect positive change in their lives, communities, and the global community, through engagement in leadership training, social entrepreneurship, international cultural exchange and service learning. GP vision is that as youth develop, communities develop. This position is responsible for coordinating providing support to youth participants on their projects by ensuring that deadlines are met. This position will also be responsible for managing Facebook, Linkedin, Instagram, youtube channel and media festival submissions, cultivating partnerships with other youth media organizations, and help to identify funding opportunities. Responsibilities/ QUALIFICATIONS (Who we are looking for) Helping to facilitate media workshops to our youth participants Documenting GP workshops and activities Working in collaboration with other media program staff, including media curator and video editors. Managing and developing social media like: Facebook, Linkedin, Instagram, GP's youtube channel Cultivating our relationships with current and potential media partners, such as Adobe, Tribeca Institute, Reel Works, Manhattan Neighborhood Network, and others Skills in Adobe, Final Cut a plus", "title": "Social Media Coordinator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2721834%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}, {"end": "2017-09-01", "description": "We are seeking a highly motivated, focused, outgoing individual to coordinate our fundraising efforts. The Fundraising Coordinator will be integral in sustaining this growth, making a significant contribution to the organization and the youth we serve. As the coordinator of fundraising events you will play an integral role in ensuring Global Potential's short and long-term fundraising goals. This is an opportunity for a motivated self-starter interested in helping to implement our fundraising strategy over the course of the next year. You will be spearheading fundraising efforts and delegating tasks to other staff while receiving support and guidance from the Director of Operations. Responsibilities include: Facilitating fundraising campaigns including donor appeals Assisting in the production of fundraising and promotional materials Managing organization&rsquo;s member and donor database Opportunities include: Providing creative fundraising ideas Attending events in the community to engage new members and donors Becoming familiar with the inner workings of a non-profit organization This is an unpaid internship. Qualifications (Who we are looking for): Self-motivated, detail-oriented, enthusiastic personality Ability to work independently and creatively, as well as part of a team Solid writing, communication, organizational and time management skills Strong computer skills (PC or MAC): Microsoft Office, Internet Knowledge of Salesforce a plus Spanish Language a plus Education: College or Master level Other work requirements: Passionate about underserved youth and commitment to GP mission, interest in working with nonprofits or in international development.", "title": "Fundraising Coordinator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2685805%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}, {"end": "2017-08-31", "description": "Global Potential (GP) transforms youth from underserved communities through education, service learning and cultural exchange into globally competitive leaders of positive change in their lives and communities. GP is an 18-month transformative out-of-school time and summer program based in New York City. The GP program includes 14.5 months of workshops locally and 1.5 months of international service learning and cultural exchange in the Dominican Republic, Haiti, and Nicaragua. Global Potential seeks energetic facilitators to help us conduct preparatory workshops and evaluations with youth and community members Facilitate participatory dialogue between GP partner communities, GP youth councils, local leaders (international), partner high schools (local), NGOs (IDDI, CEDESO, Peace Corps, World Vision, Municipal Government), GP youth, and the GP staff team to ensure empowerment of the community and equal and respectful power dynamic Attend staff meetings, conferences, external meetings, professional development trainings, conference calls, webinars, and networking events as appropriate Provide and receive feedback to/from supervisors locally and internationally, report back to supervisors on a weekly basis on all tasks Job type: Volunteer Job location: Nicaragua, the Dominican Republic, Haiti Volunteer Fees: All expenses covered by Global Potential (including flight and accomodations & meals) Job length: 4 Months Start date - End date: May 1-August 31, 2017 Commitment hours: 10-15 hours per week in May and June; full time+ from July 1st to August 18th (approximate dates) with 2 days/1 night off (contingent upon coordination with your team and community); 10-15 hours per week after trip to deliver all paperwork. Position reports to: Chief Program Officer or International Program Director and Field Staff Director Specific responsibilities: Guide workshops, youth development, evaluation, and needs and impact assessments Work closely with GP youth participants to provide support for youths&rsquo; personal development through weekly individual and group advisory/evaluation meetings Work together as team members and role models with GP youth participants and GP&rsquo;s Youth Councils on infrastructure and social development projects in GP partner communities Work closely with GP Youth Councils in administering evaluation and needs and impact assessments, organizing community service events, workshops, and conducting site visits Collaborate in the planning and implementation of the GP Youth Leadership Conference Other Work Requirements: Adhere to GP&rsquo;s rules and procedures, including time and duty commitments; commitment to learning new technologies and social media platforms; and maintenance of GP&rsquo;s cloud-based office spaces. Be open-minded, adaptable, flexible, culturally sensitive, professional, respectful, tolerant, and work to build solidarity with the communities we serve. Ensure a SAFE and EDUCATIONAL experience for staff, youth, and community members. Be an integral part of the team and the daily life of the youth participants. Skills and Knowledge Requirements: Creation and management of groups, teaching and/or facilitating group discussions. Experience working with youth and communities that are historically marginalized. Ability to be both a leader and a compatriot, an inspiration and a guide to youth participants. Experience living in challenging conditions and rural areas internationally. Adept interpersonal skills; strength in developing and maintaining relationships with youth, families, community members, GP staff, and partnering agencies. Self-motivated and capable of working independently as well as with a team. Bi-lingual (Spanish or Haitian Creole) speakers with experience working and living in developing countries are especially encouraged to apply. We are especially interested in individuals who would like to remain involved after the summer. Education/Field: Graduate degree or in process preferred. College degree required (unless significant equivalent experience can be demonstrated) Appropriate fields include: Social Work, Education, International Development, Counseling Psychology, Anthropology, Media, Arts, Social Entrepreneurship, Political Science, Health/Fitness/Outdoors. Certification in First Aid/CPR preferred What we can offer you: An opportunity to be exposed to the workings of a nonprofit grassroots enterprise with a vast network of innovative professionals. Exposure and access to the NGO and international development community. Training in an organization that is fast-paced, innovative, collaborative and creative. Impact: Youth and Volunteers who participate in GP demonstrate increased: Skills in advocacy, activism, fundraising, and social entrepreneurship. Self-esteem, confidence, and sense of purpose. Belief that challenges lead to opportunities. Academic completion rates. Unprecedented professional experience in youth and international development. Interested candidates should immediately send cover letter and resume to hr@global-potential.org. Indicate \\\"International Youth Development Facilitator\\\" in the subject line.", "title": "Summer Abroad: Youth Development Facilitator", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2665011%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Potential"}, {"end": "2017-08-31", "description": "Reading Empowers was formed with the mission of improving literacy among young children. Our goal is to instill an interest in reading, at a young age, and our hope is that this will develop into a lifelong love and passion. This upcoming school semester (Spring 2017), we will be hosting Saturday morning reading sessions at P.S. 1 and P.S. 124 in Lower Manhattan. We are looking for volunteers to join us on our mission! We will be reading to students in 1st, 2nd, and 3rd Grade. P.S. 1 and P.S. 124 are both located in Chinatown at 8 Henry Street and 40 Division Street, repsectively, in LES Manhattan. Below are the dates for the Spring 2017 semester. February 11 March 4 March 18 April 1 April 22 April 29 Each session is about two hours, during which volunteers and students are broken up into groups, with each group consisting of 2-3 volunteers and 6-8 students. The two hour sessions consist of reading, writing, and an arts and crafts activity with the students. Reading Empowers is a non-profit organization in the state of New York and recognized as a tax-exempt 501(c)(3) organization by the IRS. Please feel free to visit our website http://www.readingempowers.org/ Requirements Volunteers must be 18 or older New volunteers must pass the background check with our vendor, Go Pass. There is a $60 background check fee that will be reimbursed to you after you volunteer with us for 60% of all the sessions in one full school year ~ 8-9 sessions We are looking for consistent commitment for this school year, which is roughly two Saturdays per month To get involved please fill out our online application at: www.readingempowers.org/application", "title": "Read to 1st, 2nd or 3rd Graders in a public school in Lower Manhattan!", "zipcode": "10002", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1596852%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Reading Empowers"}], "10003": [{"end": "2017-11-21", "description": "Every Tuesday, starting in Mid-June and ending in Mid-November, a local CSA will have edible produce that it is looking to donate. RoHo Compost is looking for a volunteer to help us transport this produce to a local shelter or food bank. Someone with a car is preferred.", "title": "Feed the Hungry by Rescuing Food!", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2701083%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "ROHO COMPOST COMPANY"}, {"end": "2018-04-01", "description": "Mount Sinai Beth Israel, located in Manhattan&rsquo;s Lower East Side- Gramercy Park- neighborhood, seeks volunteers with an interest in counseling, public health, social work, or pastoral care. In order to ensure that we provide high quality care, Mount Sinai Beth Israel has created a Chi Cart program for staff. Volunteers visit clinical and administrative floors in the hospital and provide a space for our employees to spiritually and physically recharge. Volunteers will be given resources to serve tea, snacks, and aromatherapy as a way to help staff take a break. Volunteers will have the opportunity to go behind the scenes of the hospital, participate in reporting data from each visit, and gain experience in conducting informal group counseling sessions. Volunteers must be comfortable with introducing themselves to the floor and encouraging staff members to take a short break with them. In addition to being warm and welcoming, volunteers should be comfortable with hospital systems and vernacular. Qualifications: Students: Mature, caring students. Ideal for students interested in pursuing social work or counseling. Must have completed 2 college level courses in a relevant field. Must be 18+. Community Members: Mature, caring, and compassionate people who would like to engage in supporting the well-being of professionals at a local hospital. Must have 1-2 years of experience working in a relevant setting.", "title": "Chi Cart Program", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2628669%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Mount Sinai Beth Israel"}, {"end": "2017-09-30", "description": "We are currently looking for Volunteer Office Assistants to work in the afternoon and/or the evening. Volunteer Office Assistants serve 4-6 hours per week for a prestigious downtown NYC community theater that produces 25-30 new plays and 3 free community events each year. Volunteer Office Assistants will answer phones, take reservations, file papers and occasionally assist Executive Director Crystal Field by writing letters or researching on the internet. Opportunities available specifically on weekdays in the Morning/Afternoons from 10am to 4pm, or in the evenings from 4pm to 10pm, or on weekends from 12pm to 8pm. Volunteers will receive FREE tickets to all TNC productions.", "title": "Administrative Assistance", "zipcode": "10003", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2022544%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Theater for the New City"}], "10040": [{"end": "2017-12-31", "description": "Friendly Visiting is a program that pairs volunteers with homebound seniors to provided company and friendship. Upper Manhattan Partnership for Senior Independence provided friendly visiting services to senior that resides from North 110th street and West of Fifth Avenue to the Northern tip of Manhattan. One visit per week for a period of six months or more can make a difference in a senior&rsquo;s life. Friendly Visiting Coordinator Elissette Reyes De Jesus 212-342-9694 646-228-1812 ereyesdejesus@isabella.org", "title": "Friendly Visiting Program", "zipcode": "10040", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1661881%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Friendly Visiting Program"}], "10009": [{"end": "2017-07-09", "description": "We are no accepting applications for Civic Art Lab 2017. Please fill in this form no later than May 15th : http://bit.ly/2nIPDDH Civic Art Lab is a pop-up gallery and workshop space on the Lower East Side at Avenue C & 7th Street, hosted by GreenspaceNYC. For our third year, we return to the Lower East Side. Our 3 day lab themes include sustainability and design; creative re-use; mapping and neighborhood placemaking; urban agriculture; sustainable architecture; health & well-being; and environmental justice, to name a few. Please fill out the following form to apply. Call for submissions is open between April 1st and May 15th, 2017. For additional questions, please email laura@greenspacenyc.org and jeff@greenspacenyc.org.", "title": "Civic Art Lab 2017 |  Call for workshops, talks, and pop-up exhibitions | LES", "zipcode": "10009", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2645727%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GreenspaceNYC"}, {"end": "2017-07-09", "description": "This interactive workshop will educate participants in the fundamentals of resilient empowerment, and have them apply these principles to the conception of their own public design workshops. Operation Resilient Living & Innovation (ORLI+) will present attendees with a suite of community engagement strategies, designed to maximize collaboration with underserved populations and leverage local assets to grow a resilient society. This workshop is part of Civic Art Lab 2017, designed as a pop-up gallery and workshop space in the East Village at Avenue C & 7th Street. The lab will be hosted in partnership with Marc Norov and the Creations Gallery, a mixed-use community pop-up space, adjacent to a community-based bike repair shop. These workshops, talks, and exhibitions are designed by volunteer artists, designers, and teachers who lead investigations into diverse themes such as: creative re-use; urban agriculture; sustainable architecture; health & well-being, and environmental justice, to name a few. Civic Art Lab is hosted by GreenspaceNYC (www.greenspacenyc.org), a non-profit collaborative that develops and curates free educational programming, hands-on workshops, and public design projects that encourage dialogue, enliven public spaces, and promote the future of more equitable and sustainable cities.", "title": "Volunteers, learn to design your own public design workshops! @ Civic Art Lab", "zipcode": "10009", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2726365%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GreenspaceNYC"}, {"end": "2017-07-09", "description": "Invitation to volunteers and volunteer groups interested in sustainability, art, and design practices. RSVP: https://www.eventbrite.com/e/civic-art-lab-circular-economy-recycling-tickets-34952203983 This workshop is led by Agustina Besada (Sure We Can). Circular Economy is a movement that poses to re-think and re-design the traditional economic model into one where resources are repurposed, reused and recycled in closed loops. During the workshop, participants will learn about the Circular Economy principles, strategies and best practices, to then work in groups on specific cases to identify and brainstorm ideas to apply a Circular Economy approach. Civic Art Lab 2017 is the third iteration of the project, designed as a pop-up gallery and workshop space in the East Village at Avenue C & 7th Street. The lab will be hosted in partnership with Marc Norov and the Creations Gallery, a mixed-use community pop-up space, adjacent to a community-based bike repair shop. Our programming will continue to be low cost for full registrants and free for individual registrants. These workshops, talks, and exhibitions are designed by volunteer artists, designers, and teachers who lead investigations into diverse themes such as: creative re-use; urban agriculture; sustainable architecture; health & well-being, and environmental justice, to name a few. Civic Art Lab is hosted by GreenspaceNYC (www.greenspacenyc.org), a non-profit collaborative that develops and curates free educational programming, hands-on workshops, and public design projects that encourage dialogue, enliven public spaces, and promote the future of more equitable and sustainable cities. Get in touch: info@greenspacenyc.org Co-Directors / GREENSPACENYC + Civic Art Lab: Laura Scherling, Jeff Kasper Organizers: Dan Horn, Marcus Wilford Sponsors: Creations Gallery, Material for the Arts (NYC Office of Cultural Affairs), ORLI", "title": "Join us for \"Circular Economy & Recycling\" at Civic Art Lab! July 9, 2017 at 3 pm", "zipcode": "10009", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715605%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GreenspaceNYC"}, {"end": "2017-07-09", "description": "Invitation to volunteers and volunteer groups interested in sustainability, art, and design practices. RSVP: https://www.eventbrite.com/e/civic-art-lab-community-resilience-build-a-workshop-tickets-34951971287 This workshop is led by Operation Resilient Living & Innovation (ORLI+, www.orliplus.org). This interactive workshop will educate participants in the fundamentals of resilient empowerment, and have them apply these principles to the conception of their own public design workshops. Operation Resilient Living & Innovation (ORLI+) will present attendees with a suite of community engagement strategies, designed to maximize collaboration with underserved populations and leverage local assets to grow a resilient society. To maximize the impact of this event, real-world scenarios will be incorporated, with the goal of presenting actionable outcomes for local at-risk communities. ORLI+ will conduct the following activities during the workshop: (1) ice-breaker to illustrate deficiencies of standard community design workshops, (2) presentation of model community workshop objectives and strategies, (3) presentation of case-study workshop scenarios by local/regional community leaders, (4) break-out case study analysis and workshop design by participants, and (5) presentation and discussion of proposed methodologies. This existing workshop model promotes the expansion of a typical conference program, drawing connections between local communities and professionals, and visiting experts. ORLI+ believes this enhanced and focused interaction can serve as a model for increasing the impact of architects and designers in their local communities (and vice-versa), leveraging the conference platform towards actionable, resilient community engagement and development. Civic Art Lab 2017 is the third iteration of the project, designed as a pop-up gallery and workshop space in the East Village at Avenue C & 7th Street. The lab will be hosted in partnership with Marc Norov and the Creations Gallery, a mixed-use community pop-up space, adjacent to a community-based bike repair shop. Our programming will continue to be low cost for full registrants and free for individual registrants. These workshops, talks, and exhibitions are designed by volunteer artists, designers, and teachers who lead investigations into diverse themes such as: creative re-use; urban agriculture; sustainable architecture; health & well-being, and environmental justice, to name a few. Civic Art Lab is hosted by GreenspaceNYC (www.greenspacenyc.org), a non-profit collaborative that develops and curates free educational programming, hands-on workshops, and public design projects that encourage dialogue, enliven public spaces, and promote the future of more equitable and sustainable cities. Get in touch: info@greenspacenyc.org Co-Directors / GREENSPACENYC + Civic Art Lab: Laura Scherling, Jeff Kasper Organizers: Dan Horn, Marcus Wilford Sponsors: Creations Gallery, Material for the Arts (NYC Office of Cultural Affairs), ORLI", "title": "Join us for \"Community Resilience: Build-A-Workshop\" at Civic Art Lab! July 9th at 10:30 am", "zipcode": "10009", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715333%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "GreenspaceNYC"}], "10035": [{"end": "2017-08-22", "description": "We are currently accepting applications for Volunteer Dance Teachers for our Summer Program at Groove With Me, Inc. Groove With Me is a free dance school for girls in East Harlem. It engages girls during the idle out-of-school hours when 90% of youth violence occurs; and seeks to decrease teen pregnancy, truancy, crime, violence, prostitution, substance abuse and gang related activity. East Harlem has the highest unmet need for after school programming of any neighborhood in NYC. By volunteering you provide much needed out-of-school time safety - and arts programming. Summer Programming 2017 Schedule: Session 1 will run from July 5th - August 1st (4 weeks) Session 2 will run from August 2- August 22nd (3 weeks) If you are interested in this opportunity, please give me a call at 212-987-5910 or reach me via email at beatriz@groovewithme.org Beatriz Coronel, MA Program Director Groove With Me, Inc. 186 E 123rd St NY, NY 10035 Phone: 212-987-5910 Fax: 212-987-5080 www.groovewithme.org", "title": "Volunteer Dance Teachers Needed for our Summer Program at Groove With Me, Inc.", "zipcode": "10035", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2678136%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Groove With Me, Inc."}], "10128": [{"end": "2017-07-01", "description": "We are hosting SUPERHERO DAY NYC and we are looking for the most imporatnt part -SUPEHEROES! We are looking to spread the message of hope to children with medical and special needs and their famileis! We want to bring the SUPERHEROES to our special little superheroes-children facing a difficult diagnosis. We would love to have SPIDERMAN, IRON MAN, CAPTAIN AMERICA, SUPERMAN, HULK, BATMAN, WONDERWOMAN, etc! Contact us if you are ready to get in costume to have a great time with the kids!", "title": "SUPERHERO DAY SUPERHEROES NEEDED!", "zipcode": "10128", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715045%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "OUT OF ZION INC"}, {"end": "2017-07-01", "description": "Help spread the message of joy to children with medical and special needs and their families. Join us for SUPERHERO DAY NYC. We are looking for volunteers to bring in popcorn and cotton candy machines with supplies to bless the families in attendance with some yummy treats!", "title": "SUPERHERO DAY NYC- POPCORN AND COTTON CANDY MACHINES", "zipcode": "10128", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715017%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "OUT OF ZION INC"}, {"end": "2017-07-01", "description": "Help spread the message of hope by becoming a part of our SUPERHERO DAY NYC team! We are looking for artists who can volnteer their time to face painting at our event for children with medical and special needs. We are looking for artists who specialize in SUPERHERO art!", "title": "SUPERHERO DAY NYC -FACE PAINTERS", "zipcode": "10128", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2714891%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "OUT OF ZION INC"}, {"end": "2017-07-01", "description": "Help spread the message of hope to children with medical and special needs and their families. We are looking for a balloon artist that can provide the families in attendance with some entertainment through creating fun balloon souvenirs. Someone who specializes in making SUPERHEROES is preffered!", "title": "SUPERHERO DAY NYC -Balloon Artist", "zipcode": "10128", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2714887%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "OUT OF ZION INC"}, {"end": "2017-07-01", "description": "Event Planner will be in charge of every facet of the events. They meet with us to work out event details, plan with the client and their team for a successful outreach event to children fighting hard battles in NYC.", "title": "Event Planning - Superhero Day NYC", "zipcode": "10128", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2698265%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "OUT OF ZION INC"}], "10029": [{"end": "2017-08-03", "description": "Volunteer in Our Summer Program & Support Our Scholars! EHTP seeks passionate volunteers to work with elementary and middle school students during our summer program! Our summer program runs Monday through Friday, and volunteers play a huge role in making the summer successful. Volunteers can choose between the morning or afternoon shifts or do a full day. In the morning, volunteers support our teachers and scholars during academic instruction. In the afternoons, volunteers support during field trips, outdoor activities, and enrichment clubs such as comics, drama, dance, and sports. Volunteers must commit to a minimum of 3 shifts a week or 2 full days for the full 4 weeks of program. When : July 6 - August 3, Monday - Friday Times : 7:45am - 12:00pm (Morning) and/or 12:00pm - 4:00pm (Afternoon) All interested volunteers should apply online here: https://ehtp.cloud.talentedk12.com/hire/ViewJob.aspx?JobID=36 If you have any questions, please contact our Associate, Volunteers & Interns, Raul Lazo, at volunteerinfo@ehtp.org Requirements Volunteers must be at least 14 years old Summer Program is a highly active environment and volunteers must be able to climb multiple flights of stairs, carry heavy boxes, stand for a minimum of 4 hours a day, feel comfortable supervising children in outdoor and indoor settings, and participate in physical activities such as running and sports Acceptance contingent on clearance of a Criminal Background and Medical Check (forms provided during application process)", "title": "Volunteer in Our Summer Program & Support Our Scholars!", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1980798%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "East Harlem Tutorial Program"}, {"end": "2017-08-12", "description": "Harlem RBI, an award winning youth development program, is seeking volunteer T-ball coaches to work with youth ages 5-7 in practices and games. Coaches teach T-ball and provide youth with opportunities to play, learn and grow; inspiring them to recognize their potential and realize their dreams. Each coach serves as a member of a small coaching staff. There are powerful rewards gained from the Harlem RBI coaching experience. Harlem RBI volunteer coaches can have a direct and noticeable impact on the positive development of the youth they coach. The ideal candidate is passionate about youth development, has experience working with youth, and can commit to attending six Saturday practices and games in July/August, as well as a one-day pre-season coaches training on June 25 th. Roles and Responsibilities Guide a team of 16-18 youth through practices and games; Ensure youth safety on the field; Provide a fun and positive, team-based environment; Attend all practices and games on six Saturdays in July and August. Qualifications Passionate about youth development; Understand the power of teamwork; Have the ability to create a positive, team-based environment focused on teaching T-ball; Organized, energetic and flexible; Skilled communicators; Experience in baseball/softball a plus; Able to commit to six Saturdays, in July and August; At least 18 years of age. Hours: Coaches conduct practices and games for an hour and a half on six Saturday mornings or afternoons from 7/9/16 to 8/13/16. Coaches must be able to commit to attend all six Saturday coaching sessions during the summer, as well as the coach training day in June. Harlem RBI provides equal opportunity for all volunteers.", "title": "Volunteer T-Ball Coaches!", "zipcode": "10029", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2631647%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Harlem RBI"}], "10027": [{"end": "2017-07-28", "description": "Summer Quest&rsquo;s mission is to ignite intellectual curiosity, prepare students for competitive exams and to cultivate academic development through a variety of inquiry and project-based enrichment classes throughout the summer. Our goal is to offer rising 6 th, 7 th, 8 th and 9 th graders a competitive advantage for the upcoming school year. Our Summer Program is looking for a Lifeguard with prior pool experience and the ability to work for one event in the summer. The ideal candidate will have excellent skills in the water and prior experience working with children. Program Description: Date/Time: Friday, July 28 th, 10:30AM-3:30PM Location: Riverbank State Park Pool 679 Riverside Dr, New York, NY 10031 Summer Quest Lifeguard Summary: We will have 145 students ages 10-13 at the pool for five hours on Friday, July 28 th. We need six lifeguards to supervise the event to make sure that everyone has fun in a safe way. Lifeguards will be required to monitor pool-related activities closely and identify any safety issues, direct swimmers out of the pool in hazardous conditions and monitor weather to ensure safety of children. Job Requirements: Documents showing that you have passed the NYC Lifeguard Qualifying Test First Aid and CPR certifications Ability to pass pre-employment practical skills test in the water 2+ years&rsquo; lifeguard experience preferred To apply: Fax or email cover letter, resume and three references to: Harlem Educational Activities Fund 2090 Seventh Ave, 10 th Floor New York, NY 10027 Attn: Summer Quest Teacher search Fax: (212) 663-9736 Email: cgriffith@heaf.org", "title": "Summer Quest Life Guard", "zipcode": "10027", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2665072%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Harlem Educational Activities Fund (HEAF)"}], "10024": [{"end": "2017-08-17", "description": "Since 2001 DOROT&rsquo;s prestigious Summer Teen Internship Program has been inspiring high school students to become leaders and give back to the community. Volunteer with a diverse group of socially-conscious high school students to help local seniors connect. The internship is designed to provide students with a minimum of 92 hours of community service. * Documentary Filmaking - Session I * Intergenerational Theater - Session II * Deliver meals and birthday cakes * Teach computer skills * Cook and dine with seniors * Plan intergenerational trips to local museums * 104 hours of community service Session 1: June 26 - July 20 (exceptions made for regents exams) Session 2: July 24 - August 17 Apply here: www.dorotusa.org/teenapp Watch a Day in the Life of a DOROT Teen Intern: https://www.youtube.com/watch?v=jeXyE2YSHCM ''It&rsquo;s an incredibly fulfilling experience to reach out to the seniors in the community and help them with whatever they need assistance with. It's also an added benefit that, as teen interns, we can build relationships with other teens who love the same service work. -Maude, Summer Teen Intern The DOROT Summer Teen Internship Program is jointly funded by UJA-Federation of New York and the Jim Joseph Foundation. The Jewish Education Project serves as lead operator of the Initiative.", "title": "Summer Teen Internship Program 2017", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2565124%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "DOROT, Inc"}, {"end": "2017-08-18", "description": "Volunteer tutors needed for low income students for summer session from 7/5/17-8/18/17. You will be matched one-to-one for just two hours per week. Students range in age from 7-18. There are no weekend hours available.", "title": "Help a Child!  Be a Summer Volunteer Tutor", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1110743%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Star Learning Center"}, {"end": "2017-07-23", "description": "myFace is proud to host Races For Faces 2017! Please join us on Sunday, July 23, for a fun-filled family day in beautiful Riverside Park on the Upper West Side of Manhattan to raise money and awareness for craniofacial conditions. Meeting Point: The Warsaw Ghetto Memorial at 83rd Street Event Schedule: 7:00 AM - Volunteers Arrive and Check-In 9:00 AM - Registration Begins 10:00 AM - Opening Remarks 10:30 AM - Walk Commencement & Carnival Fun! 12:00 PM - Closing Ceremony & Awards We will have lots of fun for children of all ages including exciting games, family activities and raffle, arts and crafts, obstacle courses and lots of surprises! Every dollar donated goes towards helping patients with craniofacial differences and their families! To learn more, please visit www.racesforfaces.org", "title": "Races for Faces 2017", "zipcode": "10024", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2706944%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "myFace"}], "10025": [{"end": "2017-08-26", "description": "Whether you're great, good or fair at Science, Technology, Engineering and Math (STEM), you can help make an impact on inner-city youth. Here's how: The Parris Foundation S.T.E.M.ulating Minds Weekend Enrichment Program has returned for the Spring 2017 session. The program began after a successful summer pilot in 2012, and our subsequent programs have grown to continue to serve middle school students and high school students . With the growing impact on the community, we need your support to continue to bring STEM to our middle school and high school youth throughout New York City. As we expand to more locations to serve more youth, there is a growing need for volunteers! How we do it: The Parris Foundation curriculum combines innovative and interactive software and teaching techniques with hand-ons interdisciplinary experiments and activities to keep our students engaged with their passion for science and math! About The Parris Foundation: The Parris Foundation is dedicated to promoting educational opportunities and fostering awareness in science, technology, engineering and math (STEM) through scholarships and community outreach programs. The Parris Foundation's S.T.E.M.ulating Minds: Weekend Enrichment Programs provide extended learning opportunities to supplement and enhance in-school learning.", "title": "Summer 2017 - S.T.E.M.ulating Minds Weekend Enrichment Program", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2723386%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Parris Foundation, Inc."}, {"end": "2017-09-01", "description": "The New Jewiish Home, Manhattan Division has a wide variety of opportunities for high school and college students to volunteer with over the summer vacation. Opportunities vary and we will try our best to meet your interest Opportunities include but not limited to: Recreation Assistant (Bingo, Games, Exercise, Arts & Crafts, Nail Spa) Pharamacy (selective, limited spots) Library Assistant (upkeep of shelving, assisting book selections, assisting computer users) Clerical/Office Assistant Please apply online at the following link: https://www.volgistics.com/ex/portal.dll/ap?AP=229551104 Please mention Volunteer Match & Summer Volunteering in your application If you have any questions - Please contact Jessica at JSinovoi@jewishhome.org", "title": "Summer Volunteer at The New Jewish Home (HS & College students)", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D855373%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The New Jewish Home, Manhattan Division"}, {"end": "2017-08-26", "description": "BECOME A SCIENCE, TECHNOLOGY, ENGINEERING and MATH (STEM) VOLUNTEER! Help middle school and high school students develop a passion for math and science by becoming a dedicated instructor, teaching assistant, or afterschool tutor. Whether you're great, good or fair at Science, Technology, Engineering and Math (STEM), you can help make an impact on inner-city youth. Here's how: The Parris Foundation S.T.E.M.ulating Minds Weekend Enrichment Program has returned for the Spring 2017 session . The program began after a successful summer pilot in 2012, and our subsequent programs have grown to continue to serve middle school students and high school students . With the growing impact on the community, we need your support to continue to bring STEM to our middle school and high school youth throughout New York City . As we expand to more locations to serve more youth, there is a growing need for volunteers! Our ideal volunteer is enthusiastic about working with youth, can commit to multiple Saturdays, and possesses, at minimum, basic science and math skills. No previous education experience is required. Your passion for science and math coupled with a desire to help New York City youth realize their true potential is all that is required.", "title": "Spring & Summer 2017 - S.T.E.M.ulating Minds Weekend Enrichment Program", "zipcode": "10025", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2489882%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Parris Foundation, Inc."}], "10023": [{"end": "2017-08-25", "description": "Do you want to SEE beyond the declining level of dialogue in the world to what (actually) is real in everyday items of news? This free news sheet is being made available by the Global Center for Human Change at a time when confidence in the veracity of even the basic facts about our world has sunk to an all-time low. 'The REAL News' shows the principles upon which constructive dialogue and the fashioning of a new world built on those principles can take place. It does NOT reflect partisan bias or seek to make any point about current political positioning - it is forward thinking only, beyond the current fixed line of conflict and critique. Do you want to SEE what (actually) is real in everyday items of news at a time when we urgently need to see clearly? Each week, 'The REAL News Team&rsquo;, together with Philosopher and Writer, Richard A. Bowell, take a news story from around the world and show what really is occurring in these times within the context of our evolution and the way to contribute consciously to a new world. Volunteers will become trained in these sessions in the way to SEE what (really) is real in the news, beyond the alarmist or sensationalist portrayal of news we have grown to think is normal. Applications will be accepted until noon on Saturday, 20 May. Successful applicants will be invited to our live training session in New York City on Thursday, May 25 (8pm). JOIN us today! Never before have we needed to be able to SEE our human situation on this planet within the context of our evolution as NOW! Click here for a sample of our weekly news sheet: http://mailchi.mp/globalcenterforhumanchange.org/seeing-what-is-real-news-issue-1-may-1-993549 The Global Center for Human Change is a 501(c)(3) not-for-profit organization in the USA.", "title": "Seeking 20 Volunteers To Join Our News Team And Help Deliver The REAL News!", "zipcode": "10023", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2685081%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Global Center for Human Change"}], "10021": [{"end": "2017-09-14", "description": "Help support us in feeding New York City's homeless population! We are looking for volunteers who can commit to regularly support our mission. Volunteers will assist in stocking our food pantry, sorting incoming delivieries, and donations, as well as creating food packages for homeless, and low income individuals. Last year, the Urban Outreach Center distributed over 12,000lbs of food, and supported over 27,000 homeless men, women, and children in the NYC area, but we need your help to continue this mission. Please visit our website http://www.uocnyc.org/ for more details. *Volunteers must be able to traverse stairs, and able to lift weights up to 55lbs. Sturdy footwear is essentials.*", "title": "Support our Community Food Pantry", "zipcode": "10021", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715696%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Jan Hus Presbyterian Church & Neighborhood House"}], "10011": [{"end": "2017-06-28", "description": "Dance to Unite, Inc is a non-profit organization whose mission is to use dance as a vehicle to teach and to celebrate cultural diversity. To learn more about us and what we do, please check: www.dancetounite.org We are currevtly in need of volunteer photographers (students are welcome) to take photos at our students' final performances. Day, time and location varies as we partner with 10 different schools in the 5 boroughs. Date/time is dependent upon when the performace is scheduled to be held. Performaces will be held anytime between Mid-May to the first week of June and photographers will be needed for approximately 2 hours. We will credit your photos at our social media. It's also a great opportunity to build a portfolio for students. For more info, please contact Tal Adani- taladani@msn.com", "title": "Volunteer photographers needed for our final student performances!", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D1859922%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Dance to Unite"}, {"end": "2017-08-23", "description": "GRANT WRITER The Grant Writer is primarily responsible for developing and writing grant proposals to foundations and other grant-making organizations, and will persuasively communicate CSP's mission and programs to potential funders. Reporting to the Executive Director, the Grant Writer will assemble and submit grant requests, establish and maintain personal contact and relationships with foundation contacts, conduct prospect research, and maintain a calendar of submissions and other deadlines. To get a response please send RESUME.", "title": "Grant Writer", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D643540%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2017-08-23", "description": "Computer/It - Tech Support - All aspects of tech support for the organization including maintenance, troubleshoot, specially ANTI-VIRUS, and optimal functioning of the system. Must have experience with Microsoft and Windows systems. To get a response please send RESUME .", "title": "Computer support", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D601216%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2017-08-23", "description": "Education Program Coordinator - Chelsea Sculpture Park. New York , New York. Basic Requirements: BA or MA in related discipline required (Art Education) Post college professional work experience required Demonstrated experience with art education or other informal art programming and curriculum design Demonstrated knowledge of Microsoft computer programs and excellent presentation skills Job Responsibilities: Coordinate and develop of new partner-institution/organization relationships and curriculum Provide leadership and direction towards the design and implementation of art educational programming and curriculum in compliance with national and state learning objectives, accreditation guidelines, and innovative art methodologies Establish and grow professional relationships with constituents, peers, associations and partner schools To Apply: Please submit your resume with cover letter and references to the contact information listed below. Set against the backdrop of the Hudson River, Chelsea Sculpture Park will offer fine art for the public to experience, up close and outdoors. The park's mission is to provide an aesthetic oasis in the Chelsea Cove section of Hudson River Park located between 22nd and 26th Streets, just steps away from the world-class Chelsea Art District. We are looking for a Education Program Coordinator to assist the founder and executive-director of Chelsea Sculpture Park develop and implement an educational program foccusing on the exhibitions of the sculpture park.", "title": "Educational Program - Coordinator", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D481515%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2017-08-23", "description": "Chelsea Sculpture Park New York, New York Are you considering a future in arts administration, nonprofit management, fundraising, arts education or a related field? This is a great opportunity to gain experience working at a brand new nonprofit arts organization that is dedicated to building a sculpture park on the banks of the Hudson River Park. Gain invaluable insights and learn fundraising strategies as part of a dynamic Development team. Assist with prospect research, special events, direct mail, and our donor database, as well as pursue special projects. Internship credit may be arranged through your academic program. The ideal candidate will be organized and detail-oriented, and have good computer skills. Those with prospect research experience and graduate students in arts administration and arts education are especially welcome. The hours for this position are flexible within the work week. A modest stipend is available. To Apply: Please be sure to include current contact information so that we may arrange an interview. To get a response please send RESUME .", "title": "Development Intern", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D297980%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Sculpture Park"}, {"end": "2017-06-30", "description": "- The PR & Marketing Manager will be in charge of newsletter, developping partnerships, assisting executive director in scheduling meetings and social media. This position is NOT PAID.", "title": "CHELSEA FILM FESTIVAL: PR & Marketing Manager", "zipcode": "10011", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2579116%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Chelsea Film Festival"}], "10019": [{"end": "2020-12-31", "description": "The National Chorale is a premier NYC choral organization, founded 49 years ago, made up of an Ensemble of professional singers and soloists. Our annual concert series is presented in David Geffen Hall at Lincoln Center. We also present choral performances in other NYC venues as well as at other local, national and international festivals and music events and conferences. We also have a K-12 music training program where we provide professional music teachers in local NYC public schools. Our Executive Director is underwater with her workload, some of which we would like to offload to Administrative / Clerical Assistants. Work ranges from researching items on the Internet, to answering phones, to preparing reports, to scheduling events and people, to occasionally running an errand, typing - letters and reports and input to our database, attending meetings, communicating with our audience members, Board Members, concert personnel, funders, sponsors and K-12 NYC school administrators and teachers. Folks who have worked in the corporate environment with experienced office skills would be ideal. Office is in midtown Manhattan (Broadway & West 51st Street. Friendly office environment. Prefer a minimum of 20 hours per week, but we will work with you to design a schedule that is comfortable for you. We really need your help and like most nonprofit organizations, cannot afford to hire the support staff we require. BTW, one of the perks for our volunteers is that they are provided with two tickets to every Lincoln Center concert, and more if needed! Come join us and know that you will be making a real impact with a deserving nonprofit organization!", "title": "Administrative / Clerical Help", "zipcode": "10019", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2583139%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National Chorale"}], "10038": [{"end": "2018-06-29", "description": "The Refugee Resettlement Office of Catholic Charities Community Services provides assistance to refugees and asylees from diverse backgrounds, offering a variety of case management, employment, and educational services that help clients settle into their new community. To further help us with this goal the AmeriCorps VISTA member will be responsible for engaging volunteers, interns and parish/community/corporate volunteers to work with staff and support the programs. To read the full description, visit: http://www.catholiccharitiesnyvolunteer.org/NEW!", "title": "AmeriCorps VISTA – Coordinator of Volunteers for New Americans", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715219%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Catholic Charities, Archdiocese of New York"}, {"end": "2017-06-30", "description": "Community center in Chinatown in Manhattan desperately needs a makeover to make our students smile. We provide the paint, rollers and everything else and you are the painters. Looking for some amateur painting experience and neat workers. Mural artists are welcome too.", "title": "Paint smiles on the faces of our students by painting our classrooms", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2676189%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Hamilton-Madison House"}, {"end": "2017-12-31", "description": "We are looking for volunteers with dance experience to help run a weekly movement-based creative workshop for students with intellectual disabilities in Fort Hamilton, Brooklyn, Wednesdays from 11-12. This opportunity takes place over 12 weeks, for a small group of middle and high school students. The workshop will culminate with an informal showing. We are also looking for volunteer yoga instructors in all boroughs.", "title": "Looking for Dance Teachers and Yoga Instructors", "zipcode": "10038", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2556600%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "AHRC NYC"}], "10118": [{"end": "2017-12-31", "description": "Do good for your community while using your professional expertise. Work with talented peers on a rewarding non-profit cause related program. The Rare Genomics Institute is making a difference. RG is a nonprofit organization that helps families in need of genome research. The Human Resources Generalist will provide HR support related to staff trainings, webinars, special staff events, and culture building. Position Responsibilities: Trainings: Develop, plan, and manage training programs and services Coordinate staff professional development program Develop new training initiatives and implement skills enhancement programs Events: Plan staff outings and events and manage the planning,communications, execution and follow-up strategies for each event Foster team-wide culture through all-staff gatherings Create events that broaden staff engagement Recommends employee relations practices necessary to establish a positive employer-employee relationship and promote a high level of employee morale and motivation Qualifications: Bachelor's degree with a concentration in Human Resources or other related field of study is preferred. Three to five years of experience required. Strong administrative skills with excellent organization and attention to detail Possesses strong interpersonal skills Other duties as assigned by the Human Resources staff", "title": "Human Resources (Culture Building /Employee Engagement)", "zipcode": "10118", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2204431%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Rare Genomics Institute"}], "10013": [{"end": "2018-07-16", "description": "We are currently looking for volunteers who are passionate about helping homeless abuse survivors improve financial literacy. This is a support role, working with a team to create materials and content for our classes. Research & Material Development Support Conducting research in preparation for classes and programs. Assist Cacilitators and Team Lead in designing activities and handouts for classes. Assistance in material purchases or print-outs for sessions. Qualifications: Ability and willingness to work in a team environment. Keen, creative eye for design and user experience. Timely and detail oriented. Receptive to receiving and giving feedback. Proficiency with PowerPoint and/or other design software tools to create handouts. Weekly Commitment: 2 hours Please send emails to: myan@shine-foundation.org to apply", "title": "Research & Material Development-Help Homeless Abuse Survivors Improve Financial Literacy (NYC)", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2715826%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Shine Foundation"}, {"end": "2018-07-16", "description": "Team Lead: We are currently looking for individuals passionate about making a difference to join Shine as team leads to help bridge the gap between Shine and our clients and partner sites. Responsibilities: Team leads will serve as main point of contact between site contact, team and Shine Board Work with facilitators and to create program and lesson plans Coordinate all team members - virtual and in-person facilitators, support, graphic designer and marketing specialist. Approve lesson plans and handouts. Provide regular progress updates on the program to site contact and Shine Board Ensure proper data collection for monitoring and evaluation. Qualifications: Experience managing multifunctional teams. 5+ years of prior project management experience. Highly organized and detailed oriented. Ability to make decisions and move processes forward. Timeframe: One-year Weekly commitment: 8 to 10 hours To apply: Send resumes to: myan@shine-foundation.org", "title": "Team Lead: opportunity to help homeless abuse survivors improve financial literacy", "zipcode": "10013", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2714714%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Shine Foundation"}], "10012": [{"end": "2017-06-30", "description": "Housing Works Bookstore and Cafe is an entrepreneurial arm of Housing Works, a New York non-profit whose mission is to end the dual crises of homelessness and AIDS through relentless advocacy, the provision of lifesaving services, and entrepreneurial businesses that sustain our efforts. All of the books we sell are donated by members of the community, and a majority of the people that work in the bookstore are volunteers. You can find out more about Housing Works' mission, services, and advocacy by visiting our website: http://www.housingworks.org/ We are looking for a group of volunteers to help us out with our annual inventory on Friday, June 30th. This is a crucial activity for the continued running of the Bookstore Cafe, and we would love to have your group participate! Members of your group will help us keep track of our stock of each and every one of our books. This is a great opportunity to explore a variety of different books, as well as enjoy the atmosphere of the Bookstore Cafe at a time when it will be closed to the public. We are currently looking for groups of around 10 people for two shifts: 10 am to 2 pm and 1:30-5:30. We are flexible in terms of scheduling, so if these shifts do not work for your oranization, please contact the volunteer coordinator, and we can set up a time that works best for you. Please contact the volunteer coordinator at volunteer@housingworksbookstore.org if you are interested or have any questions!", "title": "Group Volunteer Activity at the Housing Works Bookstore Cafe on Friday, June 30th", "zipcode": "10012", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2392116%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Housing Works"}, {"end": "2017-07-03", "description": "This opportunity is available every Monday and Tuesday! Spare just half an hour to bring leftover food to the nearby Bowery Mission! The final destination will be the Bowery Mission at 227 Bowery. Middleweight: the average amount of food is 15-20 pounds. Sign up directly on our website: Monday 2/13/17 http://www.rescuingleftovercuisine.org/events/15501 Tuesday 2/14/17 http://www.rescuingleftovercuisine.org/events/15502 Monday 2/20/17 http://www.rescuingleftovercuisine.org/events/15503 Tuesday 2/21/17 http://www.rescuingleftovercuisine.org/events/15504 Monday 2/27/17 http://www.rescuingleftovercuisine.org/events/15505 Tuesday 2/28/17 http://www.rescuingleftovercuisine.org/events/15506 Monday 3/6/17 http://www.rescuingleftovercuisine.org/events/15507 Tuesday 3/7/17 http://www.rescuingleftovercuisine.org/events/15508 Monday 3/13/17 http://www.rescuingleftovercuisine.org/events/15509 Tuesday 3/14/17 http://www.rescuingleftovercuisine.org/events/15510", "title": "Stop Food Waste and Feed the Hungry Every Monday & Tuesday In Soho. 3:00-3:30pm", "zipcode": "10012", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2259867%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Rescuing Leftover Cuisine Inc"}], "10037": [{"end": "2017-08-11", "description": "We are seeking enthusiastic, creative, industrious, responsible, punctual, and best of all, creative people who can generate fun every moment of the summer day camp experience. Depending upon your experience, you will work as Teacher, Head Counselor, or Group Leader in the classroom, in offsite locations, or in the gymnasium/outdoor playground. Must have tons of energy, a willingness to make a fool of yourself for the sake of making someone smile, the ability to give \\\"warm fuzzies\\\" on a daily basis, and a desire to have FUN! If you have experience in any of the following, this camp is for you: visual art, music, dramatic art, wacky science, coding, maker faire, financial literacy, entrepreneurship, community service, activism, literacy, education, chess, juggling, sports, yoga, firethrowing, marching band, drill team, gardening, cooking, learning, sharing love with children.", "title": "Sunny Faces Welcome! Looking For Summer Camp Counselors - NYC", "zipcode": "10037", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2336769%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "STEM Kids NYC"}, {"end": "2017-08-11", "description": "We're looking for CodeSters who have the ability, fluidity, and patience to work with students between the ages of 6-16 with instruction on app development, website development, robotics, or game development. You will be on the cutting edge of teaching computer science concepts, as less than 10% of New York City, as well as US schools have a computer science curriculum. You will utilize the existing creativity that already exists within the spirits of children, as well as their knack for apps and video games, and channel this energy into supporting them in learning wireframing, weibsite, app & game development. If you are into Scratch, Arduino, JAVA, or HTML, this is a PLUS. Come contribute your mastery to increase the interest in STEM in our students one of our Harlem locations!", "title": "Teach Kids How To Code: Join Our Summer STEM Program In Harlem!", "zipcode": "10037", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2336778%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "STEM Kids NYC"}], "10036": [{"end": "2017-08-25", "description": "Looking for an art teacher, a recreation/gym teacher and 3 group leaders to assist with kids aged 5 - 13 for a Day Camp.", "title": "Vacation Bible School Day Camp Volunteer", "zipcode": "10036", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2710771%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "The Salvation Army - Times Square"}], "10031": [{"end": "2017-08-28", "description": "Google CS First Guru The Boys and Girls Club of Harlem is committed to providing access and opportunity fo r students throughout the area to reach their full potential. The Boys and Girls Club reaches students at 5 sites across Harlem. O ur mission for the CS program is to introduce kids to STEM programs at a young age . This is designed to peak an interest so students will one day enter the career field of STEM. Volunteers are crucial to the advancement of these goals. We appreciate every volunteer who comes through our door s and provide you the best skills to succeed with the organization. Should the full 2 hours work for you our sessions are 1 hour blocks. We would love to have you for just 1 hour in that window. CS first volunteer BGC Harlem is seeking a dedicated individual to teach a computer science program to students during the summer We will provide all training necessary to make sure you are confident with your skills before placing you in the classroom We understand you may have a very busy schedule, however, we would ask for 2 hours a day 1-2 days per week. College and high school students looking for volunteer hours are strongly encouraged to apply.", "title": "Google CS First Guru", "zipcode": "10031", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2676610%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Boys & Girls Club of Harlem"}, {"end": "2017-08-12", "description": "We make sure all our volunteers are recognize for their hard work.The volunteers will be welcome into a basketball family Program", "title": "Playing on the Edge Basketball Program Inc.", "zipcode": "10031", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2080109%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Playing On The Edge Basketball Program Inc"}], "10016": [{"end": "2017-06-29", "description": "Breaking Ground is looking for a few good men and women to help facilitate our Summer BBQ at the Prince George for our formerly homeless residents. Please join is in this fun, community-building event. Volunteer Tasks: Food Server (Main Course) Serve food, refill food pans, making sure everything stays hot, explain any of the food items to tenants or refer to staff. Food Server (Main Course) Serve food, refill food pans, making sure everything stays hot, explain any of the food items to tenants or refer to staff. Food Server (Main Course) Serve food, refill food pans, making sure everything stays hot, explain any of the food items to tenants or refer to staff. Food Server (Main Course) Serve food, refill food pans, making sure everything stays hot, explain any of the food items to tenants or refer to staff. Dessert Table Serve dessert to tenants, pre-cut desserts and answer any dietary questions. Beverage Table Pass out beverages and refill supply of beverages. Condiments Take photos of tenants during the event and against the photo wall. Candid and posed photos. Dance floor initiator! / Photographer Encourage tenants to take a part of the dancing offered. Talk with tenants and create an inviting atmosphere.", "title": "Summer BBQ at the Prince George", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2725609%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Breaking Ground"}, {"end": "2017-07-15", "description": "Volunteers needed to help disabled people with shopping, running errands and reading mail to the blind. If interested call 718-606-9712 This the 3rd Saturday of every month", "title": "Be A Friend Day", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2069184%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2018-01-13", "description": "Volunteers needed to deliver food in all boroughs. Car not necessary. If you cannot do it on a specific date we can still use your help with food delivery during thae week. Interested persons should call 718-606-9712.", "title": "Deliver Food", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2318462%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-12-31", "description": "Volunteer Buddies needed to help disabled adults. Commitment is 1 day a week for 3 hours. Volunteers will help disabled clients with shopping, running errands, and reading mail to the blind. Call 718-606-9712 for more information.", "title": "Volunteer Companions Needed", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2062578%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-12-31", "description": "Be a friend to a disabled adult help 1 day a week for 2 or 3 hours with shopping, running errands, and reading mail.", "title": "Be A Buddy to a Disabled Adult", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2025017%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-12-31", "description": "Volunteers needed who can bring food to homebound adults, car is not necessary you can pick up food in Queens and deliver it to Brooklyn if interested call 718-606-9712", "title": "Deliver Food", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2485917%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}, {"end": "2017-12-31", "description": "Volunteers needed to take people to doctor's appointments and other necessary errands. Car is not needed will use Acess A Ride. If interested call 718-606-9712", "title": "Volunteer needed to help people to doctor's appointments and run errands", "zipcode": "10016", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2131251%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Helping Hands for the Disabled of NYC"}], "10014": [{"end": "2017-08-31", "description": "The National Parks Conservation Association's (NPCA) Northeast office is seeking volunteers to join the NPCA staff in tabling in Christopher Park to increase awareness regarding Stonewall National Monument. This summer, volunteers will be tabling near the Stonewall Inn in Christopher Park to answer questions and provide more information to the public about the recently designated Stonewall National Monument in Greenwich Village, the first National Park Service (NPS) site dedicated to LGBT history and the site of the 1969 uprisings that sparked the modern LGBT civil rights movement. Through the end of August, we plan to reach hundreds of visitors at tables located around Stonewall from 3-6pm on weekdays and 12-6pm on weekends. Engage with the public and help us celebrate the upcoming one-year anniversary of Stonewall's National Monument designation! Responsibilities: Talk to passers-by and share the story of Stonewall Discuss the recent designation of the Stonewall National Monument, and provide answers to basic questions Get feedback from visitors about their ideas for the future of Stonewall National Monument Maintain sign-up list for people interested in getting on the park's mailing list Direct the public to a website where they can learn more Set up and break down tabling materials Requirements: Be friendly and outgoing, ready to engage the public Interest in LGBT rights Available for 2 or 3 hour shifts Enjoy being outside Ability to lift table and chairs", "title": "Stonewall National Monument Volunteers", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2691779%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "National Parks Conservation Association"}, {"end": "2017-11-18", "description": "JOIN HUDSON RIVER PARK&rsquo;S HRPGreenTeam Gain meaningful experience working with like-minded individuals looking to beautify and maintain Hudson River Park&rsquo;s picturesque waterside landscape! This volunteer program is an exciting opportunity for community members to nurture their inner green thumb alongside their neighbors while improving public green space. Members of the HRPGreenTeam will work with our seasoned horticulture staff and participate in landscape enhancement activities including planting, weeding, pruning, mulching, trimming of ornamental grasses, addition of soil amendments, cleaning of vegetation beds, and other general gardening tasks. When: One Saturday of every month from March-October; 10AM-1PM March 25th April 15th May6th June 3rd June 17th July 15th July 29th August 12th August 26th September 9th October 21st November 18th What we provide: Safety and horticulture training, tools and equipment, Hudson River Park Volunteer T-Shirt, water, snacks, FUN! Can&rsquo;t commit to all of our events? No problem! RSVP to any or all of the Green Team volunteer days. Locations and activities will vary each month, and volunteers will get to experience the Park from a whole new perspective throughout the seasons. Space is limited, so RSVP today to volunteer@fohrp.org or call for more information (347-515-2242)", "title": "HRP GreenTeam at Hudson River Park!", "zipcode": "10014", "link": "http%3A%2F%2Fwww.volunteermatch.org%2Fresults%2Fopp_detail.jsp%3Foppid%3D2080469%26apiAccountName%3Dnycmap%26isPublicProgramKey%3Dtrue", "org": "Hudson River Park Trust"}]}